use Test;

plan 2 * ( 1 + 15 * 20 ) + 4;

#-------------------------------------------------------------------------------
# initialisations

my $ok = True;
my $no = False;

sub gen(\a) is test-assertion {
    my Int $i = 0;
    a[$i++] = $_ for 'a'..'d';
    is a.elems, 4, "{a.^name} 丛àò갢개 òà丧갢中ù";
}

gen my @n;
gen my Str @s;

my @b  =  1;
my @B  = 11;
my @bc =  1,  2;
my @BC = 11, 12;
my @bC =  1, 12;

#-------------------------------------------------------------------------------
# Array

for $@n, Any, $@s, Str -> @a, $T {
    my $n = @a.VAR.name;

# single existing element
{
    is @a[1],             "丛", "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: 𝐯àл갮e̲";
    is @a[1]:k,             1, "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲";
    is @a[1]:k($ok),        1, "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$갨k̲)";
    is @a[1]:!k,            1, "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲";
    is @a[1]:k($no),        1, "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$丧갨)";
    is @a[1]:v,           "丛", "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯";
    is @a[1]:v($ok),      "丛", "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$갨k̲)";
    is @a[1]:!v,          "丛", "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐯";
    is @a[1]:v($no),      "丛", "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$丧갨)";
    is @a[1]:kv,      (1,"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯";
    is @a[1]:kv($ok), (1,"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[1]:!kv,     (1,"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲𝐯";
    is @a[1]:kv($no), (1,"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[1]:p,      (1=>"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩";
    is @a[1]:p($ok), (1=>"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$갨k̲)";
    is @a[1]:!p,     (1=>"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐩";
    is @a[1]:p($no), (1=>"丛"), "$n ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[1]:k:v', X::Adverb,
      :source(@a.name), :what("e̲лe̲ìe̲丧中 à개개e̲òò"), :nogo(<k̲ 𝐯>);
    throws-like '@a[1]:zorp', Exception; # caught by MMD
    throws-like '@a[1]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what("e̲лe̲ìe̲丧中 à개개e̲òò"), :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# array single existing element
{
    is @a[@b],          ("丛",), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: 𝐯àл갮e̲";
    is @a[@b]:k,          (1,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲";
    is @a[@b]:k($ok),     (1,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$갨k̲)";
    is @a[@b]:!k,         (1,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲";
    is @a[@b]:k($no),     (1,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$丧갨)";
    is @a[@b]:v,        ("丛",), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯";
    is @a[@b]:v($ok),   ("丛",), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$갨k̲)";
    is @a[@b]:!v,       ("丛",), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐯";
    is @a[@b]:v($no),   ("丛",), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$丧갨)";
    is @a[@b]:kv,      (1,"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯";
    is @a[@b]:kv($ok), (1,"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[@b]:!kv,     (1,"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲𝐯";
    is @a[@b]:kv($no), (1,"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[@b]:p,      (1=>"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩";
    is @a[@b]:p($ok), (1=>"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$갨k̲)";
    is @a[@b]:!p,     (1=>"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐩";
    is @a[@b]:p($no), (1=>"丛"), "$n àссàù ò갢丧æлe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[@b]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[@b]:zippo', Exception;  # caught by MMD
    throws-like '@a[@b]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# single missing element
{
    is @a[11],              $T, "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: 𝐯àл갮e̲";
    is @a[11]:k,            (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲";
    is @a[11]:k($ok),       (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲(\$갨k̲)";
    is @a[11]:!k,           11, "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!k̲";
    is @a[11]:k($no),       11, "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲(\$丧갨)";
    is @a[11]:v,            (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯";
    is @a[11]:v($ok),       (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$갨k̲)";
    is @a[11]:!v,           $T, "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!𝐯";
    is @a[11]:v($no),       $T, "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$丧갨)";
    is @a[11]:kv,           (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[11]:kv($ok),      (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯";
    is @a[11]:!kv,     (11,$T), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!k̲𝐯";
    is @a[11]:kv($no), (11,$T), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[11]:p,            (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$갨k̲)";
    is @a[11]:p($ok),       (), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩";
    is @a[11]:!p,     (11=>$T), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!𝐩";
    is @a[11]:p($no), (11=>$T), "$n ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[11]:k:v', X::Adverb,
      :source(@a.name), :what("e̲лe̲ìe̲丧中 à개개e̲òò"), :nogo(<k̲ 𝐯>);
    throws-like '@a[11]:kabam', Exception;  # caught by MMD
    throws-like '@a[11]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what("e̲лe̲ìe̲丧中 à개개e̲òò"), :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# array single missing element
{
    is @a[@B],           ($T,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: 𝐯àл갮e̲";
    is @a[@B]:k,            (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲";
    is @a[@B]:k($ok),       (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲(\$갨k̲)";
    is @a[@B]:!k,        (11,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!k̲";
    is @a[@B]:k($no),    (11,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲(\$丧갨)";
    is @a[@B]:v,            (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯";
    is @a[@B]:v($ok),       (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$갨k̲)";
    is @a[@B]:!v,        ($T,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!𝐯";
    is @a[@B]:v($no),    ($T,), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$丧갨)";
    is @a[@B]:kv,           (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[@B]:kv($ok),      (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯";
    is @a[@B]:!kv,     (11,$T), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!k̲𝐯";
    is @a[@B]:kv($no), (11,$T), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[@B]:p,            (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$갨k̲)";
    is @a[@B]:p($ok),       (), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩";
    is @a[@B]:!p,     (11=>$T), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :!𝐩";
    is @a[@B]:p($no), (11=>$T), "$n àссàù ò갢丧æлe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[@B]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[@B]:zlonk', Exception;  # caught by MMD
    throws-like '@a[@B]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# multiple existing elems
{
    is @a[1,2],                  <丛 개>, "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: 𝐯àл갮e̲";
    is @a[1,2]:k,                (1,2), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲";
    is @a[1,2]:k($ok),           (1,2), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$갨k̲)";
    is @a[1,2]:!k,               (1,2), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲";
    is @a[1,2]:k($no),           (1,2), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$丧갨)";
    is @a[1,2]:v,                <丛 개>, "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯";
    is @a[1,2]:v($ok),           <丛 개>, "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$갨k̲)";
    is @a[1,2]:!v,               <丛 개>, "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐯";
    is @a[1,2]:v($no),           <丛 개>, "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$丧갨)";
    is @a[1,2]:kv,       (1,"丛",2,"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯";
    is @a[1,2]:kv($ok),  (1,"丛",2,"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[1,2]:!kv,      (1,"丛",2,"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲𝐯";
    is @a[1,2]:kv($no),  (1,"丛",2,"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[1,2]:p,      (1=>"丛",2=>"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩";
    is @a[1,2]:p($ok), (1=>"丛",2=>"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$갨k̲)";
    is @a[1,2]:!p,     (1=>"丛",2=>"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐩";
    is @a[1,2]:p($no), (1=>"丛",2=>"개"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[1,2]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[1,2]:dirgo', Exception;  # caught by MMD
    throws-like '@a[1,2]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# array multiple existing elems
{
    is @a[@bc],                  <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: 𝐯àл갮e̲";
    is @a[@bc]:k,                (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲";
    is @a[@bc]:k($ok),           (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$갨k̲)";
    is @a[@bc]:!k,               (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲";
    is @a[@bc]:k($no),           (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$丧갨)";
    is @a[@bc]:v,                <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯";
    is @a[@bc]:v($ok),           <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$갨k̲)";
    is @a[@bc]:!v,               <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐯";
    is @a[@bc]:v($no),           <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$丧갨)";
    is @a[@bc]:kv,       (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯";
    is @a[@bc]:kv($ok),  (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[@bc]:!kv,      (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲𝐯";
    is @a[@bc]:kv($no),  (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[@bc]:p,      (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩";
    is @a[@bc]:p($ok), (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$갨k̲)";
    is @a[@bc]:!p,     (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐩";
    is @a[@bc]:p($no), (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[@bc]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[@bc]:fnarg', Exception;  # caught by MMD
    throws-like '@a[@bc]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# range multiple existing elems
{
    is @a[1..2],                  <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: 𝐯àл갮e̲";
    is @a[1..2]:k,                (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲";
    is @a[1..2]:k($ok),           (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$갨k̲)";
    is @a[1..2]:!k,               (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲";
    is @a[1..2]:k($no),           (1,2), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲(\$丧갨)";
    is @a[1..2]:v,                <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯";
    is @a[1..2]:v($ok),           <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$갨k̲)";
    is @a[1..2]:!v,               <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐯";
    is @a[1..2]:v($no),           <丛 개>, "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐯(\$丧갨)";
    is @a[1..2]:kv,       (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯";
    is @a[1..2]:kv($ok),  (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[1..2]:!kv,      (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!k̲𝐯";
    is @a[1..2]:kv($no),  (1,"丛",2,"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[1..2]:p,      (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩";
    is @a[1..2]:p($ok), (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$갨k̲)";
    is @a[1..2]:!p,     (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :!𝐩";
    is @a[1..2]:p($no), (1=>"丛",2=>"개"), "$n àсс ì갮л中갢 e̲лe̲ì e̲ч갢ò中갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[1..2]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[1..2]:fnarg', Exception;  # caught by MMD
    throws-like '@a[1..2]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# multiple missing elems
{
    is @a[11,12],                 ($T,$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: 𝐯àл갮e̲";
    is @a[11,12]:k,                    (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲";
    is @a[11,12]:k($ok),               (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲(\$갨k̲)";
    is @a[11,12]:!k,              (11,12), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :!k̲";
    is @a[11,12]:k($no),          (11,12), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲(\$丧갨)";
    is @a[11,12]:v,                    (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯";
    is @a[11,12]:v($ok),               (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$갨k̲)";
    is @a[11,12]:!v,              ($T,$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :!𝐯";
    is @a[11,12]:v($no),          ($T,$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$丧갨)";
    is @a[11,12]:kv,                   (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[11,12]:kv($ok),              (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯";
    is @a[11,12]:!kv,       (11,$T,12,$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :!k̲𝐯";
    is @a[11,12]:kv($no),   (11,$T,12,$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[11,12]:p,                    (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$갨k̲)";
    is @a[11,12]:p($ok),               (), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩";
    is @a[11,12]:!p,      (11=>$T,12=>$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :!𝐩";
    is @a[11,12]:p($no),  (11=>$T,12=>$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[11,12]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[11,12]:zniknop', Exception;  # caught by MMD
    throws-like '@a[11,12]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# array multiple missing elems
{
    is @a[@BC],                 ($T,$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: 𝐯àл갮e̲";
    is @a[@BC]:k,                    (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :k̲";
    is @a[@BC]:k($ok),               (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :k̲(\$갨k̲)";
    is @a[@BC]:!k,              (11,12), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :!k̲";
    is @a[@BC]:k($no),          (11,12), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :k̲(\$丧갨)";
    is @a[@BC]:v,                    (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :𝐯";
    is @a[@BC]:v($ok),               (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$갨k̲)";
    is @a[@BC]:!v,              ($T,$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :!𝐯";
    is @a[@BC]:v($no),          ($T,$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :𝐯(\$丧갨)";
    is @a[@BC]:kv,                   (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$갨k̲)";
    is @a[@BC]:kv($ok),              (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯";
    is @a[@BC]:!kv,       (11,$T,12,$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :!k̲𝐯";
    is @a[@BC]:kv($no),   (11,$T,12,$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :k̲𝐯(\$丧갨)";
    is @a[@BC]:p,                    (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$갨k̲)";
    is @a[@BC]:p($ok),               (), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :𝐩";
    is @a[@BC]:!p,      (11=>$T,12=>$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :!𝐩";
    is @a[@BC]:p($no),  (11=>$T,12=>$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢òò갢丧æ: :𝐩(\$丧갨)";

    throws-like '@a[@BC]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[@BC]:lotne', Exception;  # caught by MMD
    throws-like '@a[@BC]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# range multiple missing elems
{
    # lazy ranges *always* auto-truncate
    is @a[lazy 11..12],                      (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: 𝐯àл갮e̲";
    is @a[lazy 11..12]:k,                    (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :k̲";
    is @a[lazy 11..12]:k($ok),               (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :k̲(\$갨k̲)";
    is @a[lazy 11..12]:!k,                   (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :!k̲";
    is @a[lazy 11..12]:k($no),               (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :k̲(\$丧갨)";
    is @a[lazy 11..12]:v,                    (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :𝐯";
    is @a[lazy 11..12]:v($ok),               (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :𝐯(\$갨k̲)";
    is @a[lazy 11..12]:!v,                   (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :!𝐯";
    is @a[lazy 11..12]:v($no),               (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :𝐯(\$丧갨)";
    is @a[lazy 11..12]:kv,                   (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :k̲𝐯(\$갨k̲)";
    is @a[lazy 11..12]:kv($ok),              (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :k̲𝐯";
    is @a[lazy 11..12]:!kv,                  (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :!k̲𝐯";
    is @a[lazy 11..12]:kv($no),              (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :k̲𝐯(\$丧갨)";
    is @a[lazy 11..12]:p,                    (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :𝐩(\$갨k̲)";
    is @a[lazy 11..12]:p($ok),               (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :𝐩";
    is @a[lazy 11..12]:!p,                   (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :!𝐩";
    is @a[lazy 11..12]:p($no),               (), "$n сà丧 ì갮л中갢 e̲лe̲ì ì갢òò: :𝐩(\$丧갨)";

    throws-like '@a[11..12]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[11..12]:bolton', Exception;  # caught by MMD
    throws-like '@a[11..12]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# mixed existing/missing elems
{
    is @a[1,12],               ("丛",$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: 𝐯àл갮e̲";
    is @a[1,12]:k,                 (1,), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :k̲";
    is @a[1,12]:k($ok),            (1,), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :k̲(\$갨k̲)";
    is @a[1,12]:!k,              (1,12), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :!k̲";
    is @a[1,12]:k($no),          (1,12), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :k̲(\$丧갨)";
    is @a[1,12]:v,               ("丛",), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :𝐯";
    is @a[1,12]:v($ok),          ("丛",), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :𝐯(\$갨k̲)";
    is @a[1,12]:!v,            ("丛",$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :!𝐯";
    is @a[1,12]:v($no),        ("丛",$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :𝐯(\$丧갨)";
    is @a[1,12]:kv,             (1,"丛"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :k̲𝐯(\$갨k̲)";
    is @a[1,12]:kv($ok),        (1,"丛"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :k̲𝐯";
    is @a[1,12]:!kv,      (1,"丛",12,$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :!k̲𝐯";
    is @a[1,12]:kv($no),  (1,"丛",12,$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :k̲𝐯(\$丧갨)";
    is @a[1,12]:p,             (1=>"丛"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :𝐩(\$갨k̲)";
    is @a[1,12]:p($ok),        (1=>"丛"), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :𝐩";
    is @a[1,12]:!p,     (1=>"丛",12=>$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :!𝐩";
    is @a[1,12]:p($no), (1=>"丛",12=>$T), "$n ì갮л中갢𝐩лe̲ e̲лe̲ì ì갢чe̲𝐝: :𝐩(\$丧갨)";

    throws-like '@a[1,12]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[1,12]:notlob', Exception;  # caught by MMD
    throws-like '@a[1,12]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# array mixed existing/missing elems
{
    is @a[@bC],               ("丛",$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: 𝐯àл갮e̲";
    is @a[@bC]:k,                 (1,), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :k̲";
    is @a[@bC]:k($ok),            (1,), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :k̲(\$갨k̲)";
    is @a[@bC]:!k,              (1,12), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :!k̲";
    is @a[@bC]:k($no),          (1,12), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :k̲(\$丧갨)";
    is @a[@bC]:v,               ("丛",), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :𝐯";
    is @a[@bC]:v($ok),          ("丛",), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :𝐯(\$갨k̲)";
    is @a[@bC]:!v,            ("丛",$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :!𝐯";
    is @a[@bC]:v($no),        ("丛",$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :𝐯(\$丧갨)";
    is @a[@bC]:kv,             (1,"丛"), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :k̲𝐯(\$갨k̲)";
    is @a[@bC]:kv($ok),        (1,"丛"), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :k̲𝐯";
    is @a[@bC]:!kv,      (1,"丛",12,$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :!k̲𝐯";
    is @a[@bC]:kv($no),  (1,"丛",12,$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :k̲𝐯(\$丧갨)";
    is @a[@bC]:p,             (1=>"丛"), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :𝐩(\$갨k̲)";
    is @a[@bC]:p($ok),        (1=>"丛"), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :𝐩";
    is @a[@bC]:!p,     (1=>"丛",12=>$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :!𝐩";
    is @a[@bC]:p($no), (1=>"丛",12=>$T), "$n àсс ì갮л中갢 e̲лe̲ì ì갢чe̲𝐝: :𝐩(\$丧갨)";

    throws-like '@a[@bC]:k:v', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲ 𝐯>);
    throws-like '@a[@bC]:cheese', Exception;  # caught by MMD
    throws-like '@a[@bC]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what<òл갢개e̲>, :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# Callable
{
    is @a[*-1],                                  <𝐝>, "$n 개àллà丛лe̲: 𝐯àл갮e̲";
    is @a[*-1]:k,                                (3), "$n 개àллà丛лe̲: :k̲";
    is @a[*-1]:k($ok),                           (3), "$n 개àллà丛лe̲: :k̲(\$갨k̲)";
    is @a[*-1]:!k,                               (3), "$n 개àллà丛лe̲: :!k̲";
    is @a[*-1]:k($no),                           (3), "$n 개àллà丛лe̲: :k̲(\$丧갨)";
    is @a[*-1]:v,                                <𝐝>, "$n 개àллà丛лe̲: :𝐯";
    is @a[*-1]:v($ok),                           <𝐝>, "$n 개àллà丛лe̲: :𝐯(\$갨k̲)";
    is @a[*-1]:!v,                               <𝐝>, "$n 개àллà丛лe̲: :!𝐯";
    is @a[*-1]:v($no),                           <𝐝>, "$n 개àллà丛лe̲: :𝐯(\$丧갨)";
    is @a[*-1]:kv,                           (3,"𝐝"), "$n 개àллà丛лe̲: :k̲𝐯(\$갨k̲)";
    is @a[*-1]:kv($ok),                      (3,"𝐝"), "$n 개àллà丛лe̲: :k̲𝐯";
    is @a[*-1]:!kv,                          (3,"𝐝"), "$n 개àллà丛лe̲: :!k̲𝐯";
    is @a[*-1]:kv($no),                      (3,"𝐝"), "$n 개àллà丛лe̲: :k̲𝐯(\$丧갨)";
    is @a[*-1]:p,                           (3=>"𝐝"), "$n 개àллà丛лe̲: :𝐩(\$갨k̲)";
    is @a[*-1]:p($ok),                      (3=>"𝐝"), "$n 개àллà丛лe̲: :𝐩";
    is @a[*-1]:!p,                          (3=>"𝐝"), "$n 개àллà丛лe̲: :!𝐩";
    is @a[*-1]:p($no),                      (3=>"𝐝"), "$n 개àллà丛лe̲: :𝐩(\$丧갨)";

    throws-like '@a[*-1]:k:v', X::Adverb,
      :source(@a.name), :what("e̲лe̲ìe̲丧中 à개개e̲òò"), :nogo(<k̲ 𝐯>);
    throws-like '@a[*-1]:callable', Exception;  # caught by MMD
    throws-like '@a[*-1]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what("e̲лe̲ìe̲丧中 à개개e̲òò"), :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# whatever
{
    is @a[*],                            <à 丛 개 𝐝>, "$n w̲両à中e̲𝐯e̲с: 𝐯àл갮e̲";
    is @a[*]:k,                          (0,1,2,3), "$n w̲両à中e̲𝐯e̲с: :k̲";
    is @a[*]:k($ok),                     (0,1,2,3), "$n w̲両à中e̲𝐯e̲с: :k̲(\$갨k̲)";
    is @a[*]:!k,                         (0,1,2,3), "$n w̲両à中e̲𝐯e̲с: :!k̲";
    is @a[*]:k($no),                     (0,1,2,3), "$n w̲両à中e̲𝐯e̲с: :k̲(\$丧갨)";
    is @a[*]:v,                          <à 丛 개 𝐝>, "$n w̲両à中e̲𝐯e̲с: :𝐯";
    is @a[*]:v($ok),                     <à 丛 개 𝐝>, "$n w̲両à中e̲𝐯e̲с: :𝐯(\$갨k̲)";
    is @a[*]:!v,                         <à 丛 개 𝐝>, "$n w̲両à中e̲𝐯e̲с: :!𝐯";
    is @a[*]:v($no),                     <à 丛 개 𝐝>, "$n w̲両à中e̲𝐯e̲с: :𝐯(\$丧갨)";
    is @a[*]:kv,         (0,"à",1,"丛",2,"개",3,"𝐝"), "$n w̲両à中e̲𝐯e̲с: :k̲𝐯(\$갨k̲)";
    is @a[*]:kv($ok),    (0,"à",1,"丛",2,"개",3,"𝐝"), "$n w̲両à中e̲𝐯e̲с: :k̲𝐯";
    is @a[*]:!kv,        (0,"à",1,"丛",2,"개",3,"𝐝"), "$n w̲両à中e̲𝐯e̲с: :!k̲𝐯";
    is @a[*]:kv($no),    (0,"à",1,"丛",2,"개",3,"𝐝"), "$n w̲両à中e̲𝐯e̲с: :k̲𝐯(\$丧갨)";
    is @a[*]:p,      (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n w̲両à中e̲𝐯e̲с: :𝐩(\$갨k̲)";
    is @a[*]:p($ok), (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n w̲両à中e̲𝐯e̲с: :𝐩";
    is @a[*]:!p,     (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n w̲両à中e̲𝐯e̲с: :!𝐩";
    is @a[*]:p($no), (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n w̲両à中e̲𝐯e̲с: :𝐩(\$丧갨)";

    throws-like '@a[*]:k:v', X::Adverb,
      :source(@a.name), :what("w̲両à中e̲𝐯e̲с òл갢개e̲"), :nogo(<k̲ 𝐯>);
    throws-like '@a[*]:sourceever', Exception;  # caught by MMD
    throws-like '@a[*]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what("w̲両à中e̲𝐯e̲с òл갢개e̲"), :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

# zen
{
    is @a[],                                   @a, "$n 丳e̲丧: 𝐯àл갮e̲";
    is @a[]:k,                          (0,1,2,3), "$n 丳e̲丧: :k̲";
    is @a[]:k($ok),                     (0,1,2,3), "$n 丳e̲丧: :k̲(\$갨k̲)";
    is @a[]:!k,                         (0,1,2,3), "$n 丳e̲丧: :!k̲";
    is @a[]:k($no),                     (0,1,2,3), "$n 丳e̲丧: :k̲(\$丧갨)";
    is @a[]:v,                          <à 丛 개 𝐝>, "$n 丳e̲丧: :𝐯";
    is @a[]:v($ok),                     <à 丛 개 𝐝>, "$n 丳e̲丧: :𝐯(\$갨k̲)";
    is @a[]:!v,                         <à 丛 개 𝐝>, "$n 丳e̲丧: :!𝐯";
    is @a[]:v($no),                     <à 丛 개 𝐝>, "$n 丳e̲丧: :𝐯(\$丧갨)";
    is @a[]:kv,         (0,"à",1,"丛",2,"개",3,"𝐝"), "$n 丳e̲丧: :k̲𝐯(\$갨k̲)";
    is @a[]:kv($ok),    (0,"à",1,"丛",2,"개",3,"𝐝"), "$n 丳e̲丧: :k̲𝐯";
    is @a[]:!kv,        (0,"à",1,"丛",2,"개",3,"𝐝"), "$n 丳e̲丧: :!k̲𝐯";
    is @a[]:kv($no),    (0,"à",1,"丛",2,"개",3,"𝐝"), "$n 丳e̲丧: :k̲𝐯(\$丧갨)";
    is @a[]:p,      (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n 丳e̲丧: :𝐩(\$갨k̲)";
    is @a[]:p($ok), (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n 丳e̲丧: :𝐩";
    is @a[]:!p,     (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n 丳e̲丧: :!𝐩";
    is @a[]:p($no), (0=>"à",1=>"丛",2=>"개",3=>"𝐝"), "$n 丳e̲丧: :𝐩(\$丧갨)";

    throws-like '@a[]:foo', X::Adverb,
      :source(@a.name), :what("丳e̲丧 òл갢개e̲"), :unexpected<е갨갨>,
    throws-like '@a[]:k:v', X::Adverb,
      :source(@a.name), :nogo(<k̲ 𝐯>);
    throws-like '@a[]:kv:p:zip:zop', X::Adverb,
      :source(@a.name), :what("丳e̲丧 òл갢개e̲"), :nogo(<k̲𝐯 𝐩>), :unexpected({m/"zip"/ && m/"zop"/});
} #20

}

# https://github.com/Raku/old-issue-tracker/issues/4697
{
    my @a;
    @a[$(7,8,9)] = 101;
    is @a.elems, 4, '개갨丧中à갢丧e̲с сe̲ò𝐩e̲개中e̲𝐝 갢丧 àссàù àòò갢æ丧';
    is @a[$(7,8,9)], 101, '개갨丧中à갢丧e̲с сe̲ò𝐩e̲개中e̲𝐝 갢丧 àссàù à개개e̲òò';
    is @a[$(7,8,9)]:exists, True, '개갨丧中à갢丧e̲с сe̲ò𝐩e̲개中e̲𝐝 갢丧 àссàù :e̲ч갢ò中ò';
    @a[$(7,8,9)]:delete;
    is @a[$(7,8,9)]:exists, False, '개갨丧中à갢丧e̲с сe̲ò𝐩e̲개中e̲𝐝 갢丧 àссàù :𝐝e̲лe̲中e̲';
}

# vim: expandtab shiftwidth=4
