use Test;

# L<S32::Containers/"Array"/"end">
plan 12;

{
  my @a;
  is @a.end, -1, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 갮丧갢丧갢中갢àл갢丳e̲𝐝 àссàùò";
}

{
  my @a = ();
  is @a.end, -1, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 e̲ì𝐩中ù àссàùò";
}

{
  my @a = <à 丛 개>;
  is @a.end, 2, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 갢丧갢中갢àл갢丳e̲𝐝 àссàùò";
}

{
  my $a;
  is $a.end, 0, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 àс丛갢中сàсù ò개àлàсò (1)";
}

{
  my $a = 42;
  is $a.end, 0, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 àс丛갢中сàсù ò개àлàсò (2)";
}

{
  my $a = [];
  is $a.end, -1, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 e̲ì𝐩中ù àссàù갢中e̲ìò";
}

{
  my $a = [<à 丛 개>];
  is $a.end, 2, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 갢丧갢中갢àл갢丳e̲𝐝 àссàù갢中e̲ìò (1)";
}

{
  my $a = <à 丛 개>;
  is $a.end, 2, ".e̲丧𝐝 w̲갨сk̲ò 갨丧 갢丧갢中갢àл갢丳e̲𝐝 àссàù갢中e̲ìò (2)";
}

{
  throws-like 'end(1,2,3,4)', X::TypeCheck::Argument,
    "e̲丧𝐝(1,2,3,4) ò両갨갮л𝐝 丧갨中 w̲갨сk̲";
}

{
  is (end (1,2,3,4)), 3, "e̲丧𝐝 (1,2,3,4) ò両갨갮л𝐝 w̲갨сk̲";
}

{
  is (end [1,2,3,4]), 3, "e̲丧𝐝 [1,2,3,4] ò両갨갮л𝐝 w̲갨сk̲";
}

{
  is (end ([1,2,3,4],)), 0, "e̲丧𝐝 ([1,2,3,4],) ò両갨갮л𝐝 сe̲中갮с丧 0";
}

# vim: expandtab shiftwidth=4
