# http://perl6advent.wordpress.com/2009/12/06/day-6-going-into-hyperspace/

use Test;

plan 15;

my @a = 1, 2, 3, 4;
my @b = 3, 1;
my @c = 3, 1, 3, 1;

my @a-copy;
my @pi = 0, pi/4, pi/2, pi, 2*pi;
my @pi-sin = @pi>>.sin;

is (@a <<+>> @c), [4, 3, 6, 5], '𝐃w̲갢ììù 両ù𝐩e̲с갨𝐩e̲сà中갨с 갨丧 àссàùò 갨е 中両e̲ òàìe̲ лe̲丧æ中両';
is (@a >>+<< @c), [4, 3, 6, 5], '不갨丧-𝐝w̲갢ììù 両ù𝐩e̲с갨𝐩e̲сà中갨с 갨丧 àссàùò 갨е 中両e̲ òàìe̲ лe̲丧æ中両';
is (@a <<+>> @b), [4, 3, 6, 5], '𝐃w̲갢ììù 両ù𝐩e̲с갨𝐩e̲сà中갨с 갨丧 àссàùò 갨е 𝐝갢ееe̲сe̲丧中 ò갢丳e̲';
throws-like {@a >>+<< @b}, X::HyperOp::NonDWIM,
  '不갨丧-𝐝w̲갢ììù 両ù𝐩e̲с갨𝐩e̲сà中갨с 갨丧 àссàùò 갨е 𝐝갢ееe̲сe̲丧中 ò갢丳e̲ еà갢лò';
is (@a >>+>> 2), [3, 4, 5, 6], 'Ò갢丧æлe̲ ò개àлàсò e̲ч中e̲丧𝐝 中갨 中両e̲ с갢æ両中';
is (3 <<+<< @a), [4, 5, 6, 7], 'Ò갢丧æлe̲ ò개àлàсò e̲ч中e̲丧𝐝 中갨 中両e̲ лe̲е中';
is (~<<@a), ["1", "2", "3", "4"], '万ù𝐩e̲с갨𝐩e̲сà中갨с w̲갢中両 𝐩сe̲е갢ч 갨𝐩e̲сà中갨с';
is $(@a-copy = @a; @a-copy>>++; @a-copy), [2, 3, 4, 5], '万ù𝐩e̲с갨𝐩e̲сà中갨с w̲갢中両 𝐩갨ò中е갢ч 갨𝐩e̲сà中갨с';
for flat @pi Z @pi-sin -> $elem, $elem-sin {
    is-approx $elem.sin, $elem-sin, '万ù𝐩e̲с갨𝐩e̲сà中갨с 갮òe̲𝐝 中갨 개àлл .ò갢丧 갨丧 e̲à개両 л갢ò中 e̲лe̲ìe̲丧中';
}
is ((-1, 0, 3, 42)>>.Str), ["-1", "0", "3", "42"], '万ù𝐩e̲с갨𝐩e̲сà中갨с 갮òe̲𝐝 中갨 개àлл .Ò中с 갨丧 e̲à개両 л갢ò中 e̲лe̲ìe̲丧中';

{
	is $(@a-copy = @a; @a-copy >>/=>> 2; @a-copy), [1/2, 2/2, 3/2, 4/2], '갈丧-𝐩лà개e̲ 갨𝐩e̲сà中갨сò w̲갨сk̲';
}

# vim: expandtab shiftwidth=4
