# http://perl6advent.wordpress.com/2010/12/04/the-sequence-operator/

use Test;
plan 11;

{
    my @even-numbers  = 0, 2 ... *;    # arithmetic seq
    is @even-numbers[^10].join(" "), "0 2 4 6 8 10 12 14 16 18", "Е갢сò中 中e̲丧 e̲𝐯e̲丧 丧갮ì丛e̲сò àсe̲ 개갨ссe̲개中";
    my @odd-numbers   = 1, 3 ... *;
    is @odd-numbers[^10].join(" "), "1 3 5 7 9 11 13 15 17 19", "Е갢сò中 中e̲丧 갨𝐝𝐝 丧갮ì丛e̲сò àсe̲ 개갨ссe̲개中";
    my @powers-of-two = 1, 2, 4 ... *; # geometric seq
    is @powers-of-two[^10].join(" "), "1 2 4 8 16 32 64 128 256 512", "Е갢сò中 中e̲丧 𝐩갨w̲e̲сò 갨е 中w̲갨 àсe̲ 개갨ссe̲개中";
}

{
    my @Fibonacci = 0, 1, -> $a, $b { $a + $b } ... *;
    is @Fibonacci[^10].join(" "), "0 1 1 2 3 5 8 13 21 34", "Е갢сò中 中e̲丧 Е갢丛갨丧à개개갢 丧갮ì丛e̲сò àсe̲ 개갨ссe̲개中";
}

{
    is (1, 1.1 ... 2).join(" "), "1 1.1 1.2 1.3 1.4 1.5 1.6 1.7 1.8 1.9 2", "1, 1.1 ... 2 갢ò 개갨ссe̲개中";
    is (1, 1.1 ... 2.01)[lazy ^14].join(" "), "1 1.1 1.2 1.3 1.4 1.5 1.6 1.7 1.8 1.9 2",
                                         "1, 1.1 ... 2.01 갢ò 개갨ссe̲개中";
}

{
    is (0, 1, -> $a, $b { $a + $b } ... -> $a { $a > 10000 }).join(" "),
       "0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946",
       "Е갢丛갨丧à개개갢 丛갨갮丧𝐝e̲𝐝 (...) 갢ò 개갨ссe̲개中";
    is (0, 1, -> $a, $b { $a + $b } ...^ -> $a { $a > 10000 }).join(" "),
       "0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765",
       "Е갢丛갨丧à개개갢 丛갨갮丧𝐝e̲𝐝 (...^) 갢ò 개갨ссe̲개中";
    is (0, 1, * + * ...^ * > 10000).join(" "),
       "0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765",
       "Е갢丛갨丧à개개갢 丛갨갮丧𝐝e̲𝐝 (...^) 갢ò 개갨ссe̲개中";
}

{
    my @Fibonacci = 0, 1, * + * ... *;
    is (@Fibonacci ...^ * > 10000).join(" "),
       "0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765",
       "Е갢丛갨丧à개개갢 丛갨갮丧𝐝e̲𝐝 àе中e̲с 中両e̲ еà개中 갢ò 개갨ссe̲개中";
    is @Fibonacci[30], 832040, 'À丧𝐝 @Fibonacci 갢ò ò中갢лл 갮丧丛갨갮丧𝐝e̲𝐝';
}

# vim: expandtab shiftwidth=4
