use Test;

plan 51;

# The multi-dimensional forms of *-POS should, on undimensioned data
# structures, just dig into them, doing nested access.

# Two dimensions
my @a = [1, 2], [3, 4];
is @a.AT-POS(0, 0), 1, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a.AT-POS(0, 1), 2, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a.AT-POS(1, 0), 3, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a.AT-POS(1, 1), 4, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
isa-ok @a.AT-POS(-1, 0), Failure;
isa-ok @a.AT-POS(-1, 1), Failure;
isa-ok @a.AT-POS(1,- 1), Failure;

ok @a.EXISTS-POS(0, 0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
ok @a.EXISTS-POS(1, 1), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(2, 0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(0, 2), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(-1,0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(-1,1), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(1,-1), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';

@a.ASSIGN-POS(0, 0, 5);
@a.ASSIGN-POS(0, 1, 6);
@a.ASSIGN-POS(1, 0, 7);
@a.ASSIGN-POS(1, 1, 8);
@a.ASSIGN-POS(1, 2, 9);
dies-ok { @a.ASSIGN-POS(-1, 0, 42) }, '丧e̲æà中갢𝐯e̲ 갢丧𝐝e̲ч 𝐝갢e̲ò 갨丧 àòò갢æ丧ìe̲丧中';
dies-ok { @a.ASSIGN-POS(-1, 1, 42) }, '丧e̲æà中갢𝐯e̲ 갢丧𝐝e̲ч 𝐝갢e̲ò 갨丧 àòò갢æ丧ìe̲丧中';
dies-ok { @a.ASSIGN-POS(0, -1, 42) }, '丧e̲æà中갢𝐯e̲ 갢丧𝐝e̲ч 𝐝갢e̲ò 갨丧 àòò갢æ丧ìe̲丧中';
is @a[0][0], 5, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a[0][1], 6, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a[1][0], 7, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a[1][1], 8, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a[1][2], 9, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';

@a.DELETE-POS(1, 2);
nok @a[1][2]:exists, '𝐃E̲ЛE̲专E̲-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';

@a.BIND-POS(0, 0, 42);
is @a.AT-POS(0, 0), 42, '丁갈不𝐃-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
dies-ok { @a.ASSIGN-POS(0, 0, 69) }, '丁갈不𝐃-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò сe̲àллù 丛갢丧𝐝ò';

# Three dimensions
@a = [[1,2],[3,4]], [[5,6],[7,8]];
is @a.AT-POS(0,0,0), 1, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a.AT-POS(0,0,1), 2, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a.AT-POS(0,1,0), 3, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a.AT-POS(0,1,1), 4, 'À专-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
isa-ok @a.AT-POS(-1,0,0), Failure;
isa-ok @a.AT-POS(-1,1,0), Failure;
isa-ok @a.AT-POS(1,-1,0), Failure;
isa-ok @a.AT-POS(1,1,-1), Failure;

ok @a.EXISTS-POS(0,0,0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
ok @a.EXISTS-POS(0,0,1), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(0,0,2), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(0,2,0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(2,0,0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(0,0,-1), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(0,-1,0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
nok @a.EXISTS-POS(-1,0,0), 'E̲Ч갈Ò专Ò-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';

@a.ASSIGN-POS(0, 0, 0, 5);
@a.ASSIGN-POS(0, 1, 0, 6);
@a.ASSIGN-POS(1, 0, 0, 7);
@a.ASSIGN-POS(1, 1, 0, 8);
dies-ok { @a.ASSIGN-POS(-1, 0, 42) }, '丧e̲æà中갢𝐯e̲ 갢丧𝐝e̲ч 𝐝갢e̲ò 갨丧 àòò갢æ丧ìe̲丧中';
dies-ok { @a.ASSIGN-POS(-1, 1, 42) }, '丧e̲æà中갢𝐯e̲ 갢丧𝐝e̲ч 𝐝갢e̲ò 갨丧 àòò갢æ丧ìe̲丧中';
dies-ok { @a.ASSIGN-POS(0, -1, 42) }, '丧e̲æà中갢𝐯e̲ 갢丧𝐝e̲ч 𝐝갢e̲ò 갨丧 àòò갢æ丧ìe̲丧中';
is @a[0][0][0], 5, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a[0][1][0], 6, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a[1][0][0], 7, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
is @a[1][1][0], 8, 'ÀÒÒ갈Æ不-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';

@a.DELETE-POS(1,1,0);
nok @a[1][1][0]:exists, '𝐃E̲ЛE̲专E̲-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';

@a.BIND-POS(0,0,0,42);
is @a.AT-POS(0,0,0), 42, '丁갈不𝐃-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò 𝐝갢æò 갢丧中갨 丧e̲ò中e̲𝐝 àссàùò';
dies-ok { @a.ASSIGN-POS(0,0,0,69) }, '丁갈不𝐃-𝐏갎Ò w̲갢中両 ìà丧ù 갢丧𝐝갢개e̲ò сe̲àллù 丛갢丧𝐝ò';

# vim: expandtab shiftwidth=4
