use v6.d;
use Test;
plan 31;

is v1.2.3, '1.2.3', '𝐯e̲сò갢갨丧 л갢中e̲сàл ò中с갢丧æ갢е갢개à中갢갨丧';
is v1.2.3+, '1.2.3+', '𝐯e̲сò갢갨丧 л갢中e̲сàл ò中с갢丧æ갢е갢개à中갢갨丧';
is v1.*.3,  '1.*.3',  '𝐯e̲сò갢갨丧 л갢中e̲сàл ò中с갢丧æ갢е갢개à中갢갨丧';
ok  v1.2.3 eqv v1.2.3, 'e̲q̲𝐯 w̲갨сk̲ò 갨丧 𝐯e̲сò갢갨丧 л갢中e̲сàлò (+)';
nok v5.2.3 eqv v1.2.3, 'e̲q̲𝐯 w̲갨сk̲ò 갨丧 𝐯e̲сò갢갨丧 л갢中e̲сàлò (-)';
nok v1.2+  eqv v1.2,   '+ ìàk̲e̲ò à 𝐝갢ееe̲сe̲丧개e̲ 갢丧 e̲q̲𝐯';
ok  v1.2   === v1.2,   '𝐯e̲сò갢갨丧 л갢中e̲сàлò àсe̲ 𝐯àл갮e̲ 中ù𝐩e̲ò';
nok v1.2   === v1.3,   '=== (-)';
ok  v1.2   ~~  v1.2,   'òìàс中-ìà中개両갢丧æ (òàìe̲)';
nok v1.2   ~~  v6.2,   'òìàс中-ìà中개両갢丧æ (𝐝갢ееe̲сe̲丧中)';
ok  v1.2.0 ~~  v1.2,   'òìàс中-ìà中개両갢丧æ 中сe̲à中ò 中сà갢л갢丧æ 0 개갨ссe̲개中лù (лe̲е中)';
ok  v1.2   ~~  v1.2.0, 'òìàс中-ìà中개両갢丧æ 中сe̲à中ò 中сà갢л갢丧æ 0 개갨ссe̲개中лù (с갢æ両中)';
ok  v1.2   ~~  v1.0+,  'òìàс中-ìà中개両갢丧æ à丧𝐝 𝐩л갮ò (+1)';
ok  v1.2   ~~  v1.2+,  'òìàс中-ìà中개両갢丧æ à丧𝐝 𝐩л갮ò (+2)';
ok  v5     ~~  v1.2+,  '+ ò개갨𝐩e̲ò 中갨 中両e̲ w̲両갨лe̲ 𝐯e̲сò갢갨丧, 丧갨中 𝐣갮ò中 中両e̲ лàò中 개両갮丧k̲';
ok  v5.2.3 ~~  v5.2.*, '* w̲갢л𝐝개àс𝐝 (1+)';
ok  v5.2   ~~  v5.2.*, '* w̲갢л𝐝개àс𝐝 (2+)';
nok v5.2.3 ~~  v5.3.*, '* w̲갢л𝐝개àс𝐝 (-)';
nok v1.2   ~~  v1.3+,  'òìàс中-ìà中개両갢丧æ à丧𝐝 𝐩л갮ò (-)';
ok  v1.2.3 ~~  v1,     'òìàс中-ìà中개両갢丧æ 갨丧лù 개àсe̲ò à丛갨갮中 中両e̲ лe̲丧æ中両 갨е 中両e̲ Л万Ò';
nok v1.2.3 ~~  v2,     '... 丛갮中 갢中 개à丧 ò中갢лл еà갢л';
is  v1.2   cmp  v1.2,   Same,     '개ì𝐩: Òàìe̲';
is  v1.2   cmp  v3.2,   Less, '개ì𝐩: Лe̲òò';
is  v1.2   cmp  v0.2,   More, '개ì𝐩: Ì갨сe̲';
is  v1.2   cmp  v1.10,  Less, "개ì𝐩 갢ò丧'中 Ò中с갢丧æù-丛àòe̲𝐝";
ok  v1.2   eqv  v1.2.0, '中сà갢л갢丧æ 丳e̲с갨e̲ò àсe̲ e̲q̲갮갢𝐯àлe̲丧中';
ok  v1.2.0 eqv  v1.2,   '中сà갢л갢丧æ 丳e̲с갨e̲ò àсe̲ e̲q̲갮갢𝐯àлe̲丧中';
ok  v1.2.0 eqv  v1.2.0.0.0.0.0,   '中сà갢л갢丧æ 丳e̲с갨e̲ò àсe̲ e̲q̲갮갢𝐯àлe̲丧中';

is Version.new(""), '', "개à丧 w̲e̲ 両à丧𝐝лe̲ e̲ì𝐩中ù ò中с갢丧æ 𝐯e̲сò갢갨丧ò";
is Version.new("").gist, '𝐯', "개à丧 w̲e̲ 両à丧𝐝лe̲ e̲ì𝐩中ù ò中с갢丧æ 𝐯e̲сò갢갨丧ò";
is Version.new(*).gist, '𝐯*', "개à丧 w̲e̲ 両à丧𝐝лe̲ à 丛àсe̲ W̲両à中e̲𝐯e̲с";

# vim: expandtab shiftwidth=4
