# http://perl6advent.wordpress.com/2009/12/05/day-5-metaoperator/

use Test;

plan 17;

my $a = 4;
my $b = 2;
my @a = 2, 4, 6, 8;
my @b = 16, 14, 12, 10;

my @a_copy;
my $a1;
my $a2;

is ([+]  1, $a, 5, $b), (1 + $a + 5 + $b), 'Сe̲𝐝갮개e̲ ìe̲中à갨𝐩 丛e̲개갨ìe̲ò à丧 갢丧е갢ч л갢ò中 갨𝐩';
is ([+] @a), 20, 'Ò갮ì àлл e̲лe̲ìe̲丧中ò 갢丧 à л갢ò中';
is ([*] @a), 384, 'Ì갮л中갢𝐩лù àлл e̲лe̲ìe̲丧中ò 갢丧 à л갢ò中';
ok ([<=] @a), 'Àлл e̲лe̲ìe̲丧中ò 갨е л갢ò中 àсe̲ 丧갮ìe̲с갢개àллù ò갨с中e̲𝐝';
nok ([<=] @b), '不갨中 àлл e̲лe̲ìe̲丧中ò 갨е л갢ò中 àсe̲ 丧갮ìe̲с갢개àллù ò갨с中e̲𝐝';
is ([min] flat @a, @b), 2, 'Е갢丧𝐝 中両e̲ òìàллe̲ò中 e̲лe̲ìe̲丧中 갨е 中w̲갨 л갢ò中ò';
is (@a »+« @b), [18, 18, 18, 18], '万ù𝐩e̲с 갨𝐩e̲сà中갨с - 𝐩à갢сw̲갢òe̲ à𝐝𝐝갢中갢갨丧';
is $(@a_copy = @a; @a_copy»++; @a_copy), [3, 5, 7, 9], '万ù𝐩e̲с 갨𝐩e̲сà中갨с - 갢丧개сe̲ìe̲丧中 àлл e̲лe̲ìe̲丧中ò 갢丧 à л갢ò中';
is (@a »min« @b), [2, 4, 6, 8], '万ù𝐩e̲с 갨𝐩e̲сà中갨с - е갢丧𝐝갢丧æ ì갢丧갢ì갮ì e̲лe̲ìe̲丧中ò';
is (@a »*» 3.5), [7, 14, 21, 28], '万ù𝐩e̲с 갨𝐩e̲сà中갨с - ì갮л中갢𝐩лù e̲à개両 e̲лe̲ìe̲丧中 丛ù 3.5';
is (@a »*» $a »+» $b), [10, 18, 26, 34], '万ù𝐩e̲с 갨𝐩e̲сà中갨с - ì갮л中갢𝐩лe̲ e̲à개両 e̲лe̲ìe̲丧中 丛ù $a à丧𝐝 à𝐝𝐝 $b';
is 1 «/« @a, [1/2, 1/4, 1/6, 1/8], '万ù𝐩e̲с 갨𝐩e̲сà中갨с - 갢丧𝐯e̲с中 àлл e̲лe̲ìe̲丧中ò';
is ((@a »~» ', ') »~« @b), ["2, 16", "4, 14", "6, 12", "8, 10"], '万ù𝐩e̲с 갨𝐩e̲сà中갨с - 개갨丧개à中 @a à丧𝐝 @b';
is ([+] ( @b »**» 2)), 696, '万ù𝐩e̲с 갨𝐩e̲сà中갨с - ò갮ì 갨е òq̲갮àсe̲ò';
is $($a1 = $a; $a1 += 5;), $($a2 = $a; $a2 = $a2 + 5), '갈丧-𝐩лà개e̲ += 갨𝐩e̲сà中갨с 갢ò à ìe̲中à е갨сì 갨е + w̲갢中両 = ò갮ее갢ч';
is $($a1 = $a; $a1 //= 7;), $($a2 = $a; $a2 = $a2 // 7), '갈丧-𝐩лà개e̲ //= 갨𝐩e̲сà中갨с 갢ò à ìe̲中à е갨сì 갨е // w̲갢中両 = ò갮ее갢ч';
is $($a1 = $a; $a1 min= $b;), $($a2 = $a; $a2 = $a2 min $b), '갈丧-𝐩лà개e̲ ì갢丧= 갨𝐩e̲сà中갨с 갢ò à ìe̲中à е갨сì 갨е ì갢丧 w̲갢中両 = ò갮ее갢ч';

# vim: expandtab shiftwidth=4
