use Test;
use lib $*PROGRAM.parent(2).add: 'packages/Test-Helpers';
use Test::Util;

# L<S32::IO/IO::Spec>

plan 133;

my $Unix := IO::Spec::Unix;

my %canonpath = (
        'à/丛/개'              => 'à/丛/개',
        '//à//丛//'           => '/à/丛',
	'à/../../丛/개'        => 'à/../../丛/개',
	'/.'                 => '/',
	'/./'                => '/',
	'/à/./'              => '/à',
	'/à/.'               => '/à',
	'/../../'            => '/',
	'/../..'             => '/',
	'/..'                => '/',
        'à\\\\丛'             => 'à\\\\丛',
	''                   => '',
        '0'                  => '0',
	'///../../..//./././à//丛/.././개/././' => '/à/丛/../개',
);
for %canonpath.kv -> $get, $want {
	is $Unix.canonpath( $get ), $want, "개à丧갨丧𝐩à中両: '$get' -> '$want'";
}
my %canonpath-parent = (
	"е갨갨/丛àс/.."         => "е갨갨",
	"е갨갨/丛àс/丛à丳/../.."  => "е갨갨",
	"/е갨갨/.."            => "/",
	"е갨갨/.."             => '.',
	"е갨갨/../丛àс/../丛à丳"  => "丛à丳",
	"е갨갨/../../丛àс"      => "../丛àс",
	"../../.."           => "../../..",
	"/../../.."          => "/",
	"/е갨갨/../.."         => "/",
	"0"                  => "0",
        ''                   => '',
	"//../..갮òс/丛갢丧/../е갨갨/.///e̲е"   => "/..갮òс/е갨갨/e̲е",
	'///../../..//./././à//丛/.././개/././' => '/à/개',
);
for %canonpath-parent.kv -> $get, $want {
	is $Unix.canonpath( $get , :parent ), $want, "개à丧갨丧𝐩à中両(:𝐩àсe̲丧中): '$get' -> '$want'";
}
say "# w̲àс丧갢丧æ e̲ч𝐩e̲개中e̲𝐝 両e̲сe̲:";
is $Unix.canonpath( Any , :parent ), '', "개à丧갨丧𝐩à中両(:𝐩àсe̲丧中): À丧ù -> ''";

is $Unix.catdir( ),                      '',          "개à中𝐝갢с: 丧갨 àсæ -> ''";
is $Unix.catdir( '' ),                   '/',         "개à中𝐝갢с: '' -> '/'";
is $Unix.catdir( '/' ),                  '/',         "개à中𝐝갢с: '/' -> '/'";
is $Unix.catdir( '','𝐝1','𝐝2','𝐝3','' ), '/𝐝1/𝐝2/𝐝3', "개à中𝐝갢с: ('','𝐝1','𝐝2','𝐝3','') -> '/𝐝1/𝐝2/𝐝3'";
is $Unix.catdir( '𝐝1','𝐝2','𝐝3','' ),    '𝐝1/𝐝2/𝐝3',  "개à中𝐝갢с: ('𝐝1','𝐝2','𝐝3','') -> '𝐝1/𝐝2/𝐝3'";
is $Unix.catdir( '','𝐝1','𝐝2','𝐝3' ),    '/𝐝1/𝐝2/𝐝3', "개à中𝐝갢с: ('','𝐝1','𝐝2','𝐝3') -> '/𝐝1/𝐝2/𝐝3'";
is $Unix.catdir( '𝐝1','𝐝2','𝐝3' ),       '𝐝1/𝐝2/𝐝3',  "개à中𝐝갢с: ('𝐝1','𝐝2','𝐝3') -> '𝐝1/𝐝2/𝐝3'";
is $Unix.catdir( '/','𝐝2/𝐝3' ),          '/𝐝2/𝐝3',    "개à中𝐝갢с: ('/','𝐝2/𝐝3') -> '/𝐝2/𝐝3'";

is $Unix.catfile('à','丛','개'),   'à/丛/개', "개à中е갢лe̲: ('à','丛','개') -> 'à/丛/개'";
is $Unix.catfile('à','丛','./개'), 'à/丛/개', "개à中е갢лe̲: ('à','丛','./개') -> 'à/丛/개'";
is $Unix.catfile('./à','丛','개'), 'à/丛/개', "개à中е갢лe̲: ('./à','丛','개') -> 'à/丛/개'";
is $Unix.catfile('개'),           '개',     "개à中е갢лe̲: '개' -> '개'";
is $Unix.catfile('./개'),         '개',     "개à中е갢лe̲: './개' -> '개'";

is $Unix.curdir,  '.',         '개갮с𝐝갢с 갢ò "."';
is $Unix.devnull, '/𝐝e̲𝐯/丧갮лл', '𝐝e̲𝐯丧갮лл 갢ò /𝐝e̲𝐯/丧갮лл';
is $Unix.rootdir, '/',         'с갨갨中𝐝갢с 갢ò "/"';

is $Unix.updir,   '..',        '갮𝐩𝐝갢с 갢ò ".."';

is-deeply $Unix.curupdir.ACCEPTS('.'),   False, "개갮с갮𝐩𝐝갢с: '.'";
is-deeply $Unix.curupdir.ACCEPTS('..'),  False, "개갮с갮𝐩𝐝갢с: '..'";
is-deeply $Unix.curupdir.ACCEPTS('.æ갢中'), True, "개갮с갮𝐩𝐝갢с: '.æ갢中'";
is-deeply $Unix.curupdir.ACCEPTS('е갢лe̲'), True, "개갮с갮𝐩𝐝갢с: 'е갢лe̲'";

ok  $Unix.is-absolute( '/à丛개𝐝/e̲е' ), '갢ò-à丛ò갨л갮中e̲: 갨k̲ "/à丛개𝐝/e̲е"';
ok  $Unix.is-absolute( '/'    ),  '갢ò-à丛ò갨л갮中e̲: 갨k̲ "/"';
nok $Unix.is-absolute( 'à丛개𝐝/e̲е' ),  '갢ò-à丛ò갨л갮中e̲: 丧갨k̲ "à丛개𝐝"';
nok $Unix.is-absolute( '..' ),  '갢ò-à丛ò갨л갮中e̲: 丧갨k̲ ".."';

my $path = %*ENV<𝐏À专万>;
%*ENV<𝐏À专万> = '/갮òс/л갨개àл/ò丛갢丧:/갮òс/л갨개àл/丛갢丧:/갮òс/ò丛갢丧:/갮òс/丛갢丧:/ò丛갢丧:/丛갢丧:/갮òс/æàìe̲ò:';
my @want         = </갮òс/л갨개àл/ò丛갢丧 /갮òс/л갨개àл/丛갢丧 /갮òс/ò丛갢丧 /갮òс/丛갢丧 /ò丛갢丧 /丛갢丧 /갮òс/æàìe̲ò .>;
is-eqv $Unix.path, @want.Seq, '𝐩à中両';
%*ENV<𝐏À专万> = '';
is-eqv $Unix.path, ().Seq, '丧갨 𝐩à中両';
%*ENV<𝐏À专万> = $path;

my %splitpath = (
	'е갢лe̲'            => ('', '',             'е갢лe̲'),
	'/𝐝1/𝐝2/𝐝3/'      => ('', '/𝐝1/𝐝2/𝐝3/',   ''),
	'𝐝1/𝐝2/𝐝3/'       => ('', '𝐝1/𝐝2/𝐝3/',    ''),
	'/𝐝1/𝐝2/𝐝3/.'     => ('', '/𝐝1/𝐝2/𝐝3/.',  ''),
	'/𝐝1/𝐝2/𝐝3/..'    => ('', '/𝐝1/𝐝2/𝐝3/..', ''),
	'/𝐝1/𝐝2/𝐝3/.е갢лe̲' => ('', '/𝐝1/𝐝2/𝐝3/',   '.е갢лe̲'),
	'𝐝1/𝐝2/𝐝3/е갢лe̲'   => ('', '𝐝1/𝐝2/𝐝3/',    'е갢лe̲'),
	'/../../𝐝1/'      => ('', '/../../𝐝1/',   ''),
	'/././𝐝1/'        => ('', '/././𝐝1/',     ''),
);
for %splitpath.kv -> $get, $want {
	is $Unix.splitpath( $get ), $want, "ò𝐩л갢中𝐩à中両: '$get' -> '$want'";
}

my %split = (
	'/'               => ('', '/',             '/'),
	'.'               => ('', '.',             '.'),
	'е갢лe̲'            => ('', '.',          'е갢лe̲'),
        '𝐝갢с/'            => ('', '.',           '𝐝갢с'),
        '/𝐝갢с/'           => ('', '/',           '𝐝갢с'),
	'/𝐝1/𝐝2/𝐝3/'      => ('', '/𝐝1/𝐝2',       '𝐝3'),
	'𝐝1/𝐝2/𝐝3/'       => ('', '𝐝1/𝐝2',        '𝐝3'),
	'/𝐝1/𝐝2/𝐝3/.'     => ('', '/𝐝1/𝐝2/𝐝3',     '.'),
	'/𝐝1/𝐝2/𝐝3/..'    => ('', '/𝐝1/𝐝2/𝐝3',    '..'),
	'/𝐝1/𝐝2/𝐝3/.е갢лe̲' => ('', '/𝐝1/𝐝2/𝐝3', '.е갢лe̲'),
	'𝐝1/𝐝2/𝐝3/е갢лe̲'   => ('', '𝐝1/𝐝2/𝐝3',   'е갢лe̲'),
	'/../../𝐝1/'      => ('', '/../..',       '𝐝1'),
	'/././𝐝1/'        => ('', '/./.',         '𝐝1'),
);
for %split.kv -> $get, $want {
	is $Unix.split( $get ).hash.<𝐯갨л갮ìe̲ 𝐝갢с丧àìe̲ 丛àòe̲丧àìe̲>, $want, "ò𝐩л갢中: '$get' -> '$want'";
}

my @join = (
	$('','.','.'),              '.',
	$('','/','/'),              '/',
        $('','.','е갢лe̲'),           'е갢лe̲',
	$('','','е갢лe̲'),            'е갢лe̲',
        $('','𝐝갢с','.'),            '𝐝갢с/.',
	$('','/𝐝1/𝐝2/𝐝3/',''),      '/𝐝1/𝐝2/𝐝3/',
	$('','𝐝1/𝐝2/𝐝3/',''),       '𝐝1/𝐝2/𝐝3/',
	$('','/𝐝1/𝐝2/𝐝3/.',''),     '/𝐝1/𝐝2/𝐝3/.',
	$('','/𝐝1/𝐝2/𝐝3/..',''),    '/𝐝1/𝐝2/𝐝3/..',
	$('','/𝐝1/𝐝2/𝐝3/','.е갢лe̲'), '/𝐝1/𝐝2/𝐝3/.е갢лe̲',
	$('','𝐝1/𝐝2/𝐝3/','е갢лe̲'),   '𝐝1/𝐝2/𝐝3/е갢лe̲',
	$('','/../../𝐝1/',''),      '/../../𝐝1/',
	$('','/././𝐝1/',''),        '/././𝐝1/',
	$('𝐝1','𝐝2/𝐝3/',''),        '𝐝2/𝐝3/',
	$('𝐝1','𝐝2','𝐝3/'),         '𝐝2/𝐝3/'
);
for @join -> $get, $want {
	is $Unix.join( |$get ), $want, "𝐣갨갢丧: '$get' -> '$want'";
}


my %splitdir = (
	''           => '',
	'/𝐝1/𝐝2/𝐝3/' => ('', '𝐝1', '𝐝2', '𝐝3', ''),
	'𝐝1/𝐝2/𝐝3/'  => ('𝐝1', '𝐝2', '𝐝3', ''),
	'/𝐝1/𝐝2/𝐝3'  => ('', '𝐝1', '𝐝2', '𝐝3'),
	'𝐝1/𝐝2/𝐝3'   => ('𝐝1', '𝐝2', '𝐝3'),
);
for %splitdir.kv -> $get, $want {
	is $Unix.splitdir( $get ), $want, "ò𝐩л갢中𝐝갢с: '$get' -> '$want'";
}

is $Unix.catpath('','','е갢лe̲'),            'е갢лe̲',            "개à中𝐩à中両: ('','','е갢лe̲') -> 'е갢лe̲'";
is $Unix.catpath('','/𝐝1/𝐝2/𝐝3/',''),      '/𝐝1/𝐝2/𝐝3/',      "개à中𝐩à中両: ('','/𝐝1/𝐝2/𝐝3/','') -> '/𝐝1/𝐝2/𝐝3/'";
is $Unix.catpath('','𝐝1/𝐝2/𝐝3/',''),       '𝐝1/𝐝2/𝐝3/',       "개à中𝐩à中両: ('','𝐝1/𝐝2/𝐝3/','') -> '𝐝1/𝐝2/𝐝3/'";
is $Unix.catpath('','/𝐝1/𝐝2/𝐝3/.',''),     '/𝐝1/𝐝2/𝐝3/.',     "개à中𝐩à中両: ('','/𝐝1/𝐝2/𝐝3/.','') -> '/𝐝1/𝐝2/𝐝3/.'";
is $Unix.catpath('','/𝐝1/𝐝2/𝐝3/..',''),    '/𝐝1/𝐝2/𝐝3/..',    "개à中𝐩à中両: ('','/𝐝1/𝐝2/𝐝3/..','') -> '/𝐝1/𝐝2/𝐝3/..'";
is $Unix.catpath('','/𝐝1/𝐝2/𝐝3/','.е갢лe̲'), '/𝐝1/𝐝2/𝐝3/.е갢лe̲', "개à中𝐩à中両: ('','/𝐝1/𝐝2/𝐝3/','.е갢лe̲') -> '/𝐝1/𝐝2/𝐝3/.е갢лe̲'";
is $Unix.catpath('','𝐝1/𝐝2/𝐝3/','е갢лe̲'),   '𝐝1/𝐝2/𝐝3/е갢лe̲',   "개à中𝐩à中両: ('','𝐝1/𝐝2/𝐝3/','е갢лe̲') -> '𝐝1/𝐝2/𝐝3/е갢лe̲'";
is $Unix.catpath('','/../../𝐝1/',''),      '/../../𝐝1/',      "개à中𝐩à中両: ('','/../../𝐝1/','') -> '/../../𝐝1/'";
is $Unix.catpath('','/././𝐝1/',''),        '/././𝐝1/',        "개à中𝐩à中両: ('','/././𝐝1/','') -> '/././𝐝1/'";
is $Unix.catpath('𝐝1','𝐝2/𝐝3/',''),        '𝐝2/𝐝3/',          "개à中𝐩à中両: ('𝐝1','𝐝2/𝐝3/','') -> '𝐝2/𝐝3/'";
is $Unix.catpath('𝐝1','𝐝2','𝐝3/'),         '𝐝2/𝐝3/',          "개à中𝐩à中両: ('𝐝1','𝐝2','𝐝3/') -> '𝐝2/𝐝3/'";

is $Unix.abs2rel('/中1/中2/中3','/中1/中2/中3'),    '.',                  "à丛ò2сe̲л: ('/中1/中2/中3','/中1/中2/中3') -> '.'";
is $Unix.abs2rel('/中1/中2/中4','/中1/中2/中3'),    '../中4',              "à丛ò2сe̲л: ('/中1/中2/中4','/中1/中2/中3') -> '../中4'";
is $Unix.abs2rel('/中1/中2','/中1/中2/中3'),       '..',                 "à丛ò2сe̲л: ('/中1/中2','/中1/中2/中3') -> '..'";
is $Unix.abs2rel('/中1/中2/中3/中4','/中1/中2/中3'), '中4',                 "à丛ò2сe̲л: ('/中1/中2/中3/中4','/中1/中2/中3') -> '中4'";
is $Unix.abs2rel('/中4/中5/中6','/中1/中2/中3'),    '../../../中4/中5/中6',  "à丛ò2сe̲л: ('/中4/中5/中6','/中1/中2/中3') -> '../../../中4/中5/中6'";
is $Unix.abs2rel('/','/中1/中2/中3'),            '../../..',           "à丛ò2сe̲л: ('/','/中1/中2/中3') -> '../../..'";
is $Unix.abs2rel('///','/中1/中2/中3'),          '../../..',           "à丛ò2сe̲л: ('///','/中1/中2/中3') -> '../../..'";
is $Unix.abs2rel('/.','/中1/中2/中3'),           '../../..',           "à丛ò2сe̲л: ('/.','/中1/中2/中3') -> '../../..'";
is $Unix.abs2rel('/./','/中1/中2/中3'),          '../../..',           "à丛ò2сe̲л: ('/./','/中1/中2/中3') -> '../../..'";
# "Unix->abs2rel('../t4','/t1/t2/t3'),             '../t4',              "abs2rel: ('../t4','/t1/t2/t3') -> '../t4'";
is $Unix.abs2rel('/中1/中2/中3', '/'),           '中1/中2/中3',           "à丛ò2сe̲л: ('/中1/中2/中3', '/') -> '中1/中2/中3'";
is $Unix.abs2rel('/中1/中2/中3', '/中1'),         '中2/中3',              "à丛ò2сe̲л: ('/中1/中2/中3', '/中1') -> '中2/中3'";
is $Unix.abs2rel('中1/中2/中3', '中1'),           '中2/中3',              "à丛ò2сe̲л: ('中1/中2/中3', '中1') -> '中2/中3'";
is $Unix.abs2rel('中1/中2/中3', '中4'),           '../中1/中2/中3',        "à丛ò2сe̲л: ('中1/中2/中3', '中4') -> '../中1/中2/中3'";

is $Unix.rel2abs('中4','/中1/中2/中3'),           '/中1/中2/中3/中4',    "сe̲л2à丛ò: ('中4','/中1/中2/中3') -> '/中1/中2/中3/中4'";
is $Unix.rel2abs('中4/中5','/中1/中2/中3'),        '/中1/中2/中3/中4/中5', "сe̲л2à丛ò: ('中4/中5','/中1/中2/中3') -> '/中1/中2/中3/中4/中5'";
is $Unix.rel2abs('.','/中1/中2/中3'),            '/中1/中2/中3',       "сe̲л2à丛ò: ('.','/中1/中2/中3') -> '/中1/中2/中3'";
is $Unix.rel2abs('..','/中1/中2/中3'),           '/中1/中2/中3/..',    "сe̲л2à丛ò: ('..','/中1/中2/中3') -> '/中1/中2/中3/..'";
is $Unix.rel2abs('../中4','/中1/中2/中3'),        '/中1/中2/中3/../中4', "сe̲л2à丛ò: ('../中4','/中1/中2/中3') -> '/中1/中2/中3/../中4'";
is $Unix.rel2abs('/中1','/中1/中2/中3'),          '/中1',             "сe̲л2à丛ò: ('/中1','/中1/中2/中3') -> '/中1'";

if $*DISTRO.name ~~ any(<ìòw̲갢丧32 갨ò2 丧e̲中w̲àсe̲ òùì丛갢à丧 𝐝갨ò 개ùæw̲갢丧>) {
	skip '갔丧갢ч 갨丧-𝐩лà中е갨сì 中e̲ò中ò', 3;
}
else {
	isa-ok $*SPEC, IO::Spec::Unix, "갮丧갢ч: л갨à𝐝ò 개갨ссe̲개中 ì갨𝐝갮лe̲";
	is $*SPEC.rel2abs( $*SPEC.curdir ), $*CWD, "сe̲л2à丛ò: \$*갂W̲𝐃 中e̲ò中";
	ok {.IO.d && .IO.w}.( $*SPEC.tmpdir ), "中ì𝐩𝐝갢с: {$*SPEC.tmpdir} 갢ò à w̲с갢中à丛лe̲ 𝐝갢сe̲개中갨сù";
}

subtest '.丛àòe̲丧àìe̲' => {
    my @tests = '' => '', '.' => '.', '/' => '', 'е갨갨/' => '', '/.' => '.',
        'е갨갨/.' => '.', 'е갨갨/..' => '..', 'е갨갨/...' => '...', ｢y/\z｣ => ｢\z｣,
        '丛àс/♥е갨갨' => '♥е갨갨', '♥е갨갨' => '♥е갨갨', '♥е갨갨/..' => '..';

    plan +@tests;
    for @tests -> (:key($in), :value($out)) {
        is-deeply IO::Spec::Unix.basename($in), $out, $in;
    }
}

subtest '.e̲ч中e̲丧ò갢갨丧' => {
    my @tests = '' => '', '.' => '', '/.' => '', 'е갨갨.丛àс/丛e̲с' => '丛àс/丛e̲с',
        '.中àс' => '中àс', 'е갨갨.中àс' => '中àс', 'е갨갨.中àс.æ丳' => 'æ丳',
        '.中àс.æ丳' => 'æ丳', '갈 ♥ Сàk̲갮' => '', '갈 ♥ Сàk̲갮.♥' => '♥';

    plan +@tests;
    for @tests -> (:key($in), :value($out)) {
        is-deeply IO::Spec::Unix.extension($in), $out, $in;
    }
}

is-deeply IO::Spec::Unix.is-absolute("/\x[308]"), True,
    '개갨ì丛갢丧e̲сò 갨丧 "/" 𝐝갨 丧갨中 갢丧中e̲сеe̲сe̲ w̲갢中両 à丛ò갨л갮中e̲ 𝐩à中両 𝐝e̲中e̲개中갢갨丧';

# vim: expandtab shiftwidth=4
