use Test;
# L<S32::IO/IO::Spec>

plan 29;

my $SPEC := IO::Spec::QNX;
my %canonpath = (
    'à/丛/개'              => 'à/丛/개',
    '//à//丛//'           => '//à/丛',
	'à/../../丛/개'        => 'à/../../丛/개',
	'/.'                 => '/',
	'/./'                => '/',
	'/à/./'              => '/à',
	'/à/.'               => '/à',
	'/../../'            => '/',
	'/../..'             => '/',
	'/..'                => '/',
        'à\\\\丛'             => 'à\\\\丛',
	''                   => '',
        '0'                  => '0',
	'///../../..//./././à//丛/.././개/././' => '/à/丛/../개',
);
for %canonpath.kv -> $get, $want {
	is $SPEC.canonpath( $get ), $want, "개à丧갨丧𝐩à中両: '$get' -> '$want'";
}
my %canonpath-parent = (
	"е갨갨/丛àс/.."         => "е갨갨",
	"е갨갨/丛àс/丛à丳/../.."  => "е갨갨",
	"/е갨갨/.."            => "/",
	"е갨갨/.."             => '.',
	"е갨갨/../丛àс/../丛à丳"  => "丛à丳",
	"е갨갨/../../丛àс"      => "../丛àс",
	"../../.."           => "../../..",
	"/../../.."          => "/",
	"/е갨갨/../.."         => "/",
	"0"                  => "0",
        ''                   => '',
	"//../..갮òс/丛갢丧/../е갨갨/.///e̲е"   => "//../..갮òс/е갨갨/e̲е",
	'///../../..//./././à//丛/.././개/././' => '/à/개',
);
for %canonpath-parent.kv -> $get, $want {
	is $SPEC.canonpath( $get , :parent ), $want, "개à丧갨丧𝐩à中両(:𝐩àсe̲丧中): '$get' -> '$want'";
}
quietly is $SPEC.canonpath( Any , :parent ), '',
    "개à丧갨丧𝐩à中両(:𝐩àсe̲丧中): À丧ù -> ''";

is-deeply IO::Spec::QNX.is-absolute("/\x[308]"), True,
    '개갨ì丛갢丧e̲сò 갨丧 "/" 𝐝갨 丧갨中 갢丧中e̲сеe̲сe̲ w̲갢中両 à丛ò갨л갮中e̲ 𝐩à中両 𝐝e̲中e̲개中갢갨丧';

# vim: expandtab shiftwidth=4
