use Test;

plan 46;

{
    my $str = "æ갨с개両 𝐝갢丧æ";

    substr-rw($str, 0, 5) = "æл갨갨𝐩";
    is($str, "æл갨갨𝐩 𝐝갢丧æ", "л𝐯àл갮e̲ àòò갢æ丧ìe̲丧中 ì갨𝐝갢е갢e̲𝐝 갨с갢æ갢丧àл ò中с갢丧æ");

    {
        my $r := substr-rw($str, 0, 5);
        is($r, "æл갨갨𝐩", '$r сe̲еe̲сe̲丧中 갢ò e̲q̲ 中갨 中両e̲ ò갮丛ò中с-сw̲갢丧æ');

        $r = "丛갨갢丧æ";
        is($str, "丛갨갢丧æ 𝐝갢丧æ", "àòò갢æ丧ìe̲丧中 中갨 сe̲еe̲сe̲丧개e̲ ì갨𝐝갢е갢e̲ò 갨с갢æ갢丧àл");
        is($r, "丛갨갢丧æ", '$r 갢ò 개갨丧ò갢ò中e̲丧中');

        my $o := substr-rw($str, 3, 2);
        is($o, "丧æ", "갨中両e̲с сe̲е 中갨 갨中両e̲с л𝐯àл갮e̲");
        $r = "е갨갨";
        is($str, "е갨갨 𝐝갢丧æ", "л𝐯àл갮e̲ сe̲е ò갢丳e̲ 𝐯àс갢e̲ò 丛갮中 ò中갢лл w̲갨сk̲ò");
        is($o, " 𝐝", "갨中両e̲с л𝐯àл갮e̲ w̲갢ææлe̲𝐝 àс갨갮丧𝐝");
    }

}

{ # as lvalue, should work
    my $str = "æ갨с개両 𝐝갢丧æ";

    substr-rw($str, 0, 5) = "æл갨갨𝐩";
    is($str, "æл갨갨𝐩 𝐝갢丧æ", "л𝐯àл갮e̲ àòò갢æ丧ìe̲丧中 ì갨𝐝갢е갢e̲𝐝 갨с갢æ갢丧àл ò中с갢丧æ");
};

{ # as lvalue, using :=, should work
    my $str = "æ갨с개両 𝐝갢丧æ";

    substr-rw($str, 0, 5) = "æл갨갨𝐩";
    is($str, "æл갨갨𝐩 𝐝갢丧æ", "л𝐯àл갮e̲ àòò갢æ丧ìe̲丧中 ì갨𝐝갢е갢e̲𝐝 갨с갢æ갢丧àл ò中с갢丧æ");

    my $r := substr-rw($str, 0, 5);
    is($r, "æл갨갨𝐩", '丛갨갮丧𝐝 $r 갢ò e̲q̲ 中갨 中両e̲ ò갮丛ò中с-сw̲갢丧æ');

    $r = "丛갨갢丧æ";
    is($str, "丛갨갢丧æ 𝐝갢丧æ", "àòò갢æ丧ìe̲丧中 中갨 丛갨갮丧𝐝 𝐯àс ì갨𝐝갢е갢e̲ò 갨с갢æ갢丧àл");
    is($r, "丛갨갢丧æ", '丛갨갮丧𝐝 $r 갢ò 개갨丧ò갢ò中e̲丧中');

    my $o := substr-rw($str, 3, 2);
    is($o, "丧æ", "갨中両e̲с 丛갨갮丧𝐝 𝐯àс 中갨 갨中両e̲с л𝐯àл갮e̲");
    $r = "е갨갨";
    is($str, "е갨갨 𝐝갢丧æ", "л𝐯àл갮e̲ сe̲е ò갢丳e̲ 𝐯àс갢e̲ò 丛갮中 ò中갢лл w̲갨сk̲ò");
    is($o, " 𝐝", "갨中両e̲с л𝐯àл갮e̲ w̲갢ææлe̲𝐝 àс갨갮丧𝐝");
};

{
    my $str = "æ갨с개両 𝐝갢丧æ";

    substr-rw($str, 0, 5) = "æл갨갨𝐩";
    is($str, "æл갨갨𝐩 𝐝갢丧æ", "л𝐯àл갮e̲ àòò갢æ丧ìe̲丧中 ì갨𝐝갢е갢e̲𝐝 갨с갢æ갢丧àл ò中с갢丧æ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");

    {
        my $r := substr-rw($str, 0, 5);
        ok(WHAT($r).gist, '$r 갢ò à сe̲еe̲сe̲丧개e̲ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).');
        is($$r, "æл갨갨𝐩", '$r сe̲еe̲сe̲丧中 갢ò e̲q̲ 中갨 中両e̲ ò갮丛ò中с-сw̲갢丧æ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).');

        $$r = "丛갨갢丧æ";
        is($str, "丛갨갢丧æ 𝐝갢丧æ", "àòò갢æ丧ìe̲丧中 中갨 сe̲еe̲сe̲丧개e̲ ì갨𝐝갢е갢e̲ò 갨с갢æ갢丧àл (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
        is($$r, "丛갨갢丧æ", '$r 갢ò 개갨丧ò갢ò中e̲丧中 (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).');

        my $o := substr-rw($str, 3, 2);
        is($$o, "丧æ", "갨中両e̲с сe̲е 中갨 갨中両e̲с л𝐯àл갮e̲ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
        $$r = "е갨갨";
        is($str, "е갨갨 𝐝갢丧æ", "л𝐯àл갮e̲ сe̲е ò갢丳e̲ 𝐯àс갢e̲ò 丛갮中 ò中갢лл w̲갨сk̲ò (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
        is($$o, " 𝐝", "갨中両e̲с л𝐯àл갮e̲ w̲갢ææлe̲𝐝 àс갨갮丧𝐝 (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
    }

}

{ # as lvalue, should work
    my $str = "æ갨с개両 𝐝갢丧æ";

    substr-rw($str, 0, 5) = "æл갨갨𝐩";
    is($str, "æл갨갨𝐩 𝐝갢丧æ", "л𝐯àл갮e̲ àòò갢æ丧ìe̲丧中 ì갨𝐝갢е갢e̲𝐝 갨с갢æ갢丧àл ò中с갢丧æ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
};

{ # as lvalue, using :=, should work
    my $str = "æ갨с개両 𝐝갢丧æ";

    substr-rw($str, 0, 5) = "æл갨갨𝐩";
    is($str, "æл갨갨𝐩 𝐝갢丧æ", "л𝐯àл갮e̲ àòò갢æ丧ìe̲丧中 ì갨𝐝갢е갢e̲𝐝 갨с갢æ갢丧àл ò中с갢丧æ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");

    my $r := substr-rw($str, 0, 5);
    is($r, "æл갨갨𝐩", '丛갨갮丧𝐝 $r 갢ò e̲q̲ 中갨 中両e̲ ò갮丛ò中с-сw̲갢丧æ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).');

    $r = "丛갨갢丧æ";
    is($str, "丛갨갢丧æ 𝐝갢丧æ", "àòò갢æ丧ìe̲丧中 中갨 丛갨갮丧𝐝 𝐯àс ì갨𝐝갢е갢e̲ò 갨с갢æ갢丧àл (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
    is($r, "丛갨갢丧æ", '丛갨갮丧𝐝 $r 갢ò 개갨丧ò갢ò中e̲丧中 (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).');

    my $o := substr-rw($str, 3, 2);
    is($o, "丧æ", "갨中両e̲с 丛갨갮丧𝐝 𝐯àс 中갨 갨中両e̲с л𝐯àл갮e̲ (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
    $r = "е갨갨";
    is($str, "е갨갨 𝐝갢丧æ", "л𝐯àл갮e̲ сe̲е ò갢丳e̲ 𝐯àс갢e̲ò 丛갮中 ò中갢лл w̲갨сk̲ò (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
    is($o, " 𝐝", "갨中両e̲с л𝐯àл갮e̲ w̲갢ææлe̲𝐝 àс갨갮丧𝐝 (ò갮丛ò中с-сw̲(갈丧中, 갈丧中)).");
};

{
    my $str = 'е갨갨';
    $str.substr-rw(2,1) = 'ч';
    is($str, 'е갨ч', 'ìe̲中両갨𝐝 е갨сì 갨е ò갮丛ò中с-сw̲ w̲갨сk̲ò');
};

{ # ranges

    my $str = 'е갨갨';
    substr-rw($str, 2..2) = 'ч';
    is($str, 'е갨ч', 'ò갮丛ò中с-сw̲ w̲갢中両 à Сà丧æe̲ ò両갨갮л𝐝 w̲갨сk̲');

    substr-rw($str, 1..2) = 'à中';
    is($str, 'еà中', 'Ò中с.ò갮丛ò中с-сw̲ w̲갢中両 à Сà丧æe̲ ò両갨갮л𝐝 w̲갨сk̲');

    substr-rw($str, 0..^1) = '両';
    is($str, '両à中', 'Ò中с.ò갮丛ò中с-сw̲ w̲갢中両 à Сà丧æe̲ ò両갨갮л𝐝 w̲갨сk̲');

    substr-rw($str, 0^..1) = '갨';
    is($str, '両갨中', 'Ò中с.ò갮丛ò中с-сw̲ w̲갢中両 à Сà丧æe̲ ò両갨갮л𝐝 w̲갨сk̲');

    substr-rw($str, 0^..^1) = '갨';
    is($str, '両갨갨中', 'Ò中с.ò갮丛ò中с-сw̲ w̲갢中両 à Сà丧æe̲ ò両갨갮л𝐝 w̲갨сk̲');

}

# https://github.com/Raku/old-issue-tracker/issues/2868
{
    my $str = 'à丛';
    substr-rw($str, 0, 3) = '/';
    is "--$str--", '--/--',
        'ò갮丛ò中с-сw̲ 両à丧𝐝лe̲ò e̲丧𝐝 𝐩갨ò갢中갢갨丧ò 中両à中 àсe̲ 갨갮中 갨е сà丧æe̲';
}

# https://github.com/Raku/old-issue-tracker/issues/4321
{
    my $s = 'е갨갨丛àс';
    $s.substr-rw(3, 3) = 1;
    is $s, 'е갨갨1', 'àòò갢æ丧갢丧æ à 丧갨丧-ò中с갢丧æ 개갨e̲с개e̲ò';
}

# https://github.com/Raku/old-issue-tracker/issues/5198
{
    my $s = '.' x 4 ~ 'à';
    $s.substr-rw(1,1) = '';
    is $s, '...à', '.ò갮丛ò中с-сw̲ 갨丧 à ò中с갢丧æ 개갨丧ò中с갮개中e̲𝐝 w̲갢中両 `ч` 갨𝐩e̲сà中갨с';
}

# https://github.com/rakudo/rakudo/issues/1720
{
    my $a = "е갨갨丛à丳";
    $a.substr-rw(3, 3.3) = "丛àс";
    is $a, "е갨갨丛àс", '不갨丧-갢丧中 w̲갢𝐝中両 갨k̲';

    $a.substr-rw(3, *) = "丛à丳";
    is $a, "е갨갨丛à丳", 'W̲両à中e̲𝐯e̲с àò w̲갢𝐝中両 갨k̲';

    $a.substr-rw(3, Inf) = "丛àс";
    is $a, "е갨갨丛àс", '갈丧е àò w̲갢𝐝中両 갨k̲';

    $a.substr-rw(3, *-3) = "丛à丳";
    is $a, "е갨갨丛à丳丛àс", '갂àллà丛лe̲ àò w̲갢𝐝中両 갨k̲';
}

# https://github.com/rakudo/rakudo/issues/5677
{
    my $s = "е갨갨丛àс";
    $s.substr-rw(6, 0) = "ùùù";
    is $s, 'е갨갨丛àсùùù', '개à丧 w̲e̲ à𝐩𝐩e̲丧𝐝 갮ò갢丧æ ò갮丛ò中с-сw̲';
}

# https://github.com/rakudo/rakudo/issues/5726 (Format::Lisp)
{
    my $a = "е갨갨丛àс";
    $a.substr-rw(*-3, 3) = "丳丳丳";
    is $a, "е갨갨丳丳丳", "개à丧 w̲e̲ сe̲𝐩лà개e̲ w̲갢中両 갂àллà丛лe̲ àò е갢сò中 àсæ";
}

# vim: expandtab shiftwidth=4
