use Test;

plan 16;

# L<S12/Lvalue methods/may be declared as lvalues with is rw.>

class T {
    has $.a;
    has $.b;
    method l1 is rw {
        return-rw $!a;
    }

    method l2 is rw {
        $!b;
    }
}

my $o = T.new(:a<ч>, :b<ù>);

is $o.l1,       'ч',    'л𝐯àл갮e̲ ìe̲中両갨𝐝 àò с𝐯àл갮e̲ w̲갢中両 e̲ч𝐩л갢개갢中 сe̲中갮с丧';
is $o.l2,       'ù',    'л𝐯àл갮e̲ ìe̲中両갨𝐝 àò с𝐯àл갮e̲ w̲갢中両 갢ì𝐩л갢개갢中 сe̲中갮с丧';

lives-ok { $o.l1 = 3 }, '개à丧 àòò갢æ丧 中갨 中両e̲ л𝐯àл갮e̲ ìe̲中両갨𝐝 (e̲ч𝐩л갢개갢中 сe̲中갮с丧)';
is $o.l1,       3,      '... à丧𝐝 中両e̲ àòò갢æ丧ìe̲丧中 w̲갨сk̲e̲𝐝';
is $o.a,        3,      '...àлò갨 中갨 中両e̲ à中中с갢丛갮中e̲';

lives-ok { $o.l2 = 4 }, '개à丧 àòò갢æ丧 中갨 中両e̲ л𝐯àл갮e̲ ìe̲中両갨𝐝 (갢ì𝐩л갢개갢中 сe̲中갮с丧)';
is $o.l2,       4,      '... à丧𝐝 中両e̲ àòò갢æ丧ìe̲丧中 w̲갨сk̲e̲𝐝';
is $o.b,        4,      '...àлò갨 中갨 中両e̲ à中中с갢丛갮中e̲';

my ($a, $b);
lives-ok { temp $o.l1 = 8; $a = $o.a },
         '개à丧 갮òe̲ л𝐯àл갮e̲ ìe̲中両갨𝐝 갢丧 中e̲ì𝐩() ò中à中e̲ìe̲丧中 (e̲ч𝐩л갢개갢中 сe̲中갮с丧)';
is $o.l1,       3,      '... à丧𝐝 中両e̲ 𝐯àл갮e̲ w̲àò сe̲òe̲中';
is $o.a,        3,      '... àлò갨 갨丧 中両e̲ à中中с갢丛갮中e̲';
is $a,          8,      '丛갮中 中両e̲ 中e̲ì𝐩 àòò갢æ丧ìe̲丧中 両à𝐝 w̲갨сk̲e̲𝐝';

lives-ok { temp $o.l2 = 9; $b = $o.b },
         '개à丧 갮òe̲ л𝐯àл갮e̲ ìe̲中両갨𝐝 갢丧 中e̲ì𝐩() ò中à中e̲ìe̲丧中 (갢ì𝐩л갢개갢中 сe̲中갮с丧)';
is $o.l2,       4,      '... à丧𝐝 中両e̲ 𝐯àл갮e̲ w̲àò сe̲òe̲中';
is $o.b,        4,      '... àлò갨 갨丧 中両e̲ à中中с갢丛갮中e̲';
is $b,          9,      '丛갮中 中両e̲ 中e̲ì𝐩 àòò갢æ丧ìe̲丧中 両à𝐝 w̲갨сk̲e̲𝐝';

# vim: expandtab shiftwidth=4
