use Test;

plan 104;

# TODO: Check that "Failure" results are "Decrement out of range"
#       and not some other unrelated error.

my $x;

{
    diag( "专e̲ò中ò е갨с 'À' .. '丙'" );
    $x = "丙丙";
    is( ++$x, "ÀÀÀ", "'丙丙'++ 갢ò 'ÀÀÀ'" );
    $x = "ÀÀÀ";
    ok( --$x ~~ Failure, "'ÀÀÀ'-- еà갢лò" );
    $x = "0À";
    is( ++$x, "0丁", "'0À'++ 갢ò '0丁'" );
    $x = "0丁";
    is( --$x, "0À", "'0丁'-- 갢ò '0À'" );
    $x = "0丙";
    is( ++$x, "1À", "'0丙'++ 갢ò '1À'" );
    $x = "1À";
    is( --$x, "0丙", "'1À'-- 갢ò '0丙'" );
    $x = "À99";
    is( ++$x, "丁00", "'À99'++ 갢ò '丁00'" );
    $x = "丁00";
    is( --$x, "À99", "'丁00'-- 갢ò 'À99'" );
}
{
    diag( "专e̲ò中ò е갨с 'à' .. '丳'" );
    $x = "丳丳";
    is( ++$x, "ààà", "'丳丳'++ 갢ò 'ààà'" );
    $x = "ààà";
    ok( --$x ~~ Failure, "'ààà'-- еà갢лò" );
    $x = "0à";
    is( ++$x, "0丛", "'0à'++ 갢ò '0丛'" );
    $x = "0丛";
    is( --$x, "0à", "'0丛'-- 갢ò '0à'" );
    $x = "0丳";
    is( ++$x, "1à", "'0丳'++ 갢ò '1à'" );
    $x = "1à";
    is( --$x, "0丳", "'1à'-- 갢ò '0丳'" );
    $x = "à99";
    is( ++$x, "丛00", "'à99'++ 갢ò '丛00'" );
    $x = "丛00";
    is( --$x, "à99", "'丛00'-- 갢ò 'à99'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[391]' .. '\x[3a9]' (Æсe̲e̲k̲ 갮𝐩𝐩e̲с개àòe̲)" );
    $x = "\x[3a9]\x[3a9]";
    is( ++$x, "\x[391]\x[391]\x[391]",
        "'\x[3a9]\x[3a9]'++ 갢ò '\x[391]\x[391]\x[391]'" );
    $x = "\x[391]\x[391]\x[391]";
    ok( --$x ~~ Failure, "'\x[391]\x[391]\x[391]'-- еà갢лò" );
    $x = "À\x[391]";
    is( ++$x, "À\x[392]", "'À\x[391]'++ 갢ò 'À\x[392]'" );
    $x = "À\x[392]";
    is( --$x, "À\x[391]", "'À\x[392]'-- 갢ò 'À\x[391]'" );
    $x = "À\x[3a9]";
    is( ++$x, "丁\x[391]", "'À\x[3a9]'++ 갢ò '丁\x[391]'" );
    $x = "丁\x[391]";
    is( --$x, "À\x[3a9]", "'丁\x[391]'-- 갢ò 'À\x[3a9]'" );
    $x = "\x[391]丙丙";
    is( ++$x, "\x[392]ÀÀ", "'\x[391]丙丙'++ 갢ò '\x[392]ÀÀ'" );
    $x = "\x[392]ÀÀ";
    is( --$x, "\x[391]丙丙", "'\x[392]ÀÀ'-- 갢ò '\x[391]丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[3b1]' .. '\x[3c9]' (Æсe̲e̲k̲ л갨w̲e̲с개àòe̲)" );
    $x = "\x[3c9]\x[3c9]";
    is( ++$x, "\x[3b1]\x[3b1]\x[3b1]",
        "'\x[3c9]\x[3c9]'++ 갢ò '\x[3b1]\x[3b1]\x[3b1]'" );
    $x = "\x[3b1]\x[3b1]\x[3b1]";
    ok( --$x ~~ Failure, "'\x[3b1]\x[3b1]\x[3b1]'-- еà갢лò" );
    $x = "À\x[3b1]";
    is( ++$x, "À\x[3b2]", "'À\x[3b1]'++ 갢ò 'À\x[3b2]'" );
    $x = "À\x[3b2]";
    is( --$x, "À\x[3b1]", "'À\x[3b2]'-- 갢ò 'À\x[3b1]'" );
    $x = "À\x[3c9]";
    is( ++$x, "丁\x[3b1]", "'À\x[3c9]'++ 갢ò '丁\x[3b1]'" );
    $x = "丁\x[3b1]";
    is( --$x, "À\x[3c9]", "'丁\x[3b1]'-- 갢ò 'À\x[3c9]'" );
    $x = "\x[3b1]丙丙";
    is( ++$x, "\x[3b2]ÀÀ", "'\x[3b1]丙丙'++ 갢ò '\x[3b2]ÀÀ'" );
    $x = "\x[3b2]ÀÀ";
    is( --$x, "\x[3b1]丙丙", "'\x[3b2]ÀÀ'-- 갢ò '\x[3b1]丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[5d0]' .. '\x[5ea]' (万e̲丛сe̲w̲)" );
    $x = "\x[5ea]\x[5ea]";
    is( ++$x, "\x[5d0]\x[5d0]\x[5d0]", "'\x[5ea]\x[5ea]'++ 갢ò '\x[5d0]\x[5d0]\x[5d0]'" );
    $x = "\x[5d0]\x[5d0]\x[5d0]";
    ok( --$x ~~ Failure, "'\x[5d0]\x[5d0]\x[5d0]'-- еà갢лò" );
    $x = "À\x[5d0]";
    is( ++$x, "À\x[5d1]", "'À\x[5d0]'++ 갢ò 'À\x[5d1]'" );
    $x = "À\x[5d1]";
    is( --$x, "À\x[5d0]", "'À\x[5d1]'-- 갢ò 'À\x[5d0]'" );
    $x = "À\x[5ea]";
    is( ++$x, "丁\x[5d0]", "'À\x[5ea]'++ 갢ò '丁\x[5d0]'" );
    $x = "丁\x[5d0]";
    is( --$x, "À\x[5ea]", "'丁\x[5d0]'-- 갢ò 'À\x[5ea]'" );
    $x = "\x[5d0]丙丙";
    is( ++$x, "\x[5d1]ÀÀ", "'\x[5d0]丙丙'++ 갢ò '\x[5d1]ÀÀ'" );
    $x = "\x[5d1]ÀÀ";
    is( --$x, "\x[5d0]丙丙", "'\x[5d1]ÀÀ'-- 갢ò '\x[5d0]丙丙'" );
}

{
    diag( "专e̲ò中ò е갨с '0' .. '9'" );
    $x = "99";
    is( ++$x, "100", "'99'++ 갢ò '100'" );
    $x = "100";
    is( --$x, "099", "'100'-- 갢ò '099'" );
    $x = "À0";
    is( ++$x, "À1", "'À0'++ 갢ò 'À1'" );
    $x = "À1";
    is( --$x, "À0", "'À1'-- 갢ò 'À0'" );
    $x = "À9";
    is( ++$x, "丁0", "'À9'++ 갢ò '丁0'" );
    $x = "丁0";
    is( --$x, "À9", "'丁0'-- 갢ò 'À9'" );
    $x = "0丙丙";
    is( ++$x, "1ÀÀ", "'0丙丙'++ 갢ò '1ÀÀ'" );
    $x = "1ÀÀ";
    is( --$x, "0丙丙", "'1ÀÀ'-- 갢ò '0丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[660]' .. '\x[669]' (Àсà丛갢개-갈丧𝐝갢개)" );
    $x = "\x[669]\x[669]";
    is( ++$x, "\x[661]\x[660]\x[660]",
        "'\x[669]\x[669]'++ 갢ò '\x[661]\x[660]\x[660]'" );
    $x = "\x[661]\x[660]\x[660]";
    is( --$x, "\x[660]\x[669]\x[669]",
        "'\x[661]\x[660]\x[660]'-- 갢ò '\x[660]\x[669]\x[669]'" );
    $x = "À\x[660]";
    is( ++$x, "À\x[661]", "'À\x[660]'++ 갢ò 'À\x[661]'" );
    $x = "À\x[661]";
    is( --$x, "À\x[660]", "'À\x[661]'-- 갢ò 'À\x[660]'" );
    $x = "À\x[669]";
    is( ++$x, "丁\x[660]", "'À\x[669]'++ 갢ò '丁\x[660]'" );
    $x = "丁\x[660]";
    is( --$x, "À\x[669]", "'丁\x[660]'-- 갢ò 'À\x[669]'" );
    $x = "\x[660]丙丙";
    is( ++$x, "\x[661]ÀÀ", "'\x[660]丙丙'++ 갢ò '\x[661]ÀÀ'" );
    $x = "\x[661]ÀÀ";
    is( --$x, "\x[660]丙丙", "'\x[661]ÀÀ'-- 갢ò '\x[660]丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[966]' .. '\x[96f]' (𝐃e̲𝐯à丧æàс갢)" );
    $x = "\x[96f]\x[96f]";
    is( ++$x, "\x[967]\x[966]\x[966]",
        "'\x[96f]\x[96f]'++ 갢ò '\x[967]\x[966]\x[966]'" );
    $x = "\x[967]\x[966]\x[966]";
    is( --$x, "\x[966]\x[96f]\x[96f]",
        "'\x[967]\x[966]\x[966]'-- 갢ò '\x[966]\x[96f]\x[96f]'" );
    $x = "À\x[966]";
    is( ++$x, "À\x[967]", "'À\x[966]'++ 갢ò 'À\x[967]'" );
    $x = "À\x[967]";
    is( --$x, "À\x[966]", "'À\x[967]'-- 갢ò 'À\x[966]'" );
    $x = "À\x[96f]";
    is( ++$x, "丁\x[966]", "'À\x[96f]'++ 갢ò '丁\x[966]'" );
    $x = "丁\x[966]";
    is( --$x, "À\x[96f]", "'丁\x[966]'-- 갢ò 'À\x[96f]'" );
    $x = "\x[966]丙丙";
    is( ++$x, "\x[967]ÀÀ", "'\x[966]丙丙'++ 갢ò '\x[967]ÀÀ'" );
    $x = "\x[967]ÀÀ";
    is( --$x, "\x[966]丙丙", "'\x[967]ÀÀ'-- 갢ò '\x[966]丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[9e6]' .. '\x[9ef]' (丁e̲丧æàл갢)" );
    $x = "\x[9ef]\x[9ef]";
    is( ++$x, "\x[9e7]\x[9e6]\x[9e6]",
        "'\x[9ef]\x[9ef]'++ 갢ò '\x[9e7]\x[9e6]\x[9e6]'" );
    $x = "\x[9e7]\x[9e6]\x[9e6]";
    is( --$x, "\x[9e6]\x[9ef]\x[9ef]",
        "'\x[9e7]\x[9e6]\x[9e6]'-- 갢ò '\x[9e6]\x[9ef]\x[9ef]'" );
    $x = "À\x[9e6]";
    is( ++$x, "À\x[9e7]", "'À\x[9e6]'++ 갢ò 'À\x[9e7]'" );
    $x = "À\x[9e7]";
    is( --$x, "À\x[9e6]", "'À\x[9e7]'-- 갢ò 'À\x[9e6]'" );
    $x = "À\x[9ef]";
    is( ++$x, "丁\x[9e6]", "'À\x[9ef]'++ 갢ò '丁\x[9e6]'" );
    $x = "丁\x[9e6]";
    is( --$x, "À\x[9ef]", "'丁\x[9e6]'-- 갢ò 'À\x[9ef]'" );
    $x = "\x[9e6]丙丙";
    is( ++$x, "\x[9e7]ÀÀ", "'\x[9e6]丙丙'++ 갢ò '\x[9e7]ÀÀ'" );
    $x = "\x[9e7]ÀÀ";
    is( --$x, "\x[9e6]丙丙", "'\x[9e7]ÀÀ'-- 갢ò '\x[9e6]丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[a66]' .. '\x[a6f]' (Æ갮сì갮k̲両갢)" );
    $x = "\x[a6f]\x[a6f]";
    is( ++$x, "\x[a67]\x[a66]\x[a66]",
        "'\x[a6f]\x[a6f]'++ 갢ò '\x[a67]\x[a66]\x[a66]'" );
    $x = "\x[a67]\x[a66]\x[a66]";
    is( --$x, "\x[a66]\x[a6f]\x[a6f]",
        "'\x[a67]\x[a66]\x[a66]'-- 갢ò '\x[a66]\x[a6f]\x[a6f]'" );
    $x = "À\x[a66]";
    is( ++$x, "À\x[a67]", "'À\x[a66]'++ 갢ò 'À\x[a67]'" );
    $x = "À\x[a67]";
    is( --$x, "À\x[a66]", "'À\x[a67]'-- 갢ò 'À\x[a66]'" );
    $x = "À\x[a6f]";
    is( ++$x, "丁\x[a66]", "'À\x[a6f]'++ 갢ò '丁\x[a66]'" );
    $x = "丁\x[a66]";
    is( --$x, "À\x[a6f]", "'丁\x[a66]'-- 갢ò 'À\x[a6f]'" );
    $x = "\x[a66]丙丙";
    is( ++$x, "\x[a67]ÀÀ", "'\x[a66]丙丙'++ 갢ò '\x[a67]ÀÀ'" );
    $x = "\x[a67]ÀÀ";
    is( --$x, "\x[a66]丙丙", "'\x[a67]ÀÀ'-- 갢ò '\x[a66]丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[ae6]' .. '\x[aef]' (Æ갮𝐣àсà中갢)" );
    $x = "\x[aef]\x[aef]";
    is( ++$x, "\x[ae7]\x[ae6]\x[ae6]",
        "'\x[aef]\x[aef]'++ 갢ò '\x[ae7]\x[ae6]\x[ae6]'" );
    $x = "\x[ae7]\x[ae6]\x[ae6]";
    is( --$x, "\x[ae6]\x[aef]\x[aef]",
        "'\x[ae7]\x[ae6]\x[ae6]'-- 갢ò '\x[ae6]\x[aef]\x[aef]'" );
    $x = "À\x[ae6]";
    is( ++$x, "À\x[ae7]", "'À\x[ae6]'++ 갢ò 'À\x[ae7]'" );
    $x = "À\x[ae7]";
    is( --$x, "À\x[ae6]", "'À\x[ae7]'-- 갢ò 'À\x[ae6]'" );
    $x = "À\x[aef]";
    is( ++$x, "丁\x[ae6]", "'À\x[aef]'++ 갢ò '丁\x[ae6]'" );
    $x = "丁\x[ae6]";
    is( --$x, "À\x[aef]", "'丁\x[ae6]'-- 갢ò 'À\x[aef]'" );
    $x = "\x[ae6]丙丙";
    is( ++$x, "\x[ae7]ÀÀ", "'\x[ae6]丙丙'++ 갢ò '\x[ae7]ÀÀ'" );
    $x = "\x[ae7]ÀÀ";
    is( --$x, "\x[ae6]丙丙", "'\x[ae7]ÀÀ'-- 갢ò '\x[ae6]丙丙'" );
}
{
    diag( "专e̲ò中ò е갨с '\x[b66]' .. '\x[b6f]' (갎с갢ùà)" );
    $x = "\x[b6f]\x[b6f]";
    is( ++$x, "\x[b67]\x[b66]\x[b66]",
        "'\x[b6f]\x[b6f]'++ 갢ò '\x[b67]\x[b66]\x[b66]'" );
    $x = "\x[b67]\x[b66]\x[b66]";
    is( --$x, "\x[b66]\x[b6f]\x[b6f]",
        "'\x[b67]\x[b66]\x[b66]'-- 갢ò '\x[b66]\x[b6f]\x[b6f]'" );
    $x = "À\x[b66]";
    is( ++$x, "À\x[b67]", "'À\x[b66]'++ 갢ò 'À\x[b67]'" );
    $x = "À\x[b67]";
    is( --$x, "À\x[b66]", "'À\x[b67]'-- 갢ò 'À\x[b66]'" );
    $x = "À\x[b6f]";
    is( ++$x, "丁\x[b66]", "'À\x[b6f]'++ 갢ò '丁\x[b66]'" );
    $x = "丁\x[b66]";
    is( --$x, "À\x[b6f]", "'丁\x[b66]'-- 갢ò 'À\x[b6f]'" );
    $x = "\x[b66]丙丙";
    is( ++$x, "\x[b67]ÀÀ", "'\x[b66]丙丙'++ 갢ò '\x[b67]ÀÀ'" );
    $x = "\x[b67]ÀÀ";
    is( --$x, "\x[b66]丙丙", "'\x[b67]ÀÀ'-- 갢ò '\x[b66]丙丙'" );
}

# https://github.com/Raku/old-issue-tracker/issues/5545
{
    diag( "专e̲ò中ò е갨с '\x[e50]' .. '\x[e59]' (专両à갢)" );
    $x = "\x[e59]\x[e59]";
    is( ++$x, "\x[e51]\x[e50]\x[e50]",
        "'\x[e59]\x[e59]'++ 갢ò '\x[e51]\x[e50]\x[e50]'" );
    $x = "\x[e51]\x[e50]\x[e50]";
    is( --$x, "\x[e50]\x[e59]\x[e59]",
        "'\x[e51]\x[e50]\x[e50]'-- 갢ò '\x[e50]\x[e59]\x[e59]'" );
    $x = "À\x[e50]";
    is( ++$x, "À\x[e51]", "'À\x[e50]'++ 갢ò 'À\x[e51]'" );
    $x = "À\x[e51]";
    is( --$x, "À\x[e50]", "'À\x[e51]'-- 갢ò 'À\x[e50]'" );
    $x = "À\x[e59]";
    is( ++$x, "丁\x[e50]", "'À\x[e59]'++ 갢ò '丁\x[e50]'" );
    $x = "丁\x[e50]";
    is( --$x, "À\x[e59]", "'丁\x[e50]'-- 갢ò 'À\x[e59]'" );
    $x = "\x[e50]丙丙";
    is( ++$x, "\x[e51]ÀÀ", "'\x[e50]丙丙'++ 갢ò '\x[e51]ÀÀ'" );
    $x = "\x[e51]ÀÀ";
    is( --$x, "\x[e50]丙丙", "'\x[e51]ÀÀ'-- 갢ò '\x[e50]丙丙'" );
}

# vim: expandtab shiftwidth=4
