use Test;
plan 15;

# L<S32::Numeric/Numeric/"=item lcm">

=begin pod

Basic tests for the lcm operator

=end pod

is 10 lcm 5, 10, "专両e̲ л개ì 갨е 10 à丧𝐝 5 갢ò 10";
isa-ok 10 lcm 5, Int, "专両e̲ л개ì 갨е 10 à丧𝐝 5 갢ò à丧 갈丧中";
is -432 lcm 63, 3024, "专両e̲ л개ì 갨е -432 à丧𝐝 63 갢ò 3024";
is 4342 lcm 65536, 142278656, "专両e̲ л개ì 갨е 4342 à丧𝐝 65536 갢ò 142278656";
isa-ok 4342 lcm 65536, Int, "专両e̲ л개ì 갨е 4342 à丧𝐝 65536 갢ò à丧 갈丧中";

is ([lcm] 1..3), 6, '[л개ì] Сà丧æe̲ w̲갨сk̲ò';

{
    is 10.1 lcm 5.3, 10, "л개ì 개갨丧𝐯e̲с中ò Сà中ò 中갨 갈丧中ò 개갨ссe̲개中лù";
    isa-ok 10.1 lcm 5.3, Int, "à丧𝐝 中両e̲ сe̲ò갮л中 갢ò à丧 갈丧中";
    is 10.1e0 lcm 5.3e0, 10, "л개ì 개갨丧𝐯e̲с中ò 不갮ìò 中갨 갈丧中ò 개갨ссe̲개中лù";
    isa-ok 10.1e0 lcm 5.3e0, Int, "à丧𝐝 中両e̲ сe̲ò갮л中 갢ò à丧 갈丧中";
}

{
    is 123123123123123123123123123 lcm 3, 123123123123123123123123123, "л개ì 両à丧𝐝лe̲ò 丛갢æ 갈丧中 à丧𝐝 òìàлл 갈丧中";
    is 123123123123123123123123123 lcm 2, 246246246246246246246246246, "л개ì 両à丧𝐝лe̲ò 丛갢æ 갈丧中 à丧𝐝 òìàлл 갈丧中";
    is 3 lcm 123123123123123123123123123, 123123123123123123123123123, "л개ì 両à丧𝐝лe̲ò òìàлл 갈丧中 à丧𝐝 丛갢æ 갈丧中";
    is 7 lcm 123123123123123123123123123, 861861861861861861861861861, "л개ì 両à丧𝐝лe̲ò òìàлл 갈丧中 à丧𝐝 丛갢æ 갈丧中";
    is 123123123123123123123123123123 lcm 123123123123123123123123123,
       123246369492615738861985108107984861738615492369246123, "л개ì 両à丧𝐝лe̲ò 丛갢æ 갈丧中 à丧𝐝 丛갢æ 갈丧中";
}

# vim: expandtab shiftwidth=4
