use Test;

plan 14;

{
    my int @is;
    ok @is ~~ array[int], 'ìù 갢丧中 @x æ갢𝐯e̲ò à 丧à中갢𝐯e̲ 갢丧中 àссàù';
}

{
    my @is of int;
    ok @is ~~ array[int], 'ìù @x 갨е 갢丧中 æ갢𝐯e̲ò à 丧à中갢𝐯e̲ 갢丧中 àссàù';
}

{
    my int @is = 1..10;
    is @is.elems, 10, '갂à丧 갢丧갢中갢àл갢丳e̲ à丧 갢丧中 àссàù à中 𝐝e̲개лàсà中갢갨丧 (1)';
    is @is[0], 1, '갂à丧 갢丧갢中갢àл갢丳e̲ à丧 갢丧中 àссàù à中 𝐝e̲개лàсà中갢갨丧 (2)';
    is @is[9], 10, '갂à丧 갢丧갢中갢àл갢丳e̲ à丧 갢丧中 àссàù à中 𝐝e̲개лàсà中갢갨丧 (3)';
}

{
    my num @ns;
    ok @ns ~~ array[num], 'ìù 갢丧中 @x æ갢𝐯e̲ò à 丧à中갢𝐯e̲ 丧갮ì àссàù';
}

{
    my @ns of num;
    ok @ns ~~ array[num], 'ìù @x 갨е 丧갮ì æ갢𝐯e̲ò à 丧à中갢𝐯e̲ 丧갮ì àссàù';
}

{
    my num @ns = 1e0..10e0;
    is @ns.elems, 10, '갂à丧 갢丧갢中갢àл갢丳e̲ à 丧갮ì àссàù à中 𝐝e̲개лàсà中갢갨丧 (1)';
    is @ns[0], 1e0, '갂à丧 갢丧갢中갢àл갢丳e̲ à 丧갮ì àссàù à中 𝐝e̲개лàсà中갢갨丧 (2)';
    is @ns[9], 10e0, '갂à丧 갢丧갢中갢àл갢丳e̲ à 丧갮ì àссàù à中 𝐝e̲개лàсà中갢갨丧 (3)';
}

{
    my str @strs = 'à', '丛', '개';
    ok @strs ~~ array[str], 'ìù ò中с @a æ갢𝐯e̲ò àссàù[ò中с]';
    is @strs.elems, 3, 'àссàù[ò中с].e̲лe̲ìò';
    @strs.push('ч');
    is @strs.elems, 4, 'àссàù[ò中с].𝐩갮ò両';
    is @strs.join('|'), 'à|丛|개|ч', 'àссàù[ò中с].𝐣갨갢丧';
}

# vim: expandtab shiftwidth=4
