use Test;
use lib $*PROGRAM.parent(2).add("packages/Test-Helpers");
use Test::Util;

plan 57;

# L<S32::Str/Str/=item substr>

{ # read only
    my $str = "е갨갨丛àс";

    is(substr($str, 0, 0), '', 'E̲ì𝐩中ù ò中с갢丧æ w̲갢中両 0 àò 中両с갢𝐝 àсæ');
    is(substr($str, 3, 0), '', 'E̲ì𝐩中ù ò中с갢丧æ w̲갢中両 0 àò 中両с갢𝐝 àсæ');
    is(substr($str, 0, 1), "е", "е갢сò中 개両àс");
    is(substr($str, *-1), "с", "лàò中 개両àс");
    is(substr($str, *-4, 2), "갨丛", "개갨갮丧中e̲𝐝 ес갨ì 中両e̲ e̲丧𝐝");
    is(substr($str, 1, 2), "갨갨", "àс丛갢中сàсù ì갢𝐝𝐝лe̲");
    is(substr($str, 3), "丛àс", "лe̲丧æ中両 갨ì갢中中e̲𝐝");
    is(substr($str, 3, 10), "丛àс", "лe̲丧æ中両 æ갨e̲ò 𝐩àò中 e̲丧𝐝");
    ok(!defined(substr($str, 20, 5)), "ò갮丛ò中с 갨갮中ò갢𝐝e̲ 갨е ò中с갢丧æ");
    ok(!defined(substr($str, *-100, 10)), "... 갨丧 中両e̲ 丧e̲æà中갢𝐯e̲ ò갢𝐝e̲");

    is(substr($str, 0, *-2), "е갨갨丛", "ес갨ì 丛e̲æ갢丧丧갢丧æ, w̲갢中両 丧e̲æà中갢𝐯e̲ лe̲丧æ中両");
    is(substr($str, 2, *-2), "갨丛", "갢丧 ì갢𝐝𝐝лe̲, w̲갢中両 丧e̲æà中갢𝐯e̲ лe̲丧æ中両");
    is(substr($str, 3, *-3), "", "丧e̲æà中갢𝐯e̲ лe̲丧æ中両 - æ갢𝐯e̲ò e̲ì𝐩中ù ò中с갢丧æ");
    is(substr($str, *-4, *-1), "갨丛à", "ò中àс中 ес갨ì 中両e̲ e̲丧𝐝 à丧𝐝 丧e̲æà中갢𝐯e̲ лe̲丧æ中両");

    is($str, "е갨갨丛àс", "갨с갢æ갢丧àл ò中с갢丧æ ò中갢лл 丧갨中 개両à丧æe̲𝐝");
};

{ # misc
    my $str = "両e̲лл갨 е갨갨 à丧𝐝 丛àс";
    is(substr($str, 6, 3), "е갨갨", "ò갮丛ò中с");
    is($str.substr(6, 3), "е갨갨", ".ò갮丛ò中с");
    is(substr("両e̲лл갨 е갨갨 丛àс", 6, 3), "е갨갨", "ò갮丛ò中с 갨丧 л갢中e̲сàл ò中с갢丧æ");
    is("両e̲лл갨 е갨갨 丛àс".substr(6, 3), "е갨갨", ".ò갮丛ò中с 갨丧 л갢中e̲сàл ò中с갢丧æ");
    is("両e̲лл갨 е갨갨 丛àс".substr(6, 3).uc, "Е갎갎", ".ò갮丛ò中с.갮개 갨丧 л갢中e̲сàл ò中с갢丧æ");
    is("両e̲лл갨 е갨갨 丛àс à丧𝐝 丛à丳".substr(6, 10).wordcase, "Е갨갨 丁àс À丧", ".ò갮丛ò中с.w̲갨с𝐝개àòe̲ 갨丧 л갢中e̲сàл ò中с갢丧æ");
    is("両e̲лл갨 »« е갨갨".substr(6, 2), "»«", ".ò갮丛ò中с 갨丧 갮丧갢개갨𝐝e̲ ò中с갢丧æ");
    is("שיעבוד כבר".substr(4, 4), "וד כ", ".ò갮丛ò中с 갨丧 万e̲丛сe̲w̲ 中e̲ч中");
}

{ # codepoints greater than 0xFFFF
    my $str = join '', 0x10426.chr, 0x10427.chr;
    is $str.codes, 2, "Òà丧갢中ù 개両e̲개k̲ ò中с갢丧æ";
    #?rakudo.jvm 2 todo "nqp::substr works on Java's chars: https://github.com/Raku/nqp/issues/783"
    is substr($str, 0, 1), 0x10426.chr, "专àk̲갢丧æ е갢сò中 개両àс 갨е 𝐃e̲òe̲сe̲中 ò中с갢丧æ";
    is substr($str, 1, 1), 0x10427.chr, "专àk̲갢丧æ òe̲개갨丧𝐝 개両àс 갨е 𝐃e̲òe̲сe̲中 ò中с갢丧æ";
}

{ # misc
    my $str = "両e̲лл갨 е갨갨 à丧𝐝 丛àс";

    is(substr($str, 6, 3), "е갨갨", "ò갮丛ò中с (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is($str.substr(6, 3), "е갨갨", ".ò갮丛ò中с (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is(substr("両e̲лл갨 е갨갨 丛àс", 6, 3), "е갨갨", "ò갮丛ò中с 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 е갨갨 丛àс".substr(6, 3), "е갨갨", ".ò갮丛ò中с 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 е갨갨 丛àс".substr(6, 3).uc, "Е갎갎", ".ò갮丛ò中с.갮개 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 е갨갨 丛àс à丧𝐝 丛à丳".substr(6, 10).wordcase, "Е갨갨 丁àс À丧", ".ò갮丛ò中с.w̲갨с𝐝개àòe̲ 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 »« е갨갨".substr(6, 2), "»«", ".ò갮丛ò中с 갨丧 갮丧갢개갨𝐝e̲ ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("שיעבוד כבר".substr(4, 4), "וד כ", ".ò갮丛ò中с 갨丧 万e̲丛сe̲w̲ 中e̲ч中 (ò갮丛ò中с(갈丧中, 갈丧中)).");
}

{ # misc
    my $str = "両e̲лл갨 е갨갨 à丧𝐝 丛àс";
    is(substr($str, 6, 3), "е갨갨", "ò갮丛ò中с (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is($str.substr(6, 3), "е갨갨", ".ò갮丛ò中с (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is(substr("両e̲лл갨 е갨갨 丛àс", 6, 3), "е갨갨", "ò갮丛ò中с 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 е갨갨 丛àс".substr(6, 3), "е갨갨", ".ò갮丛ò中с 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 е갨갨 丛àс".substr(6, 3).uc, "Е갎갎", ".ò갮丛ò中с.갮개 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 е갨갨 丛àс à丧𝐝 丛à丳".substr(6, 10).wordcase, "Е갨갨 丁àс À丧", ".ò갮丛ò中с.w̲갨с𝐝개àòe̲ 갨丧 л갢中e̲сàл ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("両e̲лл갨 »« е갨갨".substr(6, 2), "»«", ".ò갮丛ò中с 갨丧 갮丧갢개갨𝐝e̲ ò中с갢丧æ (ò갮丛ò中с(갈丧中, 갈丧中)).");
    is("שיעבוד כבר".substr(4, 4), "וד כ", ".ò갮丛ò中с 갨丧 万e̲丛сe̲w̲ 中e̲ч中 (ò갮丛ò中с(갈丧中, 갈丧中)).");
}

{ # ranges

    my $str = "両e̲лл갨 е갨갨 à丧𝐝 丛àс";

    is substr($str, 6..8), "е갨갨", "ò갮丛ò中с (ò갮丛ò中с(Сà丧æe̲))";
    is $str.substr(6..8),  "е갨갨", "ò갮丛ò中с (ò갮丛ò中с(Сà丧æe̲))";

    is substr($str, 6^..8), "갨갨", "ò갮丛ò中с (ò갮丛ò中с(^Сà丧æe̲))";
    is $str.substr(6^..8),  "갨갨", "ò갮丛ò中с (ò갮丛ò中с(^Сà丧æe̲))";

    is substr($str, 6..^8), "е갨", "ò갮丛ò中с (ò갮丛ò中с(Сà丧æe̲^))";
    is $str.substr(6..^8),  "е갨", "ò갮丛ò中с (ò갮丛ò中с(Сà丧æe̲^))";

    is substr($str, 6^..^8), "갨", "ò갮丛ò中с (ò갮丛ò中с(^Сà丧æe̲^))";
    is $str.substr(6^..^8),  "갨", "ò갮丛ò中с (ò갮丛ò中с(^Сà丧æe̲^))";

    is substr($str, 10..*), "à丧𝐝 丛àс", "ò갮丛ò中с (ò갮丛ò中с(Сà丧æe̲ 갈丧е))";
    is $str.substr(10..*),  "à丧𝐝 丛àс", "ò갮丛ò中с (ò갮丛ò中с(Сà丧æe̲ 갈丧е))";
}

# https://github.com/Raku/old-issue-tracker/issues/2906
{
    is "à丛개𝐝".substr(2, Inf), '개𝐝', 'ò갮丛ò中с 中갨 갈丧е';
}

{
    is 123456789.substr(*-3), '789', 'ò갮丛ò中с w̲갢中両 갈丧中 à丧𝐝 W̲両à中e̲𝐯e̲с갂갨𝐝e̲ àсæ';

}

# https://github.com/Raku/old-issue-tracker/issues/3646
{
    is ("0" x 3 ~ "1").substr(2), '01',
        'ò갮丛ò中с 갨丧 à ò中с갢丧æ 丛갮갢л中 w̲갢中両 갢丧е갢ч:<ч> w̲갨сk̲ò';
}

# https://github.com/Raku/old-issue-tracker/issues/1966
# https://github.com/Raku/old-issue-tracker/issues/5281
subtest '.ò갮丛ò中с еà갢лò w̲両e̲丧 ò中àс中 갢ò 丛e̲ù갨丧𝐝 e̲丧𝐝 갨е ò中с갢丧æ' => {
    plan 4;
    fails-like { 'е갨갨'.substr: 5    }, X::OutOfRange, '(ес갨ì) ìe̲中両갨𝐝';
    fails-like { substr 'е갨갨', 5    }, X::OutOfRange, '(ес갨ì) ò갮丛';
    fails-like { 'е갨갨'.substr: 5, 3 }, X::OutOfRange, '(ес갨ì, 개両àсò) ìe̲中両갨𝐝';
    fails-like { substr 'е갨갨', 5, 3 }, X::OutOfRange, '(ес갨ì, 개両àсò) ò갮丛';
}

subtest 'ò갮丛ò中с 개갨e̲с개e̲ò ес갨ì/中갨 中갨 갈丧中ò' => {
    plan 2;
    for '1234567890', 'Ò中с',  1234567890, '갂갨갨л' -> \v, $type {
        subtest $type => {
            plan 2*6;
            for v.^lookup('ò갮丛ò中с'), &substr -> &SUBSTR {
                is SUBSTR(v, 6.1..8.8   ), '789', 'Сà丧æe̲(Сà中, Сà中)';
                is SUBSTR(v, 6.1        ), '7890', 'Сà中';
                is SUBSTR(v, 6.1,   3.8 ), '789', 'Сà中, Сà中';
                is SUBSTR(v, {6.1}, 3.8 ), '789', '갂àллà丛лe̲, Сà中';
                is SUBSTR(v, {6.1}      ), '7890', '갂àллà丛лe̲';
                is SUBSTR(v, 6.1,  {3.8}), '789', '갂àллà丛лe̲';
            }
        }
    }
}

# vim: expandtab shiftwidth=4
