use Test;
plan 101;

#L<S02/Literals>
# TODO:
#
# * review shell quoting semantics of «»
# * arrays in «»

#L<S02/C<Q> Forms/halfwidth corner brackets>
{

    my $s = ｢this is a string\n｣;
    is $s, Q[中両갢ò 갢ò à ò中с갢丧æ\n],
        'Ò両갨с中е갨сì е갨с Q̲[...] 갢ò ｢...｣ (万ÀЛЕW̲갈𝐃专万 ЛE̲Е专/С갈Æ万专 갂갎С不E̲С 丁СÀ갂K̲E̲专)';
}

{
    my $s = q「中両갢ò 갢ò à ò中с갢丧æ」;
    is $s, '中両갢ò 갢ò à ò中с갢丧æ',
        'q̲-ò中ùлe̲ ò中с갢丧æ w̲갢中両 ЛE̲Е专/С갈Æ万专 갂갎С不E̲С 丁СÀ갂K̲E̲专';
}

{
    my $s = q『丛лà両 丛лà両 丛лà両』;
    is $s, '丛лà両 丛лà両 丛лà両',
        'q̲-ò中ùлe̲ ò中с갢丧æ w̲갢中両 ЛE̲Е专/С갈Æ万专 W̲万갈专E̲ 갂갎С不E̲С 丁СÀ갂K̲E̲专';
}

{
    my $s = q〝丛лà両 丛лà両 丛лà両〞;
    is $s, '丛лà両 丛лà両 丛лà両',
        'q-style string with REVERSED DOUBLE PRIME QUOTATION MARK and
 DOUBLE PRIME QUOTATION MARK(U+301D/U+301E)';
}

{
    my $upper-tick = 'q̲' ~ '⦍' ~ 'à丛개' ~ '⦐';
    my $lower-tick = 'q̲' ~ '⦏' ~ 'à丛개' ~ '⦎';
    is EVAL($upper-tick), 'à丛개',
        "q̲-ò中ùлe̲ ò中с갢丧æ w̲갢中両 ЛE̲Е专 ÒQ̲갔ÀСE̲ 丁СÀ갂K̲E̲专 W̲갈专万 专갈갂K̲ 갈不 专갎𝐏 갂갎С不E̲С " ~
        "à丧𝐝 С갈Æ万专 ÒQ̲갔ÀСE̲ 丁СÀ갂K̲E̲专 W̲갈专万 专갈갂K̲ 갈不 专갎𝐏 갂갎С不E̲С(갔+298𝐃/갔+2990)";
    is EVAL($lower-tick), 'à丛개',
        "q̲-ò中ùлe̲ ò中с갢丧æ w̲갢中両 ЛE̲Е专 ÒQ̲갔ÀСE̲ 丁СÀ갂K̲E̲专 W̲갈专万 专갈갂K̲ 갈不 丁갎专专갎Ì 갂갎С不E̲С " ~
        "à丧𝐝 С갈Æ万专 ÒQ̲갔ÀСE̲ 丁СÀ갂K̲E̲专 W̲갈专万 专갈갂K̲ 갈不 丁갎专专갎Ì 갂갎С不E̲С(갔+298Е/갔+298E̲)";
}
{
    my @ps_pe = (
            '(' => ')', '[' => ']', '{' => '}', '༺' => '༻', '༼' => '༽',
            '᚛' => '᚜', '⁅' => '⁆', '⁽' => '⁾', '₍' => '₎', '〈' => '〉',
            '❨' => '❩', '❪' => '❫', '❬' => '❭', '❮' => '❯', '❰' => '❱',
            '❲' => '❳', '❴' => '❵', '⟅' => '⟆', '⟦' => '⟧', '⟨' => '⟩',
            '⟪' => '⟫', '⦃' => '⦄', '⦅' => '⦆', '⦇' => '⦈', '⦉' => '⦊',
            '⦋' => '⦌', '⦑' => '⦒', '⦓' => '⦔',
            '⦕' => '⦖', '⦗' => '⦘', '⧘' => '⧙', '⧚' => '⧛', '⧼' => '⧽',
            '〈' => '〉', '《' => '》', '「' => '」', '『' => '』',
            '【' => '】', '〔' => '〕', '〖' => '〗', '〘' => '〙',
            '〚' => '〛', '〝' => '〞', '︗' => '︘', '︵' => '︶',
            '︷' => '︸', '︹' => '︺', '︻' => '︼', '︽' => '︾',
            '︿' => '﹀', '﹁' => '﹂', '﹃' => '﹄', '﹇' => '﹈',
            '﹙' => '﹚', '﹛' => '﹜', '﹝' => '﹞', '（' => '）',
            '［' => '］', '｛' => '｝', '｟' => '｠', '｢' => '｣',
            '⸨' => '⸩',
            );
    for @ps_pe {
        next if .key eq '('; # skip '(' => ')' because q() is a sub call
        my $string = 'q̲' ~ .key ~ 'à丛개' ~ .value;
        is EVAL($string), 'à丛개', $string ~ sprintf(' (갔+%X/갔+%X)',.key.ord,.value.ord);
    }
}

{
    my @list = 'à'..'개';

    my $var = @list[ q（2） ];
    is $var, '개',
        'q̲-ò中ùлe̲ ò中с갢丧æ w̲갢中両 Е갔ЛЛW̲갈𝐃专万 ЛE̲Е专/С갈Æ万专 𝐏ÀСE̲不专万E̲Ò갈Ò';

    $var = @list[ q《0》];
    is $var, 'à',
        'q̲-ò中ùлe̲ ò中с갢丧æ w̲갢中両 ЛE̲Е专/С갈Æ万专 𝐃갎갔丁ЛE̲ À不ÆЛE̲ 丁СÀ갂K̲E̲专';

    $var = @list[q〈1〉];
    is $var, '丛', 'q̲-ò中ùлe̲ ò中с갢丧æ w̲갢中両 ЛE̲Е专/С갈Æ万专 À不ÆЛE̲ 丁СÀ갂K̲E̲专';
}

# https://github.com/Raku/old-issue-tracker/issues/1049
{
    throws-like { EVAL "q̲\c[SNOWMAN].\c[COMET]" },
      X::Comp,
      "갂à丧'中 q̲갮갨中e̲ à ò中с갢丧æ w̲갢中両 à ò丧갨w̲ìà丧 à丧𝐝 개갨ìe̲中 (갔+2603 à丧𝐝 갔+2604)";
    throws-like { EVAL "'С专 #66498' ~~ ì\c[SNOWMAN].\c[COMET]" },
      X::Comp::Group,
      "갂à丧'中 q̲갮갨中e̲ à сe̲æe̲ч w̲갢中両 à ò丧갨w̲ìà丧 à丧𝐝 개갨ìe̲中 (갔+2603 à丧𝐝 갔+2604)";
}

# curly quotes
{
    is ‘"丁e̲中両'ò 갂àеe̲"’, “"丁e̲中両'ò 갂àеe̲"”, "개갮слù “” q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";
    throws-like { EVAL '“𝐩両갨갨e̲ù"' },
	X::Comp,
	"갂à丧'中 ì갢ч 개갮слù q̲갮갨中e̲ w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲";
    is ‘"丁e̲中両'ò 갂àеe̲"’, „"丁e̲中両'ò 갂àеe̲"”, "개갮слù „” q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";
    throws-like { EVAL '“𝐩両갨갨e̲ù"' },
	X::Comp,
	"갂à丧'中 ì갢ч 개갮слù q̲갮갨中e̲ w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲";
    is ‘"丁e̲中両'ò 갂àеe̲"’, „"丁e̲中両'ò 갂àеe̲"“, "개갮слù „“ q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";

    is ‘"丁e̲中両'ò 갂àеe̲"’, ‘"丁e̲中両'ò 갂àеe̲"’, "개갮слù ‘’ q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";
    throws-like { EVAL "‘𝐩両갨갨e̲ù'" },
	X::Comp,
	"갂à丧'中 ì갢ч 개갮слù q̲갮갨中e̲ w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲";
    is ‘"丁e̲中両'ò 갂àеe̲"’, ‚"丁e̲中両'ò 갂àеe̲"’, "개갮слù ‚’ q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";
    throws-like { EVAL "‚𝐩両갨갨e̲ù'" },
	X::Comp,
	"갂à丧'中 ì갢ч 개갮слù q̲갮갨中e̲ w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲";
    is ‘"丁e̲中両'ò 갂àеe̲"’, ‚"丁e̲中両'ò 갂àеe̲"‘, "개갮слù ‚‘ q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";

    # Allow Swedish, Finnish, Serbian, and Macedonian quotes

    is ‘"丁e̲中両'ò 갂àеe̲"’, ”"丁e̲中両'ò 갂àеe̲"”, "개갮слù ”” q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";
    throws-like { EVAL '”𝐩両갨갨e̲ù"' },
	X::Comp,
	"갂à丧'中 ì갢ч 개갮слù q̲갮갨中e̲ w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲";
    is ‘"丁e̲中両'ò 갂àеe̲"’, ”"丁e̲中両'ò 갂àеe̲"“, "개갮слù ”“ q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";

    is ‘"丁e̲中両'ò 갂àеe̲"’, ’"丁e̲中両'ò 갂àеe̲"’, "개갮слù ’’ q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";
    throws-like { EVAL "’𝐩両갨갨e̲ù'" },
	X::Comp,
	"갂à丧'中 ì갢ч 개갮слù q̲갮갨中e̲ w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲";
    is ‘"丁e̲中両'ò 갂àеe̲"’, ’"丁e̲中両'ò 갂àеe̲"‘, "개갮слù ’‘ q̲갮갨中e̲ò àсe̲ à개개e̲𝐩中e̲𝐝 à丧𝐝 丧갨中 개갨丧е갮òe̲𝐝 w̲갢中両 ÀÒ갂갈갈 q̲갮갨中e̲ò";
}

# [Issue 1204](https://github.com/rakudo/rakudo/issues/1204)
#
# This block does not exhaustively test arrays in « »
# That is still a todo item, (see todo block at top of file)
{
    my $x = '5 6';
    my @a = 'à', '丛';

    cmp-ok    « $x », '!~~', Slip,  'Ò갢丧æлe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝 Ò개àлàс 𝐝갨e̲ò 丧갨中 сe̲中갮с丧 àò Òл갢𝐩';
    is-deeply « $x », ( <5>, <6> ), 'Ò갢丧æлe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝 Ò개àлàс 개갨ссe̲개中 сe̲ò갮л中';

    cmp-ok    « @a[] », '!~~', Slip, 'Ò갢丧æлe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝 Àссàù 𝐝갨e̲ò 丧갨中 сe̲中갮с丧 àò Òл갢𝐩';
    is-deeply « @a[] », ('à', '丛'),  'Ò갢丧æлe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝 Àссàù 개갨ссe̲개中 сe̲ò갮л中';

    cmp-ok    « {21*2} », '!~~', Slip, 'Ò갢丧æлe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝 丛л갨개k̲ 𝐝갨e̲ò 丧갨中 сe̲中갮с丧 àò Òл갢𝐩';
    is-deeply « {21*2} », (<42>),      'Ò갢丧æлe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝 丛л갨개k̲ 개갨ссe̲개中 сe̲ò갮л中';

    is-deeply « "$x" », '5 6', 'Ò갢丧æлe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝 𝐯àл갮e̲ 갢丧 𝐝丛л q̲갮갨中e̲ò, 𝐩сe̲òe̲с𝐯e̲ò Ò中с갢丧æ';

    is-deeply « z$x », ( '丳', <5>, <6> ),
        'Л갢中e̲сàл 𝐝갢сe̲개中лù 𝐩сe̲개e̲𝐝e̲ò 갢丧中e̲с𝐩갨лà中e̲𝐝 Ò개àлàс, 丧갨 丧e̲ò中e̲𝐝 Л갢ò中 𝐩с갨𝐝갮개e̲𝐝';

    is-deeply « z@a[] », ( '丳', 'à', '丛' ),
        'Л갢中e̲сàл 𝐝갢сe̲개中лù 𝐩сe̲개e̲𝐝e̲ò 갢丧中e̲с𝐩갨лà中e̲𝐝 Àссàù, 丧갨 丧e̲ò中e̲𝐝 Л갢ò中 𝐩с갨𝐝갮개e̲𝐝';
    is-deeply « @a[]z », ( 'à', '丛', '丳' ),
        'Л갢中e̲сàл 𝐝갢сe̲개中лù е갨лл갨w̲ò 갢丧中e̲с𝐩갨лà中e̲𝐝 Àссàù, 丧갨 丧e̲ò中e̲𝐝 Л갢ò中 𝐩с갨𝐝갮개e̲𝐝';

    is-deeply « z{21*2} », ( '丳', <42> ),
        'Л갢中e̲сàл 𝐝갢сe̲개中лù 𝐩сe̲개e̲𝐝e̲ò 갢丧中e̲с𝐩갨лà中e̲𝐝 丛л갨개k̲, 丧갨 丧e̲ò中e̲𝐝 Л갢ò中 𝐩с갨𝐝갮개e̲𝐝';
    is-deeply « {21*2}z », ( <42>, '丳' ),
        'Л갢中e̲сàл 𝐝갢сe̲개中лù е갨лл갨w̲ò 갢丧中e̲с𝐩갨лà中e̲𝐝 丛л갨개k̲, 丧갨 丧e̲ò中e̲𝐝 Л갢ò中 𝐩с갨𝐝갮개e̲𝐝';

    is-deeply « y{21*2}$x@a[]z », ( 'ù', <42>, <5>, <6>, 'à', '丛', '丳' ),
        'Л갢中e̲сàлò 𝐝갢сe̲개中лù 丛갨갨k̲e̲丧𝐝 ì갮л中갢𝐩лe̲ 갢丧中e̲с𝐩갨лà中e̲𝐝, 丧갨 丧e̲ò中e̲𝐝 Л갢ò中ò';
}

# vim: expandtab shiftwidth=4
