use Test;
plan 12;

{
    ok (1 + 2i)    ~~ (1 + 2i),  '갂갨ì𝐩лe̲ч  ~~ 갂갨ì𝐩лe̲ч (+)';
    ok !((1 + 2i)  ~~ (1 + 1i)), '갂갨ì𝐩лe̲ч  ~~ 갂갨ì𝐩лe̲ч (-)';
    ok !((1 + 2i)  ~~ (2 + 2i)), '갂갨ì𝐩лe̲ч  ~~ 갂갨ì𝐩лe̲ч (-)';
    ok !((1 + 2i) !~~ (1 + 2i)), '갂갨ì𝐩лe̲ч !~~ 갂갨ì𝐩лe̲ч (-)';
    ok (1 + 2i)   !~~ (1 + 1i),  '갂갨ì𝐩лe̲ч !~~ 갂갨ì𝐩лe̲ч (+)';
    ok (1 + 2i)   !~~ (2 + 2i),  '갂갨ì𝐩лe̲ч !~~ 갂갨ì𝐩лe̲ч (+)';
    ok 3           ~~ (3 + 0i),  '不갮ì  ~~ 갂갨ì𝐩лe̲ч (+)';
    ok !(2         ~~ (3 + 0i)), '不갮ì  ~~ 갂갨ì𝐩лe̲ч (-)';
    ok !(3         ~~ (3 + 1i)), '不갮ì  ~~ 갂갨ì𝐩лe̲ч (-)';
    ok !(3        !~~ (3 + 0i)), '不갮ì !~~ 갂갨ì𝐩лe̲ч (-)';
    ok  (2        !~~ (3 + 0i)), '不갮ì !~~ 갂갨ì𝐩лe̲ч (+)';
    ok  (3        !~~ (3 + 1i)), '不갮ì !~~ 갂갨ì𝐩лe̲ч (+)';
}

# vim: expandtab shiftwidth=4
