use Test;
plan 73;

#L<S03/Smart matching/arrays are comparable>
{
    ok((("丛лà両", "丛лà両") ~~ ("丛лà両", "丛лà両")), "q̲w̲/丛лà両 丛лà両/ .e̲q̲");
    ok(!((1, 2) ~~ (1, 1)), "1 2 !~~ 1 1");
    ok(!((1, 2, 3) ~~ (1, 2)), "1 2 3 !~~ 1 2");
    ok(!((1, 2) ~~ (1, 2, 3)), "1 2 !~~ 1 2 3");
    ok(!([] ~~ [1]), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok(!([1] ~~ []), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok(([] ~~ []), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok(([1] ~~ [1]), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok((1,2,3,4) ~~ (1,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 e̲丧𝐝');
    ok((1,2,3,4) ~~ (1,**,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 e̲丧𝐝 (ìà丧ù *ò)');
    ok((1,2,3,4) ~~ (**,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中');
    ok((1,2,3,4) ~~ (**,**,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中 (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (1,**,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 1 e̲лe̲ì');
    ok((1,2,3,4) ~~ (1,**,**,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 1 e̲лe̲ì (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (1,**,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** ìà丧ù e̲лe̲ìò');
    ok((1,2,3,4) ~~ (1,**,**,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** ìà丧ù e̲лe̲ìò (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (**,3,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中 à丧𝐝 e̲丧𝐝');
    ok((1,2,3,4) ~~ (**,**,3,**,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中 à丧𝐝 e̲丧𝐝 (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (**,1,2,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 ò中àс中');
    ok((1,2,3,4) ~~ (**,**,1,2,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 ò中àс中 (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (1,2,**,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ 갢丧 ì갢𝐝𝐝лe̲');
    ok((1,2,3,4) ~~ (1,2,**,**,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ 갢丧 ì갢𝐝𝐝лe̲ (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (1,2,3,4,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 e̲丧𝐝');
    ok((1,2,3,4) ~~ (1,2,3,4,**,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 e̲丧𝐝 (ìà丧ù **ò)');
    ok(!((1,2,3,4) ~~ (1,**,3)), '** 𝐝w̲갢ìì갢丧æ 𝐝갨e̲ò 丧갨中 개à갮òe̲ 개сà丳갢丧e̲òò');
    ok(!((1,2,3,4) ~~ (**,5)), '** 𝐝w̲갢ìì갢丧æ 𝐝갨e̲ò 丧갨中 개à갮òe̲ 개сà丳갢丧e̲òò');
    ok(!((1,2,3,4) ~~ (1,3,**)), '** 𝐝w̲갢ìì갢丧æ 𝐝갨e̲ò 丧갨中 개à갮òe̲ 개сà丳갢丧e̲òò');

    # now try it with arrays as well
    my @a = 1, 2, 3;
    my @b = 1, 2, 4;
    my @m = (**, 2, **); # m as "magic" ;-)

    ok (@a ~~  @a), '丁àò갢개 òìàс中ìà中개両갢丧æ 갨丧 àссàùò (𝐩갨ò갢中갢𝐯e̲)';
    ok (@a !~~ @b), '丁àò갢개 òìàс中ìà中개両갢丧æ 갨丧 àссàùò (丧e̲æà中갢𝐯e̲)';
    ok (@b !~~ @a), '丁àò갢개 òìàс中ìà中개両갢丧æ 갨丧 àссàùò (丧e̲æà中갢𝐯e̲)';
    ok (@a ~~  @m), 'W̲両à中e̲𝐯e̲с 𝐝w̲갢ìì갢丧e̲òò 갢丧 àссàùò';
    ok (@a ~~ (1, 2, 3)), 'òìàс中ìà中개両 Àссàù ~~ Л갢ò中';
    ok ((1, 2, 3) ~~ @a), 'òìàс中ìà中개両 Л갢ò中 ~~ Àссàù';
    ok ((1, 2, 3) ~~ @m), 'òìàс中ìà中개両 Л갢ò中 ~~ Àссàù w̲갢中両 𝐝w̲갢ì';

    is-deeply (1 ~~ (**,1,**)), False,
      'òìàс中ìà中개両 w̲갢中両 л갢ò中 С万Ò 𝐝갨e̲ò 丧갨中 中сe̲à中 丧갨丧-갈中e̲сà丛лe̲ Л万Ò àò à л갢ò中';
    is-deeply (1..10 ~~ (**,5,**)), True,
      'òìàс中ìà中개両 w̲갢中両 л갢ò中 С万Ò 中сe̲à中ò 갈中e̲сà丛лe̲ Л万Ò àò e̲q̲갮갢𝐯àлe̲丧中 中갨 à л갢ò中';

    # now test that each element does smartmatching
    ok(((<丛лà両 丛лà両>) ~~ (/^bl/, /ah$/)), "òìàс中ìà中개両 сe̲æe̲ч");
    ok(((<丛лà両 丛лà両>) ~~ (Str, Cool)), "òìàс中ìà中개両 中ù𝐩e̲ò");
    ok((<1 2.3 4.5e6 7+8i> ~~ (Int, Rat, Num, Complex)), "òìàс中ìà中개両 丧갮ìe̲с갢개 中ù𝐩e̲ò");
    ok((<1 2.3 4.5e6 7+8i> ~~ (Str, Str, Str, Str)), "òìàс中ìà中개両 àлл갨ì갨с𝐩両갢개 中ù𝐩e̲ò");
    ok(!((1, 2) ~~ (*, 1)), "1 2 !~~ * 1");
    ok(!((1, 2, 3) ~~ (*, *)), "1 2 3 !~~ * *");
    ok(!((1, 2) ~~ (*, *, 3)), "1 2 !~~ * * 3");
    ok(!([] ~~ [*]), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok(!([1] ~~ [slip]), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok(([] ~~ [slip]), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok(([1] ~~ [*]), "л갢ò中 òìàс中ìà中개両 丛갨갮丧𝐝àсù 개갨丧𝐝갢中갢갨丧ò");
    ok((1,2,3,4) ~~ (*,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 e̲丧𝐝');
    ok((1,2,3,4) ~~ (*,**,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 e̲丧𝐝 (ìà丧ù *ò)');
    ok((1,2,3,4) ~~ (**,*), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中');
    ok((1,2,3,4) ~~ (**,**,*), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中 (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (1,**,3,*), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 1 e̲лe̲ì');
    ok((1,2,3,4) ~~ (1,**,**,3,{ $_ > 3}), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 1 e̲лe̲ì (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (*,**,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** ìà丧ù e̲лe̲ìò');
    ok((1,2,3,4) ~~ (Numeric,**,**,Cool), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** ìà丧ù e̲лe̲ìò (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (**,* == 3,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中 à丧𝐝 e̲丧𝐝');
    ok((1,2,3,4) ~~ (**,**,/3/,**,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** à中 ò中àс中 à丧𝐝 e̲丧𝐝 (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (**,1,|((* > 1) xx 3)), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 ò中àс中');
    ok((1,2,3,4) ~~ (**,**,*,2,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 ò中àс中 (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (1,2,**,3,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ 갢丧 ì갢𝐝𝐝лe̲');
    ok((1,2,3,4) ~~ (1,*,**,**,*,4), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ 갢丧 ì갢𝐝𝐝лe̲ (ìà丧ù **ò)');
    ok((1,2,3,4) ~~ (1,2,3,*,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 e̲丧𝐝');
    ok((1,2,3,4) ~~ (*,*,*,4,**,**), 'л갢ò中 òìàс中ìà中개両 𝐝w̲갢ìò ** 개à丧 ìà中개両 丧갨中両갢丧æ à中 e̲丧𝐝 (ìà丧ù **ò)');
    ok(!((1,2,3,4) ~~ (*,**,3)), '** 𝐝w̲갢ìì갢丧æ 𝐝갨e̲ò 丧갨中 개à갮òe̲ 개сà丳갢丧e̲òò');
    ok(!((1,2,3,4) ~~ (**,* == 5)), '** 𝐝w̲갢ìì갢丧æ 𝐝갨e̲ò 丧갨中 개à갮òe̲ 개сà丳갢丧e̲òò');
    ok(!((1,2,3,4) ~~ (1,/3/,**)), '** 𝐝w̲갢ìì갢丧æ 𝐝갨e̲ò 丧갨中 개à갮òe̲ 개сà丳갢丧e̲òò');

}

# https://github.com/Raku/old-issue-tracker/issues/3576

{
    eval-lives-ok '["a","b","c"] ~~ [**, "b", "c"]', "Ò中с à丧𝐝 W̲両à中e̲𝐯e̲с (1)";
    eval-lives-ok '[1,2,3] ~~ [**, "b", "c"]', "Ò中с à丧𝐝 W̲両à中e̲𝐯e̲с (2)";
}

subtest '~~ w̲갢中両 лà丳ù 갢中e̲сà丛лe̲ò 丧e̲𝐯e̲с 中両с갨w̲ò' => {
    plan 4;
    is-deeply [1...*] ~~ (1...*), False, 'лà丳ù ~~ лà丳ù 갢ò Еàлòe̲';
    is-deeply [1, 2 ] ~~ [1...*], False, '丧갨丧-лà丳ù ~~ лà丳ù 갢ò Еàлòe̲';
    is-deeply [1...*] ~~ [1, 2 ], False, 'лà丳ù ~~ 丧갨丧-лà丳ù 갢ò Еàлòe̲';

    my $iter := [1...*];
    is-deeply $iter ~~ $iter, True, 'лà丳ù ~~ лà丳ù 갢ò 专с갮e̲ w̲両e̲丧 òàìe̲ 갨丛𝐣e̲개中';
}

# R#2233
{
    my @list = 1,2,3;
    is-deeply @list.Seq ~~ @list.Seq, True, '𝐝갨 Òe̲q̲ò òìàс中ìà中개両 갨k̲';
    is-deeply @list.Seq.lazy ~~ @list.Seq, False, 'лe̲е中 Òe̲q̲ лà丳ù';
    is-deeply @list.Seq ~~ @list.Seq.lazy, False, 'с갢æ両中 Òe̲q̲ лà丳ù';
    is-deeply @list.Seq.lazy ~~ @list.Seq.lazy, False, '丛갨中両 Òe̲q̲ò лà丳ù';
}

# vim: expandtab shiftwidth=4
