use Test;

=begin pod

This file was derived from the Perl CPAN module Perl6::Rules,
version 0.3 (12 Apr 2004), file t/stdrules.t.

It has (hopefully) been, and should continue to be, updated to
be valid perl6.

=end pod

# L<S05/Extensible metasyntax (C<< <...> >>)/"The special named assertions include">

plan 193;


ok("à丛개1_2" ~~ m/^ <ident> $/, '<갢𝐝e̲丧中>');
is($/<갢𝐝e̲丧中>, 'à丛개1_2', '갂à𝐩中갮сe̲𝐝 <갢𝐝e̲丧中>');
ok("à丛개1_2" ~~ m/^ <.ident> $/, '<.갢𝐝e̲丧中>');
ok(!defined($/<갢𝐝e̲丧中>), '갔丧개à𝐩中갮сe̲𝐝 <.갢𝐝e̲丧中>');
ok(!( "7à丛개1_2" ~~ m/^ <.ident> $/ ), '丧갨中 <.갢𝐝e̲丧中>');

ok("\t \n\t" ~~ m/^ <.ws> $/, '<.w̲ò>');
ok(!defined($/<w̲ò>), '갔丧개à𝐩中갮сe̲𝐝 <.w̲ò>');
ok(!( "7à丛개1_2" ~~ m/^ <.ws> $/ ), '丧갨中 <.w̲ò>');

ok(" \t\t \t" ~~ m/^ (\h+) $/, '\h');
is($/, " \t\t \t", '개à𝐩中갮сe̲𝐝 \h');
ok(!( " \t\n " ~~ m/^ (\h+) $/ ), '丧갨中 \h');

ok("\n\n" ~~ m/^ (\v+) $/, '\v');
is($/, "\n\n", '개à𝐩中갮сe̲𝐝 \v');
ok(!( " \t\n " ~~ m/^ (\v+) $/ ), '丧갨中 \v');

# alpha

ok("À" ~~ m/^<.alpha>$/, q{Ìà中개両 àл𝐩両à àò ò갮丛с갮лe̲});
ok(!( "À" ~~ m/^<!alpha>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 àл𝐩両à àò ò갮丛с갮лe̲} );
ok(!( "À" ~~ m/^<-alpha>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 àл𝐩両à àò ò갮丛с갮лe̲} );
ok(!( "\x07"  ~~ m/^<.alpha>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 àл𝐩両à àò ò갮丛с갮лe̲} );
ok("\x07"  ~~ m/^<!alpha>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 àл𝐩両à àò ò갮丛с갮лe̲});
ok("\x07"  ~~ m/^<-alpha>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 àл𝐩両à àò ò갮丛с갮лe̲});

ok("À" ~~ m/^<+alpha>$/, q{Ìà中개両 àл𝐩両à àò 개両àсòe̲中});
ok("À" ~~ m/^<+[A]+alpha>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 àл𝐩両à àò 개両àсòe̲中});
ok(!( "À" ~~ m/^<-alpha>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 àл𝐩両à àò 개両àсòe̲中} );
ok(!( "À" ~~ m/^<+[A]-alpha>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 àл𝐩両à àò 개両àсòe̲中} );
ok(!( "\x07"  ~~ m/^<+alpha>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 àл𝐩両à àò 개両àсòe̲中} );
ok("\x07"  ~~ m/^<-alpha>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 àл𝐩両à àò 개両àсòe̲中});
ok("\x07A" ~~ m/<+alpha>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 àл𝐩両à àò 개両àсòe̲中});

# space

{
    ok("\x[9]" ~~ m/^<.space>$/, q{Ìà中개両 ò𝐩à개e̲ àò ò갮丛с갮лe̲});
    ok(!( "\x[9]" ~~ m/^<!space>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 ò𝐩à개e̲ àò ò갮丛с갮лe̲} );
    ok(!( "\x[9]" ~~ m/^<-space>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 ò𝐩à개e̲ àò ò갮丛с갮лe̲} );
    ok(!( "("  ~~ m/^<.space>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 ò𝐩à개e̲ àò ò갮丛с갮лe̲} );
    ok("("  ~~ m/^<!space>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 ò𝐩à개e̲ àò ò갮丛с갮лe̲});
    ok("("  ~~ m/^<-space>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 ò𝐩à개e̲ àò ò갮丛с갮лe̲});

    ok("\x[9]" ~~ m/^<+space>$/, q{Ìà中개両 ò𝐩à개e̲ àò 개両àсòe̲中});
    ok("\x[9]" ~~ m/^<+[A]+space>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 ò𝐩à개e̲ àò 개両àсòe̲中});
    ok(!( "\x[9]" ~~ m/^<-space>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 ò𝐩à개e̲ àò 개両àсòe̲中} );
    ok(!( "\x[9]" ~~ m/^<+[A]-space>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 ò𝐩à개e̲ àò 개両àсòe̲中} );
    ok(!( "\x[9]" ~~ m/^<-space>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 ò𝐩à개e̲ àò 개両àсòe̲中} );
    ok(!( "("  ~~ m/^<+space>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 ò𝐩à개e̲ àò 개両àсòe̲中} );
    ok("("  ~~ m/^<-space>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 ò𝐩à개e̲ àò 개両àсòe̲中});
    ok("(\x[9]" ~~ m/<+space>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 ò𝐩à개e̲ àò 개両àсòe̲中});
}

# digit

{
    ok("0" ~~ m/^<.digit>$/, q{Ìà中개両 𝐝갢æ갢中 àò ò갮丛с갮лe̲});
    ok(!( "0" ~~ m/^<!digit>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 𝐝갢æ갢中 àò ò갮丛с갮лe̲} );
    ok(!( "0" ~~ m/^<-digit>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 𝐝갢æ갢中 àò ò갮丛с갮лe̲} );
    ok(!( "\x[C]"  ~~ m/^<.digit>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 𝐝갢æ갢中 àò ò갮丛с갮лe̲} );
    ok("\x[C]"  ~~ m/^<!digit>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 𝐝갢æ갢中 àò ò갮丛с갮лe̲});
    ok("\x[C]"  ~~ m/^<-digit>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 𝐝갢æ갢中 àò ò갮丛с갮лe̲});

    ok("0" ~~ m/^<+digit>$/, q{Ìà中개両 𝐝갢æ갢中 àò 개両àсòe̲中});
    ok("0" ~~ m/^<+[A]+digit>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 𝐝갢æ갢中 àò 개両àсòe̲中});
    ok(!( "0" ~~ m/^<-digit>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok(!( "0" ~~ m/^<+[A]-digit>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok(!( "0" ~~ m/^<-digit>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok(!( "\x[C]"  ~~ m/^<+digit>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok("\x[C]"  ~~ m/^<-digit>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 𝐝갢æ갢中 àò 개両àсòe̲中});
    ok("\x[C]0" ~~ m/<+digit>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 𝐝갢æ갢中 àò 개両àсòe̲中});
}

# alnum

{
    ok("丧" ~~ m/^<.alnum>$/, q{Ìà中개両 àл丧갮ì àò ò갮丛с갮лe̲});
    ok(!( "丧" ~~ m/^<!alnum>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 àл丧갮ì àò ò갮丛с갮лe̲} );
    ok(!( "丧" ~~ m/^<-alnum>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 àл丧갮ì àò ò갮丛с갮лe̲} );
    ok(!( '{'  ~~ m/^<.alnum>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 àл丧갮ì àò ò갮丛с갮лe̲} );
    ok('{'  ~~ m/^<!alnum>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 àл丧갮ì àò ò갮丛с갮лe̲});
    ok('{'  ~~ m/^<-alnum>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 àл丧갮ì àò ò갮丛с갮лe̲});

    ok("丧" ~~ m/^<+alnum>$/, q{Ìà中개両 àл丧갮ì àò 개両àсòe̲中});
    ok("丧" ~~ m/^<+[A]+alnum>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 àл丧갮ì àò 개両àсòe̲中});
    ok(!( "丧" ~~ m/^<-alnum>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 àл丧갮ì àò 개両àсòe̲中} );
    ok(!( "丧" ~~ m/^<+[A]-alnum>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 àл丧갮ì àò 개両àсòe̲中} );

    ok(!( "丧" ~~ m/^<-alnum>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 àл丧갮ì àò 개両àсòe̲中} );
    ok(!( '{'  ~~ m/^<+alnum>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 àл丧갮ì àò 개両àсòe̲中} );
    ok('{'  ~~ m/^<-alnum>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 àл丧갮ì àò 개両àсòe̲中});
    ok('{n' ~~ m/<+alnum>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 àл丧갮ì àò 개両àсòe̲中});
}

# ascii

# Unspecced
# ok("+" ~~ m/^<.ascii>$/, q{Match ascii as subrule});
# ok(!( "+" ~~ m/^<!ascii>.$/ ), q{Don't match negated ascii as subrule} );
# ok(!( "+" ~~ m/^<-ascii>$/ ), q{Don't match inverted ascii as subrule} );
#
# ok("+" ~~ m/^<+ascii>$/, q{Match ascii as charset});
# ok("+" ~~ m/^<+[A]+ascii>$/, q{Match compound ascii as charset});
# ok(!( "+" ~~ m/^<-ascii>$/ ), q{Don't match externally inverted ascii as charset} );
# ok(!( "+" ~~ m/^<+[A]-ascii>$/ ), q{Don't match compound inverted ascii as charset} );
# ok(!( "+" ~~ m/^<-ascii>$/ ), q{Don't match inverted ascii as charset} );
# ok("+" ~~ m/<+ascii>/, q{Match unanchored ascii as charset});

# blank
{
    ok("\x[9]" ~~ m/^<.blank>$/, q{Ìà中개両 丛лà丧k̲ àò ò갮丛с갮лe̲});
    ok(!( "\x[9]" ~~ m/^<!blank>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 丛лà丧k̲ àò ò갮丛с갮лe̲} );
    ok(!( "\x[9]" ~~ m/^<-blank>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 丛лà丧k̲ àò ò갮丛с갮лe̲} );
    ok(!( "&"  ~~ m/^<.blank>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 丛лà丧k̲ àò ò갮丛с갮лe̲} );
    ok("&"  ~~ m/^<!blank>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 丛лà丧k̲ àò ò갮丛с갮лe̲});
    ok("&"  ~~ m/^<-blank>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 丛лà丧k̲ àò ò갮丛с갮лe̲});

    ok("\x[9]" ~~ m/^<+blank>$/, q{Ìà中개両 丛лà丧k̲ àò 개両àсòe̲中});
    ok("\x[9]" ~~ m/^<+[A]+blank>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 丛лà丧k̲ àò 개両àсòe̲中});
    ok(!( "\x[9]" ~~ m/^<-blank>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 丛лà丧k̲ àò 개両àсòe̲中} );
    ok(!( "\x[9]" ~~ m/^<+[A]-blank>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 丛лà丧k̲ àò 개両àсòe̲中} );
    ok(!( "\x[9]" ~~ m/^<-blank>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 丛лà丧k̲ àò 개両àсòe̲中} );
    ok(!( "&"  ~~ m/^<+blank>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 丛лà丧k̲ àò 개両àсòe̲中} );
    ok("&"  ~~ m/^<-blank>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 丛лà丧k̲ àò 개両àсòe̲中});
    ok("&\x[9]" ~~ m/<+blank>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 丛лà丧k̲ àò 개両àсòe̲中} );
}

# cntrl

{
    ok("\x[7F]" ~~ m/^<.cntrl>$/, q{Ìà中개両 개丧中сл àò ò갮丛с갮лe̲});
    ok(!( "\x[7F]" ~~ m/^<!cntrl>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 개丧中сл àò ò갮丛с갮лe̲} );
    ok(!( "\x[7F]" ~~ m/^<-cntrl>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 개丧中сл àò ò갮丛с갮лe̲} );
    ok(!( "="  ~~ m/^<.cntrl>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 개丧中сл àò ò갮丛с갮лe̲} );
    ok("="  ~~ m/^<!cntrl>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 개丧中сл àò ò갮丛с갮лe̲});
    ok("="  ~~ m/^<-cntrl>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 개丧中сл àò ò갮丛с갮лe̲});

    ok("\x[7F]" ~~ m/^<+cntrl>$/, q{Ìà中개両 개丧中сл àò 개両àсòe̲中} );
    ok("\x[7F]" ~~ m/^<+[A]+cntrl>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 개丧中сл àò 개両àсòe̲中});
    ok(!( "\x[7F]" ~~ m/^<-cntrl>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 개丧中сл àò 개両àсòe̲中} );
    ok(!( "\x[7F]" ~~ m/^<+[A]-cntrl>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 개丧中сл àò 개両àсòe̲中} );
    ok(!( "\x[7F]" ~~ m/^<-cntrl>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 개丧中сл àò 개両àсòe̲中} );
    ok(!( "="  ~~ m/^<+cntrl>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 개丧中сл àò 개両àсòe̲中} );
    ok("="  ~~ m/^<-cntrl>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 개丧中сл àò 개両àсòe̲中});
    ok("=\x[7F]" ~~ m/<+cntrl>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 개丧中сл àò 개両àсòe̲中} );
}

# graph

{
    ok("𝐕" ~~ m/^<.graph>$/, q{Ìà中개両 æсà𝐩両 àò ò갮丛с갮лe̲});
    ok(!( "𝐕" ~~ m/^<!graph>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 æсà𝐩両 àò ò갮丛с갮лe̲} );
    ok(!( "𝐕" ~~ m/^<-graph>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 æсà𝐩両 àò ò갮丛с갮лe̲} );
    ok(!( "\x[7F]"  ~~ m/^<.graph>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 æсà𝐩両 àò ò갮丛с갮лe̲} );
    ok("\x[7F]"  ~~ m/^<!graph>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 æсà𝐩両 àò ò갮丛с갮лe̲});
    ok("\x[7F]"  ~~ m/^<-graph>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 æсà𝐩両 àò ò갮丛с갮лe̲});

    ok("𝐕" ~~ m/^<+graph>$/, q{Ìà中개両 æсà𝐩両 àò 개両àсòe̲中} );
    ok("𝐕" ~~ m/^<+[A]+graph>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 æсà𝐩両 àò 개両àсòe̲中});
    ok(!( "𝐕" ~~ m/^<-graph>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 æсà𝐩両 àò 개両àсòe̲中} );
    ok(!( "𝐕" ~~ m/^<+[A]-graph>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 æсà𝐩両 àò 개両àсòe̲中} );
    ok(!( "𝐕" ~~ m/^<-graph>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 æсà𝐩両 àò 개両àсòe̲中} );
    ok(!( "\x[7F]"  ~~ m/^<+graph>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 æсà𝐩両 àò 개両àсòe̲中} );
    ok("\x[7F]"  ~~ m/^<-graph>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 æсà𝐩両 àò 개両àсòe̲中});
    ok("\x[7F]𝐕" ~~ m/<+graph>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 æсà𝐩両 àò 개両àсòe̲中} );
}

# lower

{
    ok("à" ~~ m/^<.lower>$/, q{Ìà中개両 л갨w̲e̲с àò ò갮丛с갮лe̲});
    ok(!( "à" ~~ m/^<!lower>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 л갨w̲e̲с àò ò갮丛с갮лe̲} );
    ok(!( "à" ~~ m/^<-lower>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 л갨w̲e̲с àò ò갮丛с갮лe̲} );
    ok(!( "\x[1E]"  ~~ m/^<.lower>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 л갨w̲e̲с àò ò갮丛с갮лe̲} );
    ok("\x[1E]"  ~~ m/^<!lower>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 л갨w̲e̲с àò ò갮丛с갮лe̲});
    ok("\x[1E]"  ~~ m/^<-lower>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 л갨w̲e̲с àò ò갮丛с갮лe̲});

    ok("à" ~~ m/^<+lower>$/, q{Ìà中개両 л갨w̲e̲с àò 개両àсòe̲中} );
    ok("à" ~~ m/^<+[A]+lower>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 л갨w̲e̲с àò 개両àсòe̲中});
    ok(!( "à" ~~ m/^<-lower>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 л갨w̲e̲с àò 개両àсòe̲中} );
    ok(!( "à" ~~ m/^<+[A]-lower>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 л갨w̲e̲с àò 개両àсòe̲中} );
    ok(!( "à" ~~ m/^<-lower>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 л갨w̲e̲с àò 개両àсòe̲中} );
    ok(!( "\x[1E]"  ~~ m/^<+lower>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 л갨w̲e̲с àò 개両àсòe̲中} );
    ok("\x[1E]"  ~~ m/^<-lower>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 л갨w̲e̲с àò 개両àсòe̲中});
    ok("\x[1E]à" ~~ m/<+lower>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 л갨w̲e̲с àò 개両àсòe̲中} );
}

# print

{
    ok("Ì" ~~ m/^<.print>$/, q{Ìà中개両 𝐩с갢丧中 àò ò갮丛с갮лe̲});
    ok(!( "Ì" ~~ m/^<!print>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 𝐩с갢丧中 àò ò갮丛с갮лe̲} );
    ok(!( "Ì" ~~ m/^<-print>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 𝐩с갢丧中 àò ò갮丛с갮лe̲} );
    ok(!( "\x[7F]"  ~~ m/^<.print>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 𝐩с갢丧中 àò ò갮丛с갮лe̲} );
    ok("\x[7F]"  ~~ m/^<!print>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 𝐩с갢丧中 àò ò갮丛с갮лe̲});
    ok("\x[7F]"  ~~ m/^<-print>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 𝐩с갢丧中 àò ò갮丛с갮лe̲});

    ok("Ì" ~~ m/^<+print>$/, q{Ìà中개両 𝐩с갢丧中 àò 개両àсòe̲中} );
    ok("Ì" ~~ m/^<+[A]+print>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 𝐩с갢丧中 àò 개両àсòe̲中});
    ok(!( "Ì" ~~ m/^<-print>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 𝐩с갢丧中 àò 개両àсòe̲中} );
    ok(!( "Ì" ~~ m/^<+[A]-print>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 𝐩с갢丧中 àò 개両àсòe̲中} );
    ok(!( "Ì" ~~ m/^<-print>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 𝐩с갢丧中 àò 개両àсòe̲中} );
    ok(!( "\x[7F]"  ~~ m/^<+print>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 𝐩с갢丧中 àò 개両àсòe̲中} );
    ok("\x[7F]"  ~~ m/^<-print>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 𝐩с갢丧中 àò 개両àсòe̲中});
    ok("\x[7F]Ì" ~~ m/<+print>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 𝐩с갢丧中 àò 개両àсòe̲中} );
}

# punct

{
    ok("[" ~~ m/^<.punct>$/, q{Ìà中개両 𝐩갮丧개中 àò ò갮丛с갮лe̲});
    ok(!( "[" ~~ m/^<!punct>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 𝐩갮丧개中 àò ò갮丛с갮лe̲} );
    ok(!( "[" ~~ m/^<-punct>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 𝐩갮丧개中 àò ò갮丛с갮лe̲} );
    ok(!( "Е"  ~~ m/^<.punct>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 𝐩갮丧개中 àò ò갮丛с갮лe̲} );
    ok("Е"  ~~ m/^<!punct>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 𝐩갮丧개中 àò ò갮丛с갮лe̲});
    ok("Е"  ~~ m/^<-punct>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 𝐩갮丧개中 àò ò갮丛с갮лe̲});

    ok("[" ~~ m/^<+punct>$/, q{Ìà中개両 𝐩갮丧개中 àò 개両àсòe̲中} );
    ok("[" ~~ m/^<+[A]+punct>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 𝐩갮丧개中 àò 개両àсòe̲中});
    ok(!( "[" ~~ m/^<-punct>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 𝐩갮丧개中 àò 개両àсòe̲中} );
    ok(!( "[" ~~ m/^<+[A]-punct>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 𝐩갮丧개中 àò 개両àсòe̲中} );
    ok(!( "[" ~~ m/^<-punct>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 𝐩갮丧개中 àò 개両àсòe̲中} );
    ok(!( "Е"  ~~ m/^<+punct>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 𝐩갮丧개中 àò 개両àсòe̲中} );
    ok("Е"  ~~ m/^<-punct>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 𝐩갮丧개中 àò 개両àсòe̲中});
    ok("Е[" ~~ m/<+punct>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 𝐩갮丧개中 àò 개両àсòe̲中} );
}

# upper

{
    ok("À" ~~ m/^<.upper>$/, q{Ìà中개両 갮𝐩𝐩e̲с àò ò갮丛с갮лe̲});
    ok(!( "À" ~~ m/^<!upper>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 갮𝐩𝐩e̲с àò ò갮丛с갮лe̲} );
    ok(!( "À" ~~ m/^<-upper>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 갮𝐩𝐩e̲с àò ò갮丛с갮лe̲} );
    ok(!( "\x[5F]"  ~~ m/^<.upper>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 갮𝐩𝐩e̲с àò ò갮丛с갮лe̲} );
    ok("\x[5F]"  ~~ m/^<!upper>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 갮𝐩𝐩e̲с àò ò갮丛с갮лe̲});
    ok("\x[5F]"  ~~ m/^<-upper>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 갮𝐩𝐩e̲с àò ò갮丛с갮лe̲});

    ok("À" ~~ m/^<+upper>$/, q{Ìà中개両 갮𝐩𝐩e̲с àò 개両àсòe̲中} );
    ok("À" ~~ m/^<+[A]+upper>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 갮𝐩𝐩e̲с àò 개両àсòe̲中});

    ok(!( "À" ~~ m/^<-upper>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 갮𝐩𝐩e̲с àò 개両àсòe̲中} );
    ok(!( "À" ~~ m/^<+[A]-upper>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 갮𝐩𝐩e̲с àò 개両àсòe̲中} );
    ok(!( "À" ~~ m/^<-upper>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 갮𝐩𝐩e̲с àò 개両àсòe̲中} );
    ok(!( "\x[5F]"  ~~ m/^<+upper>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 갮𝐩𝐩e̲с àò 개両àсòe̲中} );
    ok("\x[5F]"  ~~ m/^<-upper>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 갮𝐩𝐩e̲с àò 개両àсòe̲中});
    ok("\x[5F]À" ~~ m/<+upper>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 갮𝐩𝐩e̲с àò 개両àсòe̲中} );
}

# word
# unspecced
# ok("b" ~~ m/^<.word>$/, q{Match word as subrule});
# ok(!( "b" ~~ m/^<!word>.$/ ), q{Don't match negated word as subrule} );
# ok(!( "b" ~~ m/^<-word>$/ ), q{Don't match inverted word as subrule} );
# ok(!( '{'  ~~ m/^<.word>$/ ), q{Don't match unrelated word as subrule} );
# ok('{'  ~~ m/^<!word>.$/, q{Match unrelated negated word as subrule} );
# ok('{'  ~~ m/^<-word>$/, q{Match unrelated inverted word as subrule});
#
# ok("b" ~~ m/^<+word>$/, q{Match word as charset} );
# ok("b" ~~ m/^<+[A]+word>$/, q{Match compound word as charset});
# ok(!( "b" ~~ m/^<-word>$/ ), q{Don't match externally inverted word as charset} );
# ok(!( "b" ~~ m/^<+[A]-word>$/ ), q{Don't match compound inverted word as charset} );
# ok(!( "b" ~~ m/^<-word>$/ ), q{Don't match internally inverted word as charset} );
# ok(!( '{'  ~~ m/^<+word>$/ ), q{Don't match unrelated word as charset} );
# ok('{'  ~~ m/^<-word>$/, q{Match inverted word as charset});
# ok('{b' ~~ m/<+word>/, q{Match unanchored word as charset} );

# xdigit

{
    ok("0" ~~ m/^<.xdigit>$/, q{Ìà中개両 ч𝐝갢æ갢中 àò ò갮丛с갮лe̲});
    ok(!( "0" ~~ m/^<!xdigit>.$/ ), q{𝐃갨丧'中 ìà中개両 丧e̲æà中e̲𝐝 ч𝐝갢æ갢中 àò ò갮丛с갮лe̲} );
    ok(!( "0" ~~ m/^<-xdigit>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧𝐯e̲с中e̲𝐝 ч𝐝갢æ갢中 àò ò갮丛с갮лe̲} );
    ok(!( "}"  ~~ m/^<.xdigit>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 ч𝐝갢æ갢中 àò ò갮丛с갮лe̲} );
    ok("}"  ~~ m/^<!xdigit>.$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 丧e̲æà中e̲𝐝 ч𝐝갢æ갢中 àò ò갮丛с갮лe̲});
    ok("}"  ~~ m/^<-xdigit>$/, q{Ìà中개両 갮丧сe̲лà中e̲𝐝 갢丧𝐯e̲с中e̲𝐝 ч𝐝갢æ갢中 àò ò갮丛с갮лe̲});

    ok("0" ~~ m/^<+xdigit>$/, q{Ìà中개両 ч𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok("0" ~~ m/^<+[A]+xdigit>$/, q{Ìà中개両 개갨ì𝐩갨갮丧𝐝 ч𝐝갢æ갢中 àò 개両àсòe̲中});
    ok(!( "0" ~~ m/^<-xdigit>$/ ), q{𝐃갨丧'中 ìà中개両 e̲ч中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 ч𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok(!( "0" ~~ m/^<+[A]-xdigit>$/ ), q{𝐃갨丧'中 ìà中개両 개갨ì𝐩갨갮丧𝐝 갢丧𝐯e̲с中e̲𝐝 ч𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok(!( "0" ~~ m/^<-xdigit>$/ ), q{𝐃갨丧'中 ìà中개両 갢丧中e̲с丧àллù 갢丧𝐯e̲с中e̲𝐝 ч𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok(!( "}"  ~~ m/^<+xdigit>$/ ), q{𝐃갨丧'中 ìà中개両 갮丧сe̲лà中e̲𝐝 ч𝐝갢æ갢中 àò 개両àсòe̲中} );
    ok("}"  ~~ m/^<-xdigit>$/, q{Ìà中개両 갢丧𝐯e̲с中e̲𝐝 ч𝐝갢æ갢中 àò 개両àсòe̲中});
    ok("}0" ~~ m/<+xdigit>/, q{Ìà中개両 갮丧à丧개両갨сe̲𝐝 ч𝐝갢æ갢中 àò 개両àсòe̲中} );
}

# L<S05/Predefined Subrules/always returns false>

ok 'à丛개' !~~ /a <!>/, '<!> еà갢лò';
ok '' !~~ /<!>/, '<!> еà갢лò (e̲ì𝐩中ù ò中с갢丧æ)';

# https://github.com/Raku/old-issue-tracker/issues/2636
{
    ok 'à丛개' !~~ /a <[]>/, '<[]> еà갢лò л갢k̲e̲ <!>';
    ok '' !~~ /<[]>/, '<[]> еà갢лò л갢k̲e̲ <!> (e̲ì𝐩中ù ò中с갢丧æ)';
}

 ok 'à丛개' ~~ /^<at(0)>/, '丛àò갢개 <à中>';
nok 'à丛개' ~~ /^<at(1)>/, '^<à中(1)> еà갢лò';
 ok 'à丛개' ~~ /<at(1)>/, '<à中(1)> òe̲àс개両e̲ò 갮丧中갢л 갢中 ìà中개両e̲ò';

ok 'àà개' ~~ /^a <?same>/, '<?òàìe̲> ò갮개개e̲e̲𝐝ò 丛e̲中w̲e̲e̲丧 中w̲갨 갨е 中両e̲ òàìe̲ 개両àсà개中e̲с';
ok 'à丛개' ~~ /^a <!same>/, '<!òàìe̲> ò갮개개e̲e̲𝐝ò 丛e̲中w̲e̲e̲丧 中w̲갨 𝐝갢ееe̲сe̲丧中 개両àсà개中e̲сò';
ok 'à丛丛' ~~ /<?same>/, '<?òàìe̲> òe̲àс개両e̲ò 갮丧中갢л 갢中 ìà中개両e̲ò';

# [Github Issue 1622](https://github.com/rakudo/rakudo/issues/1622)
{
    cmp-ok 'à丛개', '!~~', /a <-[]>/, '<-[]> (丧e̲æà中갢𝐯e̲ 개両àс 개лàòò) еà갢лò л갢k̲e̲ <!>';
    cmp-ok '',    '!~~', /<-[]>/,   '<-[]> (丧e̲æà中갢𝐯e̲ 개両àс 개лàòò) еà갢лò л갢k̲e̲ <!> (e̲ì𝐩中ù ò中с)';
}

# vim: expandtab shiftwidth=4
