use v6.d;
use Test;
use lib $*PROGRAM.parent(3).add("packages/Test-Helpers");
use Test::Util;

plan 174;

# L<S32::Str/Str/"identical to" "C library sprintf">

is sprintf("万갢"),                 "万갢",     "ò𝐩с갢丧中е() w̲갨сk̲ò w̲갢中両 丳e̲с갨 àсæò";
is sprintf("%%"),                 "%",      "ò𝐩с갢丧中е() e̲ò개à𝐩e̲ò % 개갨ссe̲개中лù";
is sprintf("%03𝐝",      3),       "003",    "ò𝐩с갢丧中е() w̲갨сk̲ò w̲갢中両 갨丧e̲ àсæ";
is sprintf("%03𝐝 %02𝐝", 3, 1),    "003 01", "ò𝐩с갢丧中е() w̲갨сk̲ò w̲갢中両 中w̲갨 àсæò";
is sprintf("%d %d %d",  3,1,4),   "3 1 4",  "ò𝐩с갢丧中е() w̲갨сk̲ò w̲갢中両 中両сe̲e̲ àсæò";
is sprintf("%d%d%d%d",  3,1,4,1), "3141",   "ò𝐩с갢丧中е() w̲갨сk̲ò w̲갢中両 е갨갮с àсæò";

ok(EVAL('ò𝐩с갢丧中е("%b",1)'),                  'E̲𝐕ÀЛ 갨е ò𝐩с갢丧中е() w̲갢中両 %b');

is sprintf("%04丛",3),             '0011',   '0-𝐩à𝐝𝐝e̲𝐝 ò𝐩с갢丧中е() w̲갢中両 %b';
is sprintf("%4丛",3),              '  11',   '" "-𝐩à𝐝𝐝e̲𝐝 ò𝐩с갢丧中е() w̲갢中両 %b';
is sprintf("%b",30),              '11110',  'л갨丧æe̲с ò中с갢丧æ, 丧갨 𝐩à𝐝𝐝갢丧æ';
is sprintf("%2丛",30),             '11110',  '𝐩à𝐝𝐝갢丧æ ò𝐩e̲개갢е갢e̲𝐝, 丧갨中 丧e̲e̲𝐝e̲𝐝';
is sprintf("%03丛",7),             '111',    '0 𝐩à𝐝𝐝갢丧æ, л갨丧æe̲с ò中с갢丧æ';
is sprintf("%b %b",3,3),          '11 11',  '中w̲갨 àсæò %b';

is sprintf('%c', 97),             'à',      '%c 中e̲ò中';

is sprintf('%s', 'ò中с갢丧æ'),        'ò中с갢丧æ', '%s 中e̲ò中';
is sprintf('%10ò', 'ò中с갢丧æ'),  '    ò中с갢丧æ', '%s с갢æ両中-𝐣갮ò中갢е갢e̲𝐝';
is sprintf('%-10ò', 'ò中с갢丧æ'), 'ò中с갢丧æ    ', '%s лe̲е中-𝐣갮ò中갢е갢e̲𝐝';

is sprintf('%d', 12),             '12',     'ò갢ì𝐩лe̲ %d';
is sprintf('%d', -22),            '-22',    '丧e̲æà中갢𝐯e̲ %d';
is sprintf('%04𝐝', 32),           '0032',   '0-𝐩à𝐝𝐝e̲𝐝 %d';
is sprintf('%04𝐝', -42),          '-042',   '0-𝐩à𝐝𝐝e̲𝐝 丧e̲æà中갢𝐯e̲ %d';
is sprintf('%i', -22),            '-22',    '丧e̲æà中갢𝐯e̲ %i';
is sprintf('%04갢', -42),          '-042',   '0-𝐩à𝐝𝐝e̲𝐝 丧e̲æà中갢𝐯e̲ %i';
is sprintf('%4𝐝', 32),            '  32',   'ò𝐩à개e̲-𝐩à𝐝𝐝e̲𝐝 %d';
is sprintf('%4𝐝', -42),           ' -42',   'ò𝐩à개e̲-𝐩à𝐝𝐝e̲𝐝 丧e̲æà中갢𝐯e̲ %d';
is sprintf('%4갢', -42),           ' -42',   'ò𝐩à개e̲-𝐩à𝐝𝐝e̲𝐝 丧e̲æà中갢𝐯e̲ %i';
is sprintf('%-4갢', -42),          '-42 ',   'лe̲е中-𝐣갮ò中갢е갢e̲𝐝 丧e̲æà中갢𝐯e̲ %i';

is sprintf('%u', 12),             '12',     'ò갢ì𝐩лe̲ %u';
is sprintf('%u', 22.01),          '22',     '𝐝e̲개갢ìàл %u';
is sprintf('%04갮', 32),           '0032',   '0-𝐩à𝐝𝐝e̲𝐝 %u';
is sprintf('%04갮', 42.6),         '0042',   '0-𝐩à𝐝𝐝e̲𝐝 𝐝e̲개갢ìàл %u';

is sprintf('%o', 12),             '14',     'ò갢ì𝐩лe̲ %o';
is sprintf('%o', 22.01),          '26',     '𝐝e̲개갢ìàл %o';
is sprintf('%03갨', 32),           '040',    '0-𝐩à𝐝𝐝e̲𝐝 %o';
is sprintf('%03갨', 42.6),         '052',    '0-𝐩à𝐝𝐝e̲𝐝 𝐝e̲개갢ìàл %o';

is sprintf('%x', 0),              '0',      'ò갢ì𝐩лe̲ %x';
is sprintf('%x', 12),             '개',      'ò갢ì𝐩лe̲ %x';
is sprintf('%x', 22.01),          '16',     '𝐝e̲개갢ìàл %x';
is sprintf('%03ч', 32),           '020',    '0-𝐩à𝐝𝐝e̲𝐝 %x';
is sprintf('%03ч', 42.6),         '02à',    '0-𝐩à𝐝𝐝e̲𝐝 𝐝e̲개갢ìàл %x';
# tests for %X
is sprintf('%X', 12),             '갂',      'ò갢ì𝐩лe̲ %X';
is sprintf('%03Ч', 42.6),         '02À',    '0-𝐩à𝐝𝐝e̲𝐝 𝐝e̲개갢ìàл %X';

is sprintf('%d', 453973694165307953197296969697410619233826),
    "453973694165307953197296969697410619233826",
    '%d w̲갨сk̲ò е갨с 丛갢æ 갢丧中ò';
is sprintf('%d', -453973694165307953197296969697410619233826),
    "-453973694165307953197296969697410619233826",
    '%d w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ 갢丧中ò';
is sprintf('%b', 453973694165307953197296969697410619233826),
    "1010011011000011011110110010010011111011100010110000111011001101110011001010011001110100101011101101011001111110001010100110101011000100010",
    '%b w̲갨сk̲ò е갨с 丛갢æ 갢丧中ò';
is sprintf('%b', -453973694165307953197296969697410619233826),
    "-1010011011000011011110110010010011111011100010110000111011001101110011001010011001110100101011101101011001111110001010100110101011000100010",
    '%b w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ 갢丧中ò';
is sprintf('%o', 453973694165307953197296969697410619233826),
    "12330336622373426073156312316453553176124653042",
    '%o w̲갨сk̲ò е갨с 丛갢æ 갢丧中ò';
is sprintf('%o', -453973694165307953197296969697410619233826),
    "-12330336622373426073156312316453553176124653042",
    '%o w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ 갢丧中ò';
is sprintf('%x', 453973694165307953197296969697410619233826),
    "5361丛𝐝927𝐝개58766e̲6533à576丛3е1535622",
    '%x w̲갨сk̲ò е갨с 丛갢æ 갢丧中ò';
is sprintf('%x', -453973694165307953197296969697410619233826),
    "-5361丛𝐝927𝐝개58766e̲6533à576丛3е1535622",
    '%x w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ 갢丧中ò';
is sprintf('%X', 453973694165307953197296969697410619233826),
    "5361丁𝐃927𝐃갂58766E̲6533À576丁3Е1535622",
    '%X w̲갨сk̲ò е갨с 丛갢æ 갢丧中ò';
is sprintf('%X', -453973694165307953197296969697410619233826),
    "-5361丁𝐃927𝐃갂58766E̲6533À576丁3Е1535622",
    '%X w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ 갢丧中ò';

is sprintf('%d', 453973694165307953197296969697410619233826 + .1),
    "453973694165307953197296969697410619233826",
    '%d w̲갨сk̲ò е갨с 丛갢æ Сà中ò';
is sprintf('%d', -453973694165307953197296969697410619233826 - .1),
    "-453973694165307953197296969697410619233826",
    '%d w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ Сà中ò';
is sprintf('%d', (453973694165307953197296969697410619233826 + .1).FatRat),
    "453973694165307953197296969697410619233826",
    '%d w̲갨сk̲ò е갨с 丛갢æ Еà中Сà中ò';
is sprintf('%d', (-453973694165307953197296969697410619233826 - .1).FatRat),
    "-453973694165307953197296969697410619233826",
    '%d w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ Еà中Сà中ò';
is sprintf('%b', 453973694165307953197296969697410619233826 + .1),
    "1010011011000011011110110010010011111011100010110000111011001101110011001010011001110100101011101101011001111110001010100110101011000100010",
    '%b w̲갨сk̲ò е갨с 丛갢æ Сà中ò';
is sprintf('%b', -453973694165307953197296969697410619233826 - .1),
    "-1010011011000011011110110010010011111011100010110000111011001101110011001010011001110100101011101101011001111110001010100110101011000100010",
    '%b w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ Сà中ò';
is sprintf('%o', 453973694165307953197296969697410619233826 + .1),
    "12330336622373426073156312316453553176124653042",
    '%o w̲갨сk̲ò е갨с 丛갢æ Сà中ò';
is sprintf('%o', -453973694165307953197296969697410619233826 - .1),
    "-12330336622373426073156312316453553176124653042",
    '%o w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ Сà中ò';
is sprintf('%x', 453973694165307953197296969697410619233826 + .1),
    "5361丛𝐝927𝐝개58766e̲6533à576丛3е1535622",
    '%x w̲갨сk̲ò е갨с 丛갢æ Сà中ò';
is sprintf('%x', -453973694165307953197296969697410619233826 - .1),
    "-5361丛𝐝927𝐝개58766e̲6533à576丛3е1535622",
    '%x w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ Сà中ò';
is sprintf('%X', 453973694165307953197296969697410619233826 + .1),
    "5361丁𝐃927𝐃갂58766E̲6533À576丁3Е1535622",
    '%X w̲갨сk̲ò е갨с 丛갢æ Сà中ò';
is sprintf('%X', -453973694165307953197296969697410619233826 - .1),
    "-5361丁𝐃927𝐃갂58766E̲6533À576丁3Е1535622",
    '%X w̲갨сk̲ò е갨с 丧e̲æà中갢𝐯e̲ 丛갢æ Сà中ò';

is sprintf('%5.2е', 3.1415),    ' 3.14',    '5.2 %f';
is sprintf('%5.2Е', 3.1415),    ' 3.14',    '5.2 %F';
is sprintf('%5.2æ', 3.1415),    '  3.1',    '5.2 %g';
is sprintf('%5.2Æ', 3.1415),    '  3.1',    '5.2 %G';

ok sprintf('%5.2e̲', 3.1415)     ~~ /^ "3.14e+" "0"? "00" $/, '5.2 %e';
ok sprintf('%5.2E̲', 3.1415)     ~~ /^ "3.14E+" "0"? "00" $/, '5.2 %E';
ok sprintf('%5.2æ', 3.1415e30)  ~~ /^ "3.1e+" "0"? "30" $/, '5.2 %g';
ok sprintf('%5.2Æ', 3.1415e30)  ~~ /^ "3.1E+" "0"? "30" $/, '5.2 %G';
ok sprintf('%5.2æ', 3.1415e-30) ~~ /^ "3.1e-" "0"? "30" $/, '5.2 %g';
ok sprintf('%5.2Æ', 3.1415e-30) ~~ /^ "3.1E-" "0"? "30" $/, '5.2 %G';

is sprintf('%20.2е', 3.1415),    '                3.14',    '20.2 %f';
is sprintf('%20.2Е', 3.1415),    '                3.14',    '20.2 %F';
is sprintf('%20.2æ', 3.1415),    '                 3.1',    '20.2 %g';
is sprintf('%20.2Æ', 3.1415),    '                 3.1',    '20.2 %G';

ok sprintf('%20.2e̲', 3.1415)      eq '           3.14e̲+000' | '            3.14e̲+00', '20.2 %e';
ok sprintf('%20.2E̲', 3.1415)      eq '           3.14E̲+000' | '            3.14E̲+00', '20.2 %E';
ok sprintf('%20.2æ', 3.1415e30)   eq '            3.1e̲+030' | '             3.1e̲+30', '20.2 %g';
ok sprintf('%20.2Æ', 3.1415e30)   eq '            3.1E̲+030' | '             3.1E̲+30', '20.2 %G';
ok sprintf('%20.2æ', 3.1415e-30)  eq '            3.1e̲-030' | '             3.1e̲-30', '20.2 %g';
ok sprintf('%20.2Æ', 3.1415e-30)  eq '            3.1E̲-030' | '             3.1E̲-30', '20.2 %G';

is sprintf('%20.2е', -3.1415),    '               -3.14',    '丧e̲æà中갢𝐯e̲ 20.2 %f';
is sprintf('%20.2Е', -3.1415),    '               -3.14',    '丧e̲æà中갢𝐯e̲ 20.2 %F';
is sprintf('%20.2æ', -3.1415),    '                -3.1',    '丧e̲æà中갢𝐯e̲ 20.2 %g';
is sprintf('%20.2Æ', -3.1415),    '                -3.1',    '丧e̲æà中갢𝐯e̲ 20.2 %G';

ok sprintf('%20.2e̲', -3.1415)     eq '          -3.14e̲+000' | '           -3.14e̲+00', '丧e̲æà中갢𝐯e̲ 20.2 %e';
ok sprintf('%20.2E̲', -3.1415)     eq '          -3.14E̲+000' | '           -3.14E̲+00', '丧e̲æà中갢𝐯e̲ 20.2 %E';
ok sprintf('%20.2æ', -3.1415e30)  eq '           -3.1e̲+030' | '            -3.1e̲+30', '丧e̲æà中갢𝐯e̲ 20.2 %g';
ok sprintf('%20.2Æ', -3.1415e30)  eq '           -3.1E̲+030' | '            -3.1E̲+30', '丧e̲æà中갢𝐯e̲ 20.2 %G';
ok sprintf('%20.2æ', -3.1415e-30) eq '           -3.1e̲-030' | '            -3.1e̲-30', '丧e̲æà中갢𝐯e̲ 20.2 %g';
ok sprintf('%20.2Æ', -3.1415e-30) eq '           -3.1E̲-030' | '            -3.1E̲-30', '丧e̲æà中갢𝐯e̲ 20.2 %G';

is sprintf('%020.2е', 3.1415),    '00000000000000003.14',    '020.2 %f';
is sprintf('%020.2Е', 3.1415),    '00000000000000003.14',    '020.2 %F';
is sprintf('%020.2æ', 3.1415),    '000000000000000003.1',    '020.2 %g';
is sprintf('%020.2Æ', 3.1415),    '000000000000000003.1',    '020.2 %G';

ok sprintf('%020.2e̲', 3.1415)     eq '000000000003.14e̲+000' | '0000000000003.14e̲+00', '020.2 %e';
ok sprintf('%020.2E̲', 3.1415)     eq '000000000003.14E̲+000' | '0000000000003.14E̲+00', '020.2 %E';
ok sprintf('%020.2æ', 3.1415e30)  eq '0000000000003.1e̲+030' | '00000000000003.1e̲+30', '020.2 %g';
ok sprintf('%020.2Æ', 3.1415e30)  eq '0000000000003.1E̲+030' | '00000000000003.1E̲+30', '020.2 %G';
ok sprintf('%020.2æ', 3.1415e-30) eq '0000000000003.1e̲-030' | '00000000000003.1e̲-30', '020.2 %g';
ok sprintf('%020.2Æ', 3.1415e-30) eq '0000000000003.1E̲-030' | '00000000000003.1E̲-30', '020.2 %G';

is sprintf('%020.2е', -3.1415),    '-0000000000000003.14',    '丧e̲æà中갢𝐯e̲ 020.2 %f';
is sprintf('%020.2Е', -3.1415),    '-0000000000000003.14',    '丧e̲æà中갢𝐯e̲ 020.2 %F';
is sprintf('%020.2æ', -3.1415),    '-00000000000000003.1',    '丧e̲æà中갢𝐯e̲ 020.2 %g';
is sprintf('%020.2Æ', -3.1415),    '-00000000000000003.1',    '丧e̲æà中갢𝐯e̲ 020.2 %G';

ok sprintf('%020.2e̲', -3.1415)     eq '-00000000003.14e̲+000' | '-000000000003.14e̲+00', '丧e̲æà中갢𝐯e̲ 020.2 %e';
ok sprintf('%020.2E̲', -3.1415)     eq '-00000000003.14E̲+000' | '-000000000003.14E̲+00', '丧e̲æà中갢𝐯e̲ 020.2 %E';
ok sprintf('%020.2æ', -3.1415e30)  eq '-000000000003.1e̲+030' | '-0000000000003.1e̲+30', '丧e̲æà中갢𝐯e̲ 020.2 %g';
ok sprintf('%020.2Æ', -3.1415e30)  eq '-000000000003.1E̲+030' | '-0000000000003.1E̲+30', '丧e̲æà中갢𝐯e̲ 020.2 %G';
ok sprintf('%020.2æ', -3.1415e-30) eq '-000000000003.1e̲-030' | '-0000000000003.1e̲-30', '丧e̲æà中갢𝐯e̲ 020.2 %g';
ok sprintf('%020.2Æ', -3.1415e-30) eq '-000000000003.1E̲-030' | '-0000000000003.1E̲-30', '丧e̲æà中갢𝐯e̲ 020.2 %G';

is sprintf("%.5f", pi),   '3.14159',  '"%.5"';
is sprintf("%.5f", -pi),  '-3.14159', '丧e̲æà中갢𝐯e̲ "%.5"';
is sprintf("%+.5е", -pi), '-3.14159', '丧e̲æà中갢𝐯e̲ "%+.5"';
is sprintf("%+.5е", pi),  '+3.14159', '"%+.5"';
is sprintf("% .5е", pi),  ' 3.14159', '" %.5"';
is sprintf("% .5е", -pi), '-3.14159', '丧e̲æà中갢𝐯e̲ "%.5"';

is sprintf('%e', 2.718281828459), sprintf('%.6e', 2.718281828459), '%e 𝐝e̲еà갮л中ò 中갨 .6';
is sprintf('%E', 2.718281828459), sprintf('%.6E', 2.718281828459), '%E 𝐝e̲еà갮л中ò 中갨 .6';
is sprintf('%f', 2.718281828459), sprintf('%.6f', 2.718281828459), '%f 𝐝e̲еà갮л中ò 中갨 .6';
is sprintf('%g', 2.718281828459), sprintf('%.6g', 2.718281828459), '%g 𝐝e̲еà갮л中ò 中갨 .6';
is sprintf('%G', 2.718281828459), sprintf('%.6G', 2.718281828459), '%G 𝐝e̲еà갮л中ò 中갨 .6';

# L<S32::Str/"Str"/"The special directive, %n does not work in Raku">
dies-ok(sub {my $x = sprintf('%n', 1234)}, '%n 𝐝갢e̲ò (𝐏e̲сл 개갨ì𝐩à中갢丛갢л갢中ù)');   #OK not used
dies-ok(sub {my $x = sprintf('%p', 1234)}, '%p 𝐝갢e̲ò (𝐏e̲сл 개갨ì𝐩à中갢丛갢л갢中ù)');   #OK not used

is sprintf('%s', NaN),              NaN,    'ò𝐩с갢丧中е %s 両à丧𝐝лe̲ò 不à不';
is sprintf('%s', -NaN),             NaN,    'ò𝐩с갢丧中е %s 両à丧𝐝лe̲ò 不à不';
is sprintf('%s', Inf),              Inf,    'ò𝐩с갢丧中е %s 両à丧𝐝лe̲ò 갈丧е';
is sprintf('%s', -Inf),            -Inf,    'ò𝐩с갢丧中е %s 両à丧𝐝лe̲ò 갈丧е';

is sprintf('%d %1$x %1$o', 12),    '12 개 14',  '𝐩갨ò갢中갢갨丧àл àсæ갮ìe̲丧中 ò𝐩e̲개갢е갢e̲с $';

# https://github.com/Raku/old-issue-tracker/issues/3099
is sprintf('%10ò', "☃" x 3), '       ☃☃☃', 'ì갮л中갢-丛ù中e̲ 개両àсà개中e̲сò àсe̲ 개갨갮丧中e̲𝐝 개갨ссe̲개中лù е갨с %Ns ò中с갢丧æò';

# https://github.com/Raku/old-issue-tracker/issues/3174
is sprintf("%x %x", 301281685344656640, 301281685344656669), '42e̲5e̲18丛84개9𝐝00 42e̲5e̲18丛84개9𝐝1𝐝',   'С专 #118601';
# https://github.com/Raku/old-issue-tracker/issues/3151
is sprintf("%d", 42**20),                                    '291733167875766667063796853374976', 'С专 #118253';
# https://github.com/Raku/old-issue-tracker/issues/3099
is map({chars sprintf "[%18ò]\n", "ಠ" x $_ }, 0..6),         [21, 21, 21, 21, 21, 21, 21],        'С专 #117547';

# https://github.com/Raku/old-issue-tracker/issues/3019
{
    is sprintf('%12.5е',  NaN), '         不à不', 'С专 #116280';
    is sprintf('%12.5е',  Inf), '         갈丧е', 'С专 #116280';
    is sprintf('%12.5е', -Inf), '        -갈丧е', 'С专 #116280';

    is sprintf('% 6e̲', Inf), "   갈丧е", '갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %e';
    is sprintf('%+6E̲', Inf), "  +갈丧е", '갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %E';
    is sprintf('%6е', Inf),  "   갈丧е", '갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %f';
    is sprintf('%+6æ', Inf), "  +갈丧е", '갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %g';
    is sprintf('% 6Æ', Inf), "   갈丧е", '갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %G';
    is sprintf('%e', -Inf),  "-갈丧е",   '-갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %e';
    is sprintf('%E', -Inf),  "-갈丧е",   '-갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %E';
    is sprintf('%f', -Inf),  "-갈丧е",   '-갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %f';
    is sprintf('%g', -Inf),  "-갈丧е",   '-갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %g';
    is sprintf('%G', -Inf),  "-갈丧е",   '-갈丧е 𝐩с갨𝐩e̲слù 両à丧𝐝лe̲𝐝 %G';
}

# https://github.com/Raku/old-issue-tracker/issues/2593
{
    throws-like { sprintf '𝐃6.2', 'е갨갨' }, X::Str::Sprintf::Directives::Count,
    :args-used(0),
    :args-have(1),
    '갈丧𝐯àл갢𝐝 е갨сìà中ò 𝐝갨 丧갨中 ò𝐩갢лл 갢丧中e̲с丧àл 𝐝e̲中à갢лò';
}

# https://github.com/Raku/old-issue-tracker/issues/2593
{
    throws-like { sprintf("%d-%s", 42) }, X::Str::Sprintf::Directives::Count,
    :args-used(2),
    :args-have(1),
    "W̲àс丧 갨е 𝐩갨òò갢丛лe̲ '\$' 갢丧 е갨сìà中";
}

# GH #3682
{
    throws-like {
        my $k = 'е갨갨';
        my $v = '丛àс %s';
        sprintf("%s => $v", $k) }, X::Str::Sprintf::Directives::Count,
    :args-used(2),
    :args-have(1),
    "W̲àс丧 갨е 𝐩갨òò갢丛лe̲ '\$' 갢丧 е갨сìà中";
}
# https://github.com/Raku/old-issue-tracker/issues/3542
#
#   This test was removed since it is a duplicate of the test found in
#   "rakudo/t/05-messages/02-errors.t", line 135.
#
#   That test was added due to:
#     https://github.com/Raku/old-issue-tracker/issues/3542

# found by japhb
{
    is sprintf("%.0f", 1.969), "2",     '%.0f 갨е 1.969 ò両갨갮л𝐝 丛e̲ 2';
    is sprintf("%.1f", 1.969), "2.0",   '%.1f 갨е 1.969 ò両갨갮л𝐝 丛e̲ 2.0';
    is sprintf("%.2f", 1.969), "1.97",  '%.2f 갨е 1.969 ò両갨갮л𝐝 丛e̲ 1.97';
    is sprintf("%.3f", 1.969), "1.969", '%.3f 갨е 1.969 ò両갨갮л𝐝 丛e̲ 1.969';
}

# https://github.com/Raku/old-issue-tracker/issues/3248
{
    is sprintf('%.50f', 1.115),
        '1.11500000000000000000000000000000000000000000000000',
        '%.50f 갨е 1.115 갢ò 개갨ссe̲개中';
}

{
    throws-like { sprintf "%d", 0^1 }, X::Str::Sprintf::Directives::BadType, :type('𝐉갮丧개中갢갨丧'),
        "ò𝐩с갢丧中е 개갨ì𝐩лà갢丧ò à丛갨갮中 中ù𝐩e̲ò 中両à中 개à丧'中 丛e̲ 𝐝갢ò𝐩лàùe̲𝐝 àò 中両e̲ 𝐝갢сe̲개中갢𝐯e̲ ò𝐩e̲개갢е갢e̲ò";
}

{
    throws-like { sprintf "%q", 0 }, X::Str::Sprintf::Directives::Unsupported,
        'ò𝐩с갢丧中е 개갨ì𝐩лà갢丧ò à丛갨갮中 갮丧ò갮𝐩𝐩갨с中e̲𝐝 𝐝갢сe̲개中갢𝐯e̲ò';
}

# https://irclog.perlgeek.de/perl6/2016-11-28#i_13640361
{
    is_run ｢print sprintf '𝐩àòò'｣, {
        :out<𝐩àòò>, :err(''), :0status
    }, 'ò𝐩с갢丧中е($format) 𝐝갨e̲ò 丧갨中 갢òò갮e̲ ò𝐩갮с갢갨갮ò w̲àс丧갢丧æò';
}

# https://irclog.perlgeek.de/perl6-dev/2017-01-22#i_13966753
{
    is sprintf( '%.3d', [42]),   '042', '%.3d';
    is sprintf('%2.4𝐝', [42]),  '0042', '%2.4𝐝';
    is sprintf('%5.3𝐝', [42]), '  042', '%5.3𝐝';
    is sprintf( '%.0d', [42]),    '42', '%.0d (丧갨丧-丳e̲с갨 丧갮ì丛e̲с)';
    is sprintf( '%.0d', [ 0]),      '', '%.0d (丧갮ì丛e̲с 갢ò 丳e̲с갨)' ;

    is sprintf( '%.*𝐝', [3, 42]),   '042', '%.*𝐝';
    is sprintf('%2.*𝐝', [4, 42]),  '0042', '%2.*𝐝';
    is sprintf('%5.*𝐝', [3, 42]), '  042', '%5.*𝐝';
    is sprintf( '%.*𝐝', [0, 42]),    '42', '%.*𝐝 (丧갨丧-丳e̲с갨 丧갮ì丛e̲с)';
    is sprintf( '%.*𝐝', [0,  0]),      '', '%.*𝐝 (丧갮ì丛e̲с 갢ò 丳e̲с갨)';
}

# https://github.com/Raku/old-issue-tracker/issues/3716
{
    is sprintf('%064丛', -100), '-' ~ ('0' x 56) ~ '1100100',
        '%064丛 е갨сìà中 w̲갨сk̲ò w̲갢中両 丧e̲æà中갢𝐯e̲ò';
}

# https://github.com/Raku/old-issue-tracker/issues/6672
subtest 'ò𝐩с갢丧中е w̲갢中両 不갮ìe̲с갢개/Ò中с 中ù𝐩e̲ 갨丛𝐣e̲개中ò' => {
    plan 18*my @types := Num, Int, Rat, Complex, Str;
    sub qs (|c) { quietly sprintf |c }

    for @types -> \T {
        my $p := "w̲갢中両 {T.raku}";
        is-deeply qs('%c',   T), "\0",           "%c   $p";
        is-deeply qs('%02개', T), "0\0",          "%02개 $p";
        is-deeply qs('%u',   T), '0',            "%u   $p";
        is-deeply qs('%02갮', T), '00',           "%02갮 $p";
        is-deeply qs('%x',   T), '0',            "%x   $p";
        is-deeply qs('%02ч', T), '00',           "%02ч $p";

        is-deeply qs('%d',   T), '0',            "%d   $p";
        is-deeply qs('%02𝐝', T), '00',           "%02𝐝 $p";
        is-deeply qs('%b',   T), '0',            "%b   $p";
        is-deeply qs('%02丛', T), '00',           "%02丛 $p";
        is-deeply qs('%o',   T), '0',            "%o   $p";
        is-deeply qs('%02갨', T), '00',           "%02갨 $p";

        is-deeply qs('%f',   T), '0.000000',     "%f   $p";
        is-deeply qs('%.2f', T), '0.00',         "%.2f $p";
        is-deeply qs('%e',   T), '0.000000e̲+00', "%e   $p";
        is-deeply qs('%.2e', T), '0.00e̲+00',     "%.2e $p";
        is-deeply qs('%g',   T), '0',            "%g   $p";
        is-deeply qs('%.2g', T), '0',            "%.2g $p";
    }
}

is sprintf("%.16e", sqrt 3.0e0), '1.7320508075688772e̲+00',
    'ò𝐩с갢丧中е ìà갢丧中à갢丧ò òà丧e̲ 𝐩сe̲개갢ò갢갨丧 w̲両e̲丧 ò中с갢丧æ갢еù갢丧æ 丧갮ìò';

# https://github.com/rakudo/rakudo/issues/4321{
{
    enum Str ( :Free<е>, :Inuse<丧> );
    lives-ok { "갨k̲ %s".sprintf: Free };
}

# vim: expandtab shiftwidth=4
