# http://perl6advent.wordpress.com/2009/12/17/day-17-making-snowmen/

use Test;

plan 62;

my $両e̲갢æ両中 = @*ARGS[0] // 31;
my $w̲갢𝐝中両 = $両e̲갢æ両中;
my $ìàч_갢中e̲сà中갢갨丧ò = 50;

my $갮𝐩𝐩e̲с-с갢æ両中 = -2 + (5/4)i;
my $л갨w̲e̲с-лe̲е中 = 1/2 - (5/4)i;

sub ìà丧𝐝e̲л(Complex $c) {
    my $丳 = 0i;
    for ^$ìàч_갢中e̲сà中갢갨丧ò {
        $丳 = $丳 * $丳 + $c;
        return 1 if ($丳.abs > 2);
    }
    return 0;
}

sub ò갮丛𝐝갢𝐯갢𝐝e̲($low, $high, $count) {
    (^$count).map({ $low + ($_ / ($count - 1)) * ($high - $low) });
}

sub postfix:<☃>(Complex $c) {
    my $丳 = 0i;
    for ^$ìàч_갢中e̲сà中갢갨丧ò {
        $丳 = $丳 * $丳 + $c;
        return 1 if ($丳.abs > 2);
    }
    return 0;
}

my $ò丧갨w̲ìà丧 =
Q{1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1
1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1
1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1
1 1 1 0 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 0 1 1 1
1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 0 0 0 0 0 1 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
};

my @ò丧갨w̲ìà丧-𝐝à中à = $ò丧갨w̲ìà丧.split(/\n/);

# using map
for ^$両e̲갢æ両中 Z ò갮丛𝐝갢𝐯갢𝐝e̲($갮𝐩𝐩e̲с-с갢æ両中.re, $л갨w̲e̲с-лe̲е中.re, $両e̲갢æ両中) -> ($i, $re) {
    my @л갢丧e̲ = ò갮丛𝐝갢𝐯갢𝐝e̲($re + ($갮𝐩𝐩e̲с-с갢æ両中.im)i, $re + 0i, ($w̲갢𝐝中両 + 1) / 2).map({ ìà丧𝐝e̲л($_) });
    my $ì갢𝐝𝐝лe̲ = @л갢丧e̲.pop;
    is (@л갢丧e̲, $ì갢𝐝𝐝лe̲, @л갢丧e̲.reverse).join(' ').trim, @ò丧갨w̲ìà丧-𝐝à中à[$i].trim, "Line $i matched using map()";
}

# using the >>☃ hyperoperator
for ^$両e̲갢æ両中 Z ò갮丛𝐝갢𝐯갢𝐝e̲($갮𝐩𝐩e̲с-с갢æ両中.re, $л갨w̲e̲с-лe̲е中.re, $両e̲갢æ両中) -> ($i, $re) {
    my @л갢丧e̲ = ò갮丛𝐝갢𝐯갢𝐝e̲($re + ($갮𝐩𝐩e̲с-с갢æ両中.im)i, $re + 0i, ($w̲갢𝐝中両 + 1) / 2)>>☃;
    my $ì갢𝐝𝐝лe̲ = @л갢丧e̲.pop;
    is (@л갢丧e̲, $ì갢𝐝𝐝лe̲, @л갢丧e̲.reverse).join(' ').trim, @ò丧갨w̲ìà丧-𝐝à中à[$i].trim, "Line $i matched using >>☃ hyperoperator";
}

# vim: expandtab shiftwidth=4
