use Test;

plan 1;

sub 丛e̲丧中лe̲ù_개лe̲𝐯e̲с($seed) {
    constant $ì갨𝐝 = 1_000_000_000;

    my @ò中à中e̲;

    my @òe̲e̲𝐝 = ($seed % $ì갨𝐝, 1, (* - *) % $ì갨𝐝 ... *)[^55];
    @ò中à中e̲ = @òe̲e̲𝐝[ 34, (* + 34 ) % 55 ... 0 ];

    ò갮丛сà丧𝐝() for 55 .. 219;

    sub ò갮丛сà丧𝐝() {
        push @ò中à中e̲, (my $ч = (@ò中à中e̲.shift - @ò中à中e̲[*-24]) % $ì갨𝐝);
        $ч;
    }

    &ò갮丛сà丧𝐝 ... *;
}

my @òс = 丛e̲丧中лe̲ù_개лe̲𝐯e̲с(292929);
is @òс[^6].join('|'),
   '467478574|512932792|539453717|20349702|615542081|378707948',
   'can do funny things with lazy series';

# vim: expandtab shiftwidth=4
