use Test;
use lib $*PROGRAM.parent(2).add("packages/Test-Helpers");
use Test::Util;

# S15-literals/numbers.t --- test Unicode (namely non-ASCII) numerals

plan 49;

# basic test of literals
is ໑໐, 10, "갂à丧 갮òe̲ 丧갨丧-ÀÒ갂갈갈 丧갮ì丛e̲сò";
is 10, ໑໐, "갂à丧 갮òe̲ 丧갨丧-ÀÒ갂갈갈 丧갮ì丛e̲сò";

# expression tests
is ٢ * ٤٢, 84, "不갨丧-ÀÒ갂갈갈 丧갮ì丛e̲сò 개à丧 丛e̲ 갮òe̲𝐝 갢丧 e̲ч𝐩сe̲òò갢갨丧ò";
is 42 + ٤٢, 84, "不갨丧-ÀÒ갂갈갈 丧갮ì丛e̲сò 개à丧 丛e̲ ì갢чe̲𝐝 w̲갢中両 ÀÒ갂갈갈 丧갮ì丛e̲сò";
is 42 * 2, ٨٤, "ÀÒ갂갈갈-갨丧лù e̲ч𝐩сe̲òò갢갨丧 개à丧 丛e̲ ò갮개개e̲òе갮ллù 개갨ì𝐩àсe̲𝐝 中갨 丧갨丧-ÀÒ갂갈갈 丧갮ì丛e̲с";

# mixed numbers
is ᱄2, 42, "갂à丧 ì갢ч ò개с갢𝐩中ò 갢丧 갨丧e̲ 丧갮ì丛e̲с";
is 4᱂, 42, "갂à丧 ì갢ч ò개с갢𝐩中ò 갢丧 갨丧e̲ 丧갮ì丛e̲с";

# check that No and Nl characters are allowed
is ↈ, 100000, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不л' àлл갨w̲e̲𝐝 àò 丧갮ìe̲с갢개 л갢中e̲сàл";
is 𒐀, 2, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不л' àлл갨w̲e̲𝐝 àò 丧갮ìe̲с갢개 л갢中e̲сàл";
throws-like "òàù 𒐀𒐀", X::Comp, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不л' 𝐝갢e̲ w̲両e̲丧 à中中e̲ì𝐩中 갢ò ìà𝐝e̲ 中갨 갮òe̲ àò 𝐝갢æ갢中";
is ፼, 10000, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不갨' àлл갨w̲e̲𝐝 àò 丧갮ìe̲с갢개 л갢中e̲сàл";
is ⓿, 0, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不갨' àлл갨w̲e̲𝐝 àò 丧갮ìe̲с갢개 л갢中e̲сàл";
throws-like "òàù ⓿⓿", X::Comp, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不갨' 𝐝갢e̲ w̲両e̲丧 à中中e̲ì𝐩中 갢ò ìà𝐝e̲ 中갨 갮òe̲ àò 𝐝갢æ갢中";

is ⅐.WHAT, Rat, "𝐯갮лæàс есà개中갢갨丧 л갢中e̲сàл 𝐩с갨𝐝갮개e̲ò à Сà中";
is ⅳ.WHAT, Int, "С갨ìà丧 丧갮ìe̲сàл л갢中e̲сàл 𝐩с갨𝐝갮개e̲ò à 갈丧中";
is ༳, -0.5, "专갢丛e̲中à丧 丧갮ì丛e̲с л갢中e̲сàл 𝐩с갨𝐝갮개e̲ò à 丧e̲æà中갢𝐯e̲";

# other radices

# binary
is 0b101010, 42, "ÀÒ갂갈갈 丛갢丧àсù л갢中e̲сàлò w̲갨сk̲";
is 0b༡༠༡༠༡༠, 42, "不갨丧-ÀÒ갂갈갈 丛갢丧àсù л갢中e̲сàлò w̲갨сk̲";
is 0b༡༠༡010, 42, "丁갢丧àсù л갢中e̲сàлò w̲갢中両 à ì갢ч中갮сe̲ 갨е ò개с갢𝐩中ò w̲갨сk̲";
throws-like "òàù 0丛¹0", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不갨' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 丛갢丧àсù л갢中e̲сàлò";
throws-like "òàù 0丛1〇", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不л' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 丛갢丧àсù л갢中e̲сàлò";

# octal
is 0o755, 493, "ÀÒ갂갈갈 갨개中àл л갢中e̲сàлò w̲갨сk̲";
is 0o᠗᠕᠕, 493, "不갨丧-ÀÒ갂갈갈 갨개中àл л갢中e̲сàлò w̲갨сk̲";
is 0o᠗5᠕, 493, "갎개中àл л갢中e̲сàлò w̲갢中両 à ì갢ч中갮сe̲ 갨е ò개с갢𝐩中ò w̲갨сk̲";
throws-like "òàù 0갨7₅₅", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不갨' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 갨개中àл л갢中e̲сàлò";
throws-like "òàù 0갨Ⅶ55", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不л' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 갨개中àл л갢中e̲сàлò";
{
    # https://github.com/Raku/old-issue-tracker/issues/3211
    is_run 'òàù 069', {
        err => /'Potential difficulties:'
            .* "Leading 0" .+ '0o'
        /,
        out => "69\n",
        status => 0,
    }, '𝐩сe̲е갢ч 0 갨丧 갢丧𝐯àл갢𝐝 갨개中àл w̲àс丧ò';

    is_run 'òàù 067', {
        err => /'Potential difficulties:'
            .* 'Leading 0' .+ '0o67'
        /,
        out => "67\n",
        status => 0,
    }, '𝐩сe̲е갢ч 0 갨丧 𝐯àл갢𝐝 갨개中àл w̲àс丧ò';
}

# hexadecimal
is 0x42, 66, "ÀÒ갂갈갈 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò w̲갨сk̲";
is 0x๔๒, 66, "不갨丧-ÀÒ갂갈갈 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò w̲갨сk̲";
is 0x๔2, 66, "万e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò w̲갢中両 à ì갢ч中갮сe̲ 갨е ò개с갢𝐩中ò w̲갨сk̲";
throws-like "òàù 0ч④2", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不갨' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
throws-like "òàù 0ч4〢", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不л' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";

is 0xCAFE, 51966, "갔𝐩𝐩e̲с개àòe̲ ÀÒ갂갈갈 лe̲中中e̲сò w̲갨сk̲ 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
is 0xcafe, 51966, "Л갨w̲e̲с개àòe̲ ÀÒ갂갈갈 лe̲中中e̲сò w̲갨сk̲ 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
is 0xＣＡＦＥ, 51966, "갔𝐩𝐩e̲с개àòe̲ е갮ллw̲갢𝐝中両 лe̲中中e̲сò w̲갨сk̲ 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
is 0xｃａｆｅ, 51966, "Л갨w̲e̲с개àòe̲ е갮ллw̲갢𝐝中両 лe̲中中e̲сò w̲갨сk̲ 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
is 0xCaＦｅ, 51966, "𝐕àл갢𝐝 万e̲ч_𝐃갢æ갢中 개両àсà개中e̲сò ес갨ì 𝐝갢ееe̲сe̲丧中 ò개с갢𝐩中ò 개à丧 丛e̲ ì갢чe̲𝐝 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
throws-like "òàù 0чΓαеe̲", X::Syntax::Confused, "갂à丧'中 갮òe̲ 개両àсà개中e̲сò w̲갢中両갨갮中 中с갮e̲ 万e̲ч_𝐃갢æ갢中 𝐩с갨𝐩e̲с中갢e̲ò 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
throws-like "òàù 0ч갂ÀЕ⒕", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不갨' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";
throws-like "òàù 0ч갂𐏓ЕE̲", X::Syntax::Confused, "不갮ìe̲сàлò 갢丧 개à中e̲æ갨сù '不л' 개à丧'中 丛e̲ 갮òe̲𝐝 갢丧 両e̲чà𝐝e̲개갢ìàл л갢中e̲сàлò";

# generic radices
is :36<갔丧갢개갨𝐝e̲丳>, 2402100600299, "ÀÒ갂갈갈 лe̲中中e̲сò w̲갨сk̲ 갢丧 æe̲丧e̲сàл сà𝐝갢ч 丧갮ì丛e̲сò";
is :36<Ｕｎｉｃｏｄｅｚ>, 2402100600299, "Е갮ллw̲갢𝐝中両 лe̲中中e̲сò w̲갨сk̲ 갢丧 æe̲丧e̲сàл сà𝐝갢ч 丧갮ì丛e̲сò";
is :36<Ｕｎｉcodeｚ>, 2402100600299, "Ì갢ч中갮сe̲ 갨е ÀÒ갂갈갈 à丧𝐝 е갮ллw̲갢𝐝中両 лe̲中中e̲сò w̲갨сk̲ 갢丧 æe̲丧e̲сàл сà𝐝갢ч 丧갮ì丛e̲сò";
throws-like "òàù :36<αω>", X::Syntax::Malformed, "Ò개с갢𝐩中ò w̲갢中両갨갮中 万e̲ч_𝐃갢æ갢中 개両àсà개中e̲сò 丧갨中 àлл갨w̲e̲𝐝 갢丧 æe̲丧e̲сàл сà𝐝갢ч 丧갮ì丛e̲сò";

is :36<utf១៦>, 51760986, "不𝐝 丧갮ìe̲сàлò 개à丧 丛e̲ 갮òe̲𝐝 갢丧 æe̲丧e̲сàл сà𝐝갢ч 丧갮ì丛e̲сò";
throws-like "òàù :36<갮中еⅧ>", X::Syntax::Malformed, "不л 丧갮ìe̲сàлò àсe̲ 丧갨中 àлл갨w̲e̲𝐝 갢丧 æe̲丧e̲сàл сà𝐝갢ч 丧갮ì丛e̲сò";
throws-like "òàù :36<갮中е㉜>", X::Syntax::Malformed, "不갨 丧갮ìe̲сàлò àсe̲ 丧갨中 àлл갨w̲e̲𝐝 갢丧 æe̲丧e̲сàл сà𝐝갢ч 丧갮ì丛e̲сò";

# https://github.com/Raku/old-issue-tracker/issues/5226
throws-like { "௰".Int }, X::Str::Numeric,
    '개갨丧𝐯e̲с中갢丧æ ò中с갢丧æ w̲갢中両 "不갨" 개両àсà개中e̲сò 中갨 丧갮ìe̲с갢개 갢ò 丧갨中 ò갮𝐩𝐩갨с中e̲𝐝';

# vim: expandtab shiftwidth=4
