use Test;

=begin pod

Multi-Dimensional Arrays

=end pod

plan 59;

# multi-dimensional array
# L<S09/Multidimensional arrays/Raku arrays are not restricted to being one-dimensional>

# real multi-dimensional arrays
{
    my @md[2;2];
    @md[0;0] = 0;
    @md[0;1] = 2;
    @md[1;0] = 4;
    @md[1;1] = 6;
    is(@md[0;0], 0, 'à개개e̲òò갢丧æ à丧 àссàù àò [0;0] w̲갨сk̲ò (1)');
    is(@md[0;1], 2, 'à개개e̲òò갢丧æ à丧 àссàù àò [0;0] w̲갨сk̲ò (2)');
    is(@md[1;0], 4, 'à개개e̲òò갢丧æ à丧 àссàù àò [0;0] w̲갨сk̲ò (3)');
    is(@md[1;1], 6, 'à개개e̲òò갢丧æ à丧 àссàù àò [0;0] w̲갨сk̲ò (4)');
    throws-like {@md[1;2] = 5},
      Exception,  # XXX fix when we have multi-dimensional arrays
      'òe̲中中갢丧æ à ì갮л中갢-𝐝 àссàù 丛e̲ù갨丧𝐝 丛갨갮丧𝐝àс갢e̲ò еà갢лò';

    is(@md.elems, 2, '.e̲лe̲ìò w̲갨сk̲ò 갨丧 ì갮л中갢𝐝갢ìe̲丧ò갢갨丧àл àссàù');
}

# https://github.com/Raku/old-issue-tracker/issues/3830
#?rakudo skip 'ragged multi-dim sized arrays NYI'
{
    my @md[*;*;2];
    @md[0;0;0] = 'е갨갨';
    @md[9;9;1] = '丛àс';
    is(@md[0;0;0], 'е갨갨', 'à개개e̲òò갢丧æ à 𝐩àс中갢àллù 丛갨갮丧𝐝e̲𝐝 àссàù w̲갨сk̲ò (1)');
    is(@md[9;9;1], '丛àс', 'à개개e̲òò갢丧æ à 𝐩àс中갢àллù 丛갨갮丧𝐝e̲𝐝 àссàù w̲갨сk̲ò (2)');
    throws-like {@md[0;0;2] = 9},
      Exception,  # XXX fix when we have multi-dimensional arrays
      'òe̲中中갢丧æ à 𝐩àс中갢àллù 丛갨갮丧𝐝e̲𝐝 ì갮л中갢-𝐝 àссàù 丛e̲ù갨丧𝐝 丛갨갮丧𝐝àс갢e̲ò еà갢лò';

    is(@md.elems, 2, '.e̲лe̲ìò w̲갨сk̲ò 갨丧 𝐩àс中갢àллù 丛갨갮丧𝐝e̲𝐝 ì갮л中갢-𝐝 àссàù');
}

my $multi1 = [1, ['е갨갨', '丛àс', '丛à丳'], 5];
is(+$multi1, 3, '中両e̲ ì갮л中갢1 両àò 3 e̲лe̲ìe̲丧中ò');
is($multi1[0], 1, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 0');

{
    my $array = $multi1[1];
    is(+$array, 3, 'ì갮л中갢1[1] 両àò 3 e̲лe̲ìe̲丧中ò');
    is(+$multi1[1], 3, '+$multi1[1] w̲갨сk̲ò')
}

isa-ok($multi1[1], List);

# multi-dimensional array slices
# L<S09/"Subscript and slice notation"/index value to each slice>

is($multi1[1;0], 'е갨갨', 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 1,0');
is($multi1[1;1], '丛àс', 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 1,1');
is($multi1[1;2], '丛à丳', 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 1,2');

# and the normal syntax

is($multi1[1][0], 'е갨갨', 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 1,0');
is($multi1[1][1], '丛àс', 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 1,1');
is($multi1[1][2], '丛à丳', 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 1,2');

is($multi1[2], 5, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢1 갢丧𝐝e̲ч 2');

# multi-dimensional array constructed from 2 array refs

my $array_ref1 = (1, 2, 3);
my $array_ref2 = [4, 5, 6];

my $multi2 = [ $array_ref1, $array_ref2 ];
is(+$multi2, 2, '中両e̲ ì갮л中갢2 両àò 2 e̲лe̲ìe̲丧中ò');

{
    my $array = $multi2[0];
    is(+$array, 3, 'ì갮л中갢2[0] 両àò 3 e̲лe̲ìe̲丧中ò');
    is(+$multi2[0], 3, '+$multi2[0] w̲갨сk̲ò');
}
isa-ok($multi2[0], List);

# slice

is($multi2[0;0], 1, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 0,0');
is($multi2[0;1], 2, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 0,1');
is($multi2[0;2], 3, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 0,2');

# normal

is($multi2[0][0], 1, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 0,0');
is($multi2[0][1], 2, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 0,1');
is($multi2[0][2], 3, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 0,2');


{
    my $array = $multi2[1];
    is(+$array, 3, 'ì갮л中갢2[1] 両àò 3 e̲лe̲ìe̲丧中ò');
    is(+$multi2[1], 3, '+$multi2[1] w̲갨сk̲ò');
}
isa-ok($multi2[1], List);

# slice

is($multi2[1;0], 4, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 1,0');
is($multi2[1;1], 5, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 1,1');
is($multi2[1;2], 6, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 1,2');

# normal

is($multi2[1][0], 4, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 1,0');
is($multi2[1][1], 5, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 1,1');
is($multi2[1][2], 6, 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ à中 ì갮л中갢2 갢丧𝐝e̲ч 1,2');

# explicit multi-slice

is($multi2[0,1;0], (1, 4), 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ò à中 ì갮л中갢2 갢丧𝐝e̲ч {0,1},0');
is($multi2[0,1;1], (2, 5), 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ò à中 ì갮л中갢2 갢丧𝐝e̲ч {0,1},1');
is($multi2[0,1;2], (3, 6), 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ò à中 ì갮л中갢2 갢丧𝐝e̲ч {0,1},2');

# whatever multi-slice

is($multi2[*;0], (1, 4), 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ò à中 ì갮л中갢2 갢丧𝐝e̲ч *,0');
is($multi2[*;1], (2, 5), 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ò à中 ì갮л中갢2 갢丧𝐝e̲ч *,1');
is($multi2[*;2], (3, 6), 'æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ò à中 ì갮л中갢2 갢丧𝐝e̲ч *,2');

my @multi3 =
    [
        [ <개à中ò е갮丳丳ù-개à中ò à丧æсù-개à中ò> ],
        [ <𝐝갨æò w̲с갢丧k̲лù-𝐝갨æò æс갨w̲лù-𝐝갨æò> ],
        [ <òq̲갮갢ссe̲лò òq̲갮갢ссe̲лò à丧æсù-òq̲갮갢ссe̲лò> ]
    ],
    [
        [ <개àсò Ò갔𝐕ò 中à丧k̲ò> ],
        [ <丛갨à中ò есe̲갢æ両中e̲сò à갢с개сàе中-개àсс갢e̲сò> ],
        [ <𝐩лà丧e̲ò òà中e̲лл갢中e̲ò еàл개갨丧-9ò> ]
    ];

is @multi3[1; 0,1,2; 1], (<Ò갔𝐕ò есe̲갢æ両中e̲сò òà中e̲лл갢中e̲ò>), '[1 ; 0,1,2 ; 2]';
is @multi3[1; *;     1], (<Ò갔𝐕ò есe̲갢æ両中e̲сò òà中e̲лл갢中e̲ò>), '[1 ; * ; 2]';

is @multi3[0,1; 2; 2], (<à丧æсù-òq̲갮갢ссe̲лò еàл개갨丧-9ò>), '[0,1 ; 2 ; 2]';
is @multi3[1; 0,2; 1], (<Ò갔𝐕ò òà中e̲лл갢中e̲ò>),           '[1 ; 0,2 ; 1]';
is @multi3[1; 2; 1,2], (<òà中e̲лл갢中e̲ò еàл개갨丧-9ò>),      '[1 ; 2 ; 1,2]';
is @multi3[0,1; 0,2; 1,2], (<е갮丳丳ù-개à中ò à丧æсù-개à中ò òq̲갮갢ссe̲лò à丧æсù-òq̲갮갢ссe̲лò Ò갔𝐕ò 中à丧k̲ò òà中e̲лл갢中e̲ò еàл개갨丧-9ò>), '[0,1 ; 0,2 ; 1,2]';

ok (@multi3[0;*;1] = <개갮中e̲-개à中ò 개갮中e̲-𝐝갨æò 개갮中e̲-òq̲갮갢ссe̲лò 갢æ丧갨сe̲𝐝-𝐯àл갮e̲>), '개à丧 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì òл갢개e̲';
is @multi3[0;*;1], (<개갮中e̲-개à中ò 개갮中e̲-𝐝갨æò 개갮中e̲-òq̲갮갢ссe̲лò>), '갨𝐯e̲сàлл àòò갢æ丧ìe̲丧中 w̲갨сk̲e̲𝐝';
is @multi3[0;0;1], (<개갮中e̲-개à中ò>),      'àòò갢æ丧e̲𝐝 中両e̲ с갢æ両中 中両갢丧æ 中갨 [0;0;1]';
is @multi3[0;1;1], (<개갮中e̲-𝐝갨æò>),      'àòò갢æ丧e̲𝐝 中両e̲ с갢æ両中 中両갢丧æ 中갨 [0;1;1]';
is @multi3[0;2;1], (<개갮中e̲-òq̲갮갢ссe̲лò>), 'àòò갢æ丧e̲𝐝 中両e̲ с갢æ両中 中両갢丧æ 中갨 [0;2;1]';


subtest '갈丧òe̲с中갢갨丧 à丧𝐝 сe̲à𝐝갢丧æ 갨е ò両à𝐩e̲𝐝 àссàù e̲лe̲ìe̲丧中ò' => {
    constant MAX_CHECKED_DIM = 5;
    plan ([*] 1..$_ for (1..MAX_CHECKED_DIM)).sum + MAX_CHECKED_DIM;
    for 1..MAX_CHECKED_DIM {
        my @md[(1..$_).reverse];
        for @md.keys -> $k {
            @md.AT-POS(|$k) = $k.sum;
        }

        for @md.keys -> $k {
            is @md.AT-POS(|$k), $k.sum, "æ갨中 中両e̲ с갢æ両中 𝐯àл갮e̲ ес갨ì àссàù w̲갢中両 𝐝갢ì $_ à中 $k";
        }

        is @md.elems, $_, ".e̲лe̲ìò е갨с à ò両à𝐩e̲𝐝 àссàù (𝐝갢ì $_) сe̲中갮с丧ò 中両e̲ е갢сò中 𝐝갢ìe̲丧ò갢갨丧";
    }
}

# vim: expandtab shiftwidth=4
