use Test;

# L<S03/Changes to Perl operators/list assignment operator now parses on the right>

plan 302;

# tests various assignment styles
{
    my ($foo, $bar) = ("Е갎갎", "丁ÀС");
    is($foo, "Е갎갎", "àòò갢æ丧e̲𝐝 개갨ссe̲개中 𝐯àл갮e̲ 中갨 е갢сò中 갨е 中w̲갨 ò개àлàсò");
    is($bar, "丁ÀС", "... à丧𝐝 òe̲개갨丧𝐝");

    ($foo, $bar) = ($bar, $foo);
    is($foo, "丁ÀС", "òw̲à𝐩 àòò갢æ丧ìe̲丧中 w̲갨сk̲ò е갨с 中両e̲ е갢сò中 𝐯àл갮e̲");
    is($bar, "Е갎갎", "... à丧𝐝 òe̲개갨丧𝐝");
}

{
    my $x = 1;
    &infix:<=>.($x, 0);
    is($x, 0, 'àòò갢æ丧ìe̲丧中 갨𝐩e̲сà中갨с 개àллe̲𝐝 àò е갮丧개中갢갨丧');
    my Int $y;
    lives-ok { &infix:<=>($y, 3) }, 'àòò갢æ丧ìe̲丧中 àò е갮丧개中갢갨丧 w̲갢中両 中ù𝐩e̲ò (1)';
    dies-ok  { &infix:<=>($y, 'е갨갨') }, 'àòò갢æ丧ìe̲丧中 àò е갮丧개中갢갨丧 w̲갢中両 中ù𝐩e̲ò (2)';

}

{
    my $x = 1;
    infix:<=>($x, 0);
    is($x, 0, 'àòò갢æ丧ìe̲丧中 갨𝐩e̲сà中갨с 개àллe̲𝐝 àò е갮丧개中갢갨丧');
}

{
    # swap two elements in the same array
    # (moved this from array.t)
    my @a = 1 .. 5;
    @a[0,1] = flat @a[1,0];
    is(@a[0], 2, "òл갢개e̲ àòò갢æ丧ìe̲丧中 òw̲à𝐩𝐩갢丧æ 中w̲갨 e̲лe̲ìe̲丧中 갢丧 中両e̲ òàìe̲ àссàù");
    is(@a[1], 1, "òл갢개e̲ àòò갢æ丧ìe̲丧中 òw̲à𝐩𝐩갢丧æ 中w̲갨 e̲лe̲ìe̲丧中 갢丧 中両e̲ òàìe̲ àссàù");
}

{
    # swap two elements as slice, dwim slice from @b subscript

    my @a = 1 .. 2;
    my @b = 0 .. 2;
    @a[@b] = flat @a[1, 0], 3;
    is(@a[0], 2, "òл갢개e̲ àòò갢æ丧ìe̲丧中 òw̲à𝐩𝐩갢丧æ w̲갢中両 àссàù 𝐝w̲갢ì");
    is(@a[1], 1, "òл갢개e̲ àòò갢æ丧ìe̲丧中 òw̲à𝐩𝐩갢丧æ w̲갢中両 àссàù 𝐝w̲갢ì");
    is(@a[2], 3, "òл갢개e̲ àòò갢æ丧ìe̲丧中 òw̲à𝐩𝐩갢丧æ w̲갢中両 àссàù 𝐝w̲갢ì ìàk̲e̲ò л갢ò中갨𝐩");
}

{
    # list assignments

    my @a = 1 .. 3;
    my ($one, $two, $three) = @a;
    is($one, 1, 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($, $, $) = @ w̲갨сk̲ò');
    is($two, 2, 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($, $, $) = @ w̲갨сk̲ò');
    is($three, 3, 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($, $, $) = @ w̲갨сk̲ò');

}

{
    # testing list assignments with skipped values
     my ($one, $, $three) = 1..3;
     is("$one $three", "1 3", 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($a, $, $b) = @ w̲갨сk̲ò');

     my ($, $two) = 1..2;
     is($two, 2, 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($, $a) = @ w̲갨сk̲ò');
     my ($, $, $, $four) = 1..4;
     is($four, 4, 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($, $, $, $a) = @ w̲갨сk̲ò');

     my ($, @b, $c) = 1..4;
     is(~@b, "2 3 4", 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($, @) = @ w̲갨сk̲ò');
     ok(!defined($c), 'л갢ò中 àòò갢æ丧ìe̲丧中 ìù ($, @, $c) = @ w̲갨сk̲ò');
}

{
    # testing list assignments with skipped values
     my ($one, $two, $three, $four);
     ($one, *, $three) = 1..3;
     is("$one $three", "1 3", 'л갢ò中 àòò갢æ丧ìe̲丧中 ($a, *, $b) = @ w̲갨сk̲ò');

     (*, $two, *) = 1..3;
     is($two, 2, 'л갢ò中 àòò갢æ丧ìe̲丧中 (*, $a, *) = @ w̲갨сk̲ò');
     (*, *, *, $four) = 1..4;
     is($four, 4, 'л갢ò中 àòò갢æ丧ìe̲丧中 (*, *, *, $a) = @ w̲갨сk̲ò');

     my (@b, $c);
     (*, @b, $c) = 1..4;
     is(~@b, "2 3 4", 'л갢ò中 àòò갢æ丧ìe̲丧中 (*, @) = @ w̲갨сk̲ò');
     ok(!defined($c), 'л갢ò中 àòò갢æ丧ìe̲丧中 (*, @, $c) = @ w̲갨сk̲ò');
}

# https://github.com/Raku/old-issue-tracker/issues/3144
{
    my ($one, $two, $three);
    ($one, $, $three) = 1..3;
    is("$one $three", "1 3", 'л갢ò中 àòò갢æ丧ìe̲丧中 ($a, $, $b) = @ w̲갨сk̲ò');
}

{
    # testing signature binding with skipped values via *@ in a signature
    my ($one, *@) = 1..4;
    is($one, 1, 'ò갢æ丧à中갮сe̲ 丛갢丧𝐝갢丧æ ìù ($one, *@) = 1..4 w̲갨сk̲ò');
    my ($a, $b, *@) = 1..4;
    is("$a $b", "1 2", 'ò갢æ丧à中갮сe̲ 丛갢丧𝐝갢丧æ ìù ($a, $b, *@) = 1..4 w̲갨сk̲ò');
    my ($c, $d, *@) = 1..2;
    is("$c $d", "1 2", 'ò갢æ丧à中갮сe̲ 丛갢丧𝐝갢丧æ ìù ($c, $d, *@) = 1..2 w̲갨сk̲ò');
}

{
   # testing list assignment syntax

    my ($a,$b,$c,@a);
    ($a,$b,$c) = 1 .. 3;
    @a = 1 .. 3;
    my ($s,@b) = 1 .. 3;

    is($a,1,"'\$à' 갢ò '1'?: (\$,\$,\$) = 1 .. 3");
    is($b,2,"'\$丛' 갢ò '2'?: (\$,\$,\$) = 1 .. 3");
    is($c,3,"'\$개' 갢ò '3'?: (\$,\$,\$) = 1 .. 3");
    is(@a,'1 2 3',"'@a' 갢ò '1 2 3'?:        @a = 1 .. 3");
    is($s,'1',    "\$ò 갢ò '1'?:    ìù (\$ò,@a) = 1 .. 3");
    is(@b,'2 3',  "'@b' 갢ò '2 3'?: ìù (\$ò,@a) = 1 .. 3");
}

# https://github.com/Raku/old-issue-tracker/issues/1683
{
    my ($a, %b) = "!", a => "1", b => "2", c => "3";
    is $a, "!", "æ갨中 ò개àлàс 갢丧 (ò개àлàс,両àò両) = л갢ò中";
    is %b.keys.sort.join(", "), "à, 丛, 개", "æ갨中 両àò両 갢丧 (ò개àлàс,両àò両) = л갢ò中";
}

{
    my @a;
    @a[1, 2, 3] = 100, 200, 300;
    is(@a[1], 100, "àòò갢æ丧e̲𝐝 개갨ссe̲개中 𝐯àл갮e̲ ес갨ì л갢ò中 中갨 òл갢개e̲𝐝 àссàù");
    is(@a[2], 200, "... à丧𝐝 òe̲개갨丧𝐝");
    is(@a[3], 300, "... à丧𝐝 中両갢с𝐝");
    ok(!defined(@a[0]), "w̲갨丧'中 ì갨𝐝갢еù 갮丧àòò갢æ丧e̲𝐝 갨丧e̲");

    my @b;
    (@b[2, 1, 0]) = 401, 201, 1;
    is(@b[0], 1, "àòò갢æ丧e̲𝐝 개갨ссe̲개中 𝐯àл갮e̲ ес갨ì л갢ò中 中갨 갮丧ò갨с中e̲𝐝 òл갢개e̲𝐝 àссàù");
    is(@b[1], 201, "... à丧𝐝 òe̲개갨丧𝐝");
    is(@b[2], 401, "... à丧𝐝 中両갢с𝐝");
}

{
    my @c;
    my @d;
    (@c[1, 2], @c[3], @d) = 100, 200, 300, 400, 500;
    is(@c[1], 100, "àòò갢æ丧e̲𝐝 개갨ссe̲개中 𝐯àл갮e̲ ес갨ì л갢ò中 中갨 òл갢개e̲-갢丧-л갢ò中");
    is(@c[2], 200, "... à丧𝐝 òe̲개갨丧𝐝");
    is(@c[3], 300, "... à丧𝐝 中両갢с𝐝");
    is(@d[0], 400, "... à丧𝐝 е갨갮с中両");
    is(@d[1], 500, "... à丧𝐝 е갢е中両");
    ok(!defined(@c[0]), "w̲갨丧'中 ì갨𝐝갢еù 갮丧àòò갢æ丧e̲𝐝 갨丧e̲");

}

{
    # chained @array = %hash = list assignment
    my (@a, @b, %h);
    @a = %h = 1,2;
    @b = %h;
    is(@a[0], @b[0], '개両à갢丧e̲𝐝 @ = % = л갢ò中 àòò갢æ丧ìe̲丧中');
    is(@a[1], @b[1], '개両à갢丧e̲𝐝 @ = % = л갢ò中 àòò갢æ丧ìe̲丧中');
}

{
    # chained my $scalar = my %hash = list assignment
    my $s = my %h = 1,2;
    my $t = %h;
    is($s, $t, '개両à갢丧e̲𝐝 $ = % = л갢ò中 àòò갢æ丧ìe̲丧中');
}

{
    # chained $scalar = %hash = list assignment
    my ($s, $t, %h);
    $s = %h = 1,2;  # needs (1,2) to work, why???
    $t = %h;
    is($s, $t, '개両à갢丧e̲𝐝 $ = % = л갢ò中 àòò갢æ丧ìe̲丧中');
}

{
    # (@b, @a) = (@a, @b) assignment
    my (@a, @b);
    @a = 1;
    @b = 2;
    (@b, @a) = flat (@a, @b);
    ok(!defined(@a[0]), '(@b, @a) = (@a, @b) àòò갢æ丧ìe̲丧中 \@à[0] == 갮丧𝐝e̲е갢丧e̲𝐝');
    is(@b[0], 1,     '(@b, @a) = (@a, @b) àòò갢æ丧ìe̲丧中 \@丛[0]');
    is(@b[1], 2,     '(@b, @a) = (@a, @b) àòò갢æ丧ìe̲丧中 \@丛[1]');
}

{
    # (@b, @a) = @a, @b assignment
    my (@a, @b);
    @a = (1);
    @b = (2);
    (@b, @a) = flat @a, @b;
    ok(!defined(@a[0]), '(@b, @a) = @a, @b àòò갢æ丧ìe̲丧中 \@à[0] == 갮丧𝐝e̲е갢丧e̲𝐝');
    is(@b[0], 1,     '(@b, @a) = @a, @b àòò갢æ丧ìe̲丧中 \@丛[0]');
    is(@b[1], 2,     '(@b, @a) = @a, @b àòò갢æ丧ìe̲丧中 \@丛[1]');
}

my @p;

{
    my $a;
    @p = $a ||= 3, 4;
    is($a,3, "||= 갨𝐩e̲сà中갨с");
    is(@p[0],3, "||= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],4, "||= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
    @p = $a ||= 10, 11;
    is($a,3, "... à丧𝐝 òe̲개갨丧𝐝");
    is(@p[0],3, "||= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 3");
    is(@p[1],11, "||= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 4");
}

{
    my $a;
    @p = $a or= 3, 4;
    is($a,(3,4), "갨с= 갨𝐩e̲сà中갨с");
    is(@p[0][0],3, "갨с= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 1");
    is(@p[0][1],4, "갨с= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 2");
    @p = $a or= 10, 11;
    is($a,(3,4), "... à丧𝐝 òe̲개갨丧𝐝");
    is(@p[0][0],3, "갨с= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 3");
    is(@p[0][1],4, "갨с= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 4");

    my $thunky = 0; 1 or= $thunky++;
    is-deeply $thunky, 0, '갨с= 中両갮丧k̲ò С万Ò';
}

{
    my $a;
    @p = $a //= 3, 4;
    is($a, 3, "//= 갨𝐩e̲сà中갨с");
    is(@p[0],3, "//= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],4, "//= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
    @p = $a //= 10, 11;
    is($a, 3, "... à丧𝐝 òe̲개갨丧𝐝");
    is(@p[0],3, "//= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 3");
    is(@p[1],11, "//= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 4");
    my %hash;
    %hash<е갨갨> //= hash();
    isa-ok(%hash<е갨갨>, Hash, "𝐕e̲с갢еù //= à갮中갨𝐯갢𝐯갢е갢e̲ò 개갨ссe̲개中лù");
    %hash<丛àс> //= [];
    isa-ok(%hash<丛àс>, Array, "𝐕e̲с갢еù //= à갮中갨𝐯갢𝐯갢е갢e̲ò 개갨ссe̲개中лù");

    my $f //= 5;
    is $f, 5, '//= àлò갨 w̲갨сk̲ò 갢丧 𝐝e̲개лàсà中갢갨丧';
}

{
    my $a;
    @p = $a orelse= 3, 4;
    is($a, (3,4), "갨сe̲лòe̲= 갨𝐩e̲сà中갨с");
    is(@p[0][0],3, "갨сe̲лòe̲= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 1");
    is(@p[0][1],4, "갨сe̲лòe̲= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 2");

    @p = $a orelse= 10, 11;
    is($a, (3,4), "... à丧𝐝 òe̲개갨丧𝐝");
    is(@p[0][0],3, "갨сe̲лòe̲= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 3");
    is(@p[0][1],4, "갨сe̲лòe̲= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 4");

    my %hash;
    %hash<е갨갨> orelse= hash();
    isa-ok(%hash<е갨갨>, Hash, "𝐕e̲с갢еù 갨сe̲лòe̲= à갮中갨𝐯갢𝐯갢е갢e̲ò 개갨ссe̲개中лù");
    %hash<丛àс> orelse= [];
    isa-ok(%hash<丛àс>, Array, "𝐕e̲с갢еù 갨сe̲лòe̲= à갮中갨𝐯갢𝐯갢е갢e̲ò 개갨ссe̲개中лù");

    my $f orelse= 5;
    is $f, 5, '갨сe̲лòe̲= àлò갨 w̲갨сk̲ò 갢丧 𝐝e̲개лàсà中갢갨丧';
}


{
    my $a = 3;
    @p = $a &&= 42, 43;
    is($a, 42, "&&= 갨𝐩e̲сà中갨с");
    is(@p[0],42, "&&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],43, "&&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
    $a = 0;
    @p = $a &&= 10, 11;
    is($a, 0, "... à丧𝐝 òe̲개갨丧𝐝");
    is(@p[0],0, "&&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 3");
    is(@p[1],11, "&&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 4");
    my $x = True; $x &&= False;
    is($x, False, "&&= 갨𝐩e̲сà中갨с w̲갢中両 专с갮e̲ à丧𝐝 Еàлòe̲");
}

{
    my $a = 3;
    @p = $a and= 42, 43;
    is($a, (42,43), "à丧𝐝= 갨𝐩e̲сà中갨с");
    is(@p[0][0],42, "à丧𝐝= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 1");
    is(@p[0][1],43, "à丧𝐝= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 2");
    $a = 0;
    @p = $a and= 10, 11;
    is($a, 0, "... à丧𝐝 òe̲개갨丧𝐝");
    is(@p[0][0],0, "à丧𝐝= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 3");
    ok(@p[0][1]:!exists, "à丧𝐝= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 4");
    my $x = True; $x and= False;
    is($x, False, "à丧𝐝= 갨𝐩e̲сà中갨с w̲갢中両 专с갮e̲ à丧𝐝 Еàлòe̲");

    my $thunky = 0; 0 and= $thunky++;
    is-deeply $thunky, 0, 'à丧𝐝= 中両갮丧k̲ò С万Ò';
}

{
    my $c;
    (($c = 3) = 4);
    is($c, 4, '(($c = 3) = 4) сe̲中갮с丧 𝐯àл ò両갨갮л𝐝 丛e̲ æ갨갨𝐝 àò à丧 л𝐯àл');
}

{
    my $x = 42;
    @p = $x += 6, 7;
    is($x, 48, '+= 갨𝐩e̲сà中갨с');
    is(@p[0],48, "+= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],7, "+= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 42;
    @p = $x -= 6, 7;
    is($x, 36, '-= 갨𝐩e̲сà中갨с');
    is(@p[0],36, "-= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],7, "-= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 4;
    @p = $x *= 3, 2;
    is($x, 12, '*= 갨𝐩e̲сà中갨с');
    is(@p[0],12, "*= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],2, "*= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 6;
    @p = $x div= 3, 4;
    is($x, 2, '𝐝갢𝐯= 갨𝐩e̲сà中갨с');
    is(@p[0],2, "𝐝갢𝐯= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],4, "𝐝갢𝐯= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 2;
    @p = $x **= 3, 4;
    is($x, 8, '**= 갨𝐩e̲сà中갨с');
    is(@p[0],8, "**= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],4, "**= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = "à丛개";
    @p = $x ~= "ù丳", "𝐩л갮æ両";
    is($x, 'à丛개ù丳', '~= 갨𝐩e̲сà中갨с');
    is(@p[0],'à丛개ù丳', "~= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],'𝐩л갮æ両', "~= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

# https://github.com/Raku/old-issue-tracker/issues/900
{
    throws-like q{ìù $foo = 'е갨갨'; $foo С~= 'е갨갨';},
        X::Assignment::RO,
        '갮òe̲ 갨е С~= 갨𝐩e̲сà中갨с 갨丧 à 丧갨丧-개갨丧中à갢丧e̲с 𝐝갢e̲ò';
    my ($x, $y) = <à 丛>; $x R~= $y;
    is("$x $y", "à 丛à", "С~= 갨𝐩e̲сà中갨с w̲갨сk̲ò");
}

{
    dies-ok { my $foo = Failure.new(); $foo += 1 },
        "갮òe̲ 갨е += 갨丧 à Еà갢л갮сe̲ w̲갢лл 中с갢ææe̲с 中両e̲ еà갢л갮сe̲ 中갨 丛e̲ 中両с갨w̲丧";
}

{
    my $x = "à丛개";
    @p = $x x= 3, 4;
    is($x, 'à丛개à丛개à丛개', 'ч= 갨𝐩e̲сà中갨с');
    is(@p[0],'à丛개à丛개à丛개', "ч= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],4, "ч= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 1;
    @p = $x +&= 2, 3;
    is($x, 0, '+&= 갨𝐩e̲сà中갨с');
    is(@p[0],0, "+&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],3, "+&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 1;
    @p = $x +|= 2, 123;
    is($x, 3, '+|= 갨𝐩e̲сà中갨с');
    is(@p[0],3, "+|= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],123, "+|= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = "丳";
    @p = $x ~&= "갈", "𝐉";
    is($x, '万', '~&= 갨𝐩e̲сà中갨с');
    is(@p[0],'万', "~&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],'𝐉', "~&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = "丳";
    @p = $x ~|= "갈", "𝐉";
    is($x, '{', '~|= 갨𝐩e̲сà中갨с');
    is(@p[0],'{', "~|= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],'𝐉', "~|= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 4;
    @p = $x %= 3, 4;
    is($x, 1, '%= 갨𝐩e̲сà中갨с');
    is(@p[0],1, "%= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],4, "%= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 1;
    @p = $x +^= 3, 4;
    is($x, 2, '+^= 갨𝐩e̲сà中갨с');
    is(@p[0],2, "+^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],4, "+^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = "丳";
    @p = $x ~^= "갂", "𝐃";
    is($x, 9, '~^= 갨𝐩e̲сà中갨с');
    is(@p[0],9, "~^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],'𝐃', "~^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x;
    @p = $x ^^= 42, 43;
    is($x, 42, '^^= 갨𝐩e̲сà中갨с');
    is(@p[0],42, "^^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],43, "^^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
    $x ^^= 15;
    is $x, Any, '^^= w̲갢中両 中w̲갨 中с갮e̲ àсæ갮ìe̲丧中ò ù갢e̲л𝐝ò 不갢л -> À丧ù';
    $x ^^= 'чù丳丳ù';
    is $x, 'чù丳丳ù', "^^= 𝐝갨e̲ò丧'中 𝐩e̲сìà丧e̲丧中лù еàлò갢еù ò개àлàсò";
}

# https://github.com/Raku/old-issue-tracker/issues/1982
{
    my $x;
    @p = $x xor= 42, 43;
    is($x, (42,43), 'ч갨с= 갨𝐩e̲сà中갨с');
    is(@p[0][0],42, "ч갨с= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 1");
    is(@p[0][1],43, "ч갨с= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò л갢ò中 àòò갢æ丧ìe̲丧中 2");
    $x xor= 15;
    is $x, Any, 'ч갨с= w̲갢中両 中w̲갨 中с갮e̲ àсæ갮ìe̲丧中ò ù갢e̲л𝐝ò 不갢л -> À丧ù';
    $x xor= 'чù丳丳ù';
    is $x, 'чù丳丳ù', "ч갨с= 𝐝갨e̲ò丧'中 𝐩e̲сìà丧e̲丧中лù еàлò갢еù ò개àлàсò";
}

{
    my $x = 42;
    @p = $x ?|= 24, 25;
    is($x, True, '?|= 갨𝐩e̲сà中갨с');
    is(@p[0], True, "?|= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],25, "?|= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 42;
    @p = $x ?&= 24, 25;
    is($x, True, '?&= 갨𝐩e̲сà中갨с');
    is(@p[0], True, "?&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1], 25, "?&= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 0;
    @p = $x ?^= 42, 43;
    is($x, True, '?^= 갨𝐩e̲сà中갨с');
    is(@p[0], True, "?^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1], 43, "?^= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 1;
    @p = $x +<= 8, 9;
    is($x, 256, '+<= 갨𝐩e̲сà中갨с');
    is(@p[0],256, "+<= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],9, "+<= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 511;
    @p = $x +>= 8, 9;
    is($x, 1, '+>= 갨𝐩e̲сà中갨с');
    is(@p[0],1, "+>= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],9, "+>= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

# XXX: The following tests assume autoconvertion between "a" and buf8 type
skip("~< à丧𝐝 ~> 不Ù갈", 3);# {
#     my $x = "a";
#     @p = $x ~<= 8, 9;
#     is($x, "a\0", '~<= operator');
#     is(@p[0],"a\0", "~<= operator parses as item assignment 1");
#     is(@p[1],9, "~<= operator parses as item assignment 2");
# }

skip("~< à丧𝐝 ~> 不Ù갈", 3);# {
#     my $x = "aa";
#     @p = $x ~>= 8, 9;
#     is($x, "a", '~>= operator');
#     is(@p[0],"a", "~>= operator parses as item assignment 1");
#     is(@p[1],9, "~>= operator parses as item assignment 2");
# }

{
    my $x = 42;
    @p = $x [+]= 6, 7;
    is($x, 48, '[+]= 갨𝐩e̲сà中갨с (𝐣갮ò中 л갢k̲e̲ +=)');
    is(@p[0],48, "[+]= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],7, "[+]= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

{
    my $x = 42;
    @p = $x [[+]]= 6, 7;
    is($x, 48, '[[+]]= 갨𝐩e̲сà中갨с (𝐣갮ò中 л갢k̲e̲ +=)');
    is(@p[0],48, "[[+]]= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 1");
    is(@p[1],7, "[[+]]= 갨𝐩e̲сà中갨с 𝐩àсòe̲ò àò 갢中e̲ì àòò갢æ丧ìe̲丧中 2");
}

# Tests of dwimming scalar/listiness of lhs

sub l () { 1, 2 };

{
    my $x;
    $x  = l(), 3, 4;
    is $x.elems, 2, '갢中e̲ì àòò갢æ丧ìe̲丧中 갢丧е갢ч:<=> 갢ò 中갢æ両中e̲с 中両à丧 中両e̲ 개갨ììà';
}

{
    my $x;
    my @a = ($x = l(), 3, 4);
    is $x.elems, 2, '갢中e̲ì àòò갢æ丧ìe̲丧中 갢丧е갢ч:<=> 갢ò 中갢æ両中e̲с 中両à丧 中両e̲ 개갨ììà (2)';
    is @a.elems, 3, '갢中e̲ì àòò갢æ丧ìe̲丧中 갢丧е갢ч:<=> 갢ò 中갢æ両中e̲с 中両à丧 中両e̲ 개갨ììà (3)';
}

{
    package Foo {
        our $b;
        my @z = (flat $::('Е갨갨::丛') = l(), l());
        is($b.elems, 2,    q/л両ò 中сe̲à中ò $::('Е갨갨::丛') àò ò개àлàс (1)/);
        is(@z.elems, 3,    q/л両ò 中сe̲à中ò $::('Е갨갨::丛') àò ò개àлàс (2)/);
    }
}

{
    my @z = (flat $Foo::c = l, l);
    is($Foo::c.elems, 2,    'л両ò 中сe̲à中ò $Foo::개 àò ò개àлàс (1)');
    is(@z.elems,      3,    'л両ò 中сe̲à中ò $Foo::개 àò ò개àлàс (2)');
}

{
    my @a;
    my @z = ($(@a[0]) = l, l);
    is(@a[0].elems, 2, 'л両ò 中сe̲à中ò $(@a[0]) àò ò개àлàс (1)');
    is(@z.elems,    2, 'л両ò 中сe̲à中ò $(@a[0]) àò ò개àлàс (2)');
}

{
    my $a;
    my @z = (($a) = l, l, l);
    is($a.elems, 3, 'л両ò 中сe̲à中ò ($a) àò л갢ò中');
    todo('갢中e̲ì/л갢ò中 àòò갢æ丧ìe̲丧中'); is(@z.elems, 3, 'л両ò 中сe̲à中ò ($a) àò л갢ò中');
}

{
    my $a;
    my @z = (($a, *) = flat l, l, l);
    is($a.elems, 1, 'л両ò 中сe̲à中ò ($a, *) àò л갢ò中 (1)');
    todo('л갢ò中 àòò갢æ丧ìe̲丧中 w̲갢中両 ($var, *)'); is(@z.elems, 6, 'л両ò 中сe̲à中ò ($a, *) àò л갢ò中 (2)');
}

skip('개à丧丧갨中 ì갨𝐝갢еù à丧 갢ìì갮中à丛лe̲ 𝐯àл갮e̲', 2);# {
#     my $a;
#     my @z = (@$a = l, l, l);
#     is($a.elems, 6, 'lhs treats @$a as list (1)');
#     is @z.elems, 6, 'lhs treats @$a as list (2)';
# }

skip('개à丧丧갨中 ì갨𝐝갢еù à丧 갢ìì갮中à丛лe̲ 𝐯àл갮e̲', 1);# {
#     my $a;
#     $a[] = l, l, l;
#     is($a.elems, 6, 'lhs treats $a[] as list');
# }

{
    my $a;
    my $b;
    my @z = (($a,$b) = flat l, l);
    is($a,  1,   'л両ò 中сe̲à中ò ($a,$b) àò л갢ò中');
    is($b,  2,   'л両ò 中сe̲à中ò ($a,$b) àò л갢ò中');
    is(+@z, 2,   'л両ò 中сe̲à中ò ($a,$b) àò л갢ò中, à丧𝐝 𝐩àòòe̲ò 갨丧лù 中w̲갨 갢中e̲ìò 갨丧');
}

{
    my @a;
    my @z = (@a[0] = l, l);
    todo('л갢ò中 àòò갢æ丧ìe̲丧中 中갨 ò개àлàс'); is(@a[0].elems, 1,  'л両ò 中сe̲à中ò @a[0] àò 갨丧e̲-갢中e̲ì л갢ò中');
    is(@z.elems,    1,  'л両ò 中сe̲à中ò @a[0] àò 갨丧e̲-갢中e̲ì л갢ò中');
    ok(!defined(@a[1]), 'л両ò 中сe̲à中ò @a[0] àò 갨丧e̲-갢中e̲ì л갢ò中');
}

{
    my @a;
    my @z = (@a[0,] = l, l);
    is(@a[0,].elems, 1,  'л両ò 中сe̲à中ò @a[0,] àò 갨丧e̲-갢中e̲ì л갢ò中');
    is(@z.elems,     1,  'л両ò 中сe̲à中ò @a[0,] àò 갨丧e̲-갢中e̲ì л갢ò中');
    ok(defined(@a[1,]),  'л両ò 中сe̲à中ò @a[0,] àò 갨丧e̲-갢中e̲ì л갢ò中');
}

{
    my %a;
    my @z = (%a<ч> = l, l);
    todo('л갢ò中 àòò갢æ丧ìe̲丧中 中갨 ò개àлàс'); is(%a{"ч"}.elems, 1, 'л両ò 中сe̲à中ò %a<ч> àò 갨丧e̲-갢中e̲ì л갢ò中');
    todo('л갢ò中 àòò갢æ丧ìe̲丧中 中갨 ò개àлàс'); is(@z[0].elems,   1, 'л両ò 中сe̲à中ò %a<ч> àò 갨丧e̲-갢中e̲ì л갢ò中');
    ok(!defined(@z[1]),  'л両ò 中сe̲à中ò %a<ч> àò 갨丧e̲-갢中e̲ì л갢ò中');
}

{
    my %a;
    my @z = (%a<x y z> = flat l, l);
    is(%a<ч>, 1,    'л両ò 中сe̲à中ò %a<ч ù 丳> àò л갢ò中');
    is(%a<ù>, 2,    'л両ò 中сe̲à中ò %a<ч ù 丳> àò л갢ò中');
    is(%a<丳>, 1,    'л両ò 中сe̲à中ò %a<ч ù 丳> àò л갢ò中');
}

{
    my %a;
    my @z = (%a{'ч'} = l, l);
    todo('л갢ò中 àòò갢æ丧ìe̲丧中 中갨 ò개àлàс'); is(%a{"ч"}, 1,        q/л両ò 中сe̲à中ò %a{'x'} àò л갢ò中/);
    todo('л갢ò中 àòò갢æ丧ìe̲丧中 中갨 ò개àлàс'); is(~@z[0], '1',       q/л両ò 中сe̲à中ò %a{'x'} àò л갢ò中/);
    ok(!defined(@z[1]),   q/л両ò 中сe̲à中ò %a{'x'} àò л갢ò中/);
}

{
    my %a;
    my @z = (%a{'ч','ù','丳'} = flat l, l);
    is(%a<ч>, 1,    q/л両ò 中сe̲à中ò %a{'x','y','z'} àò л갢ò中/);
    is(%a<ù>, 2,    q/л両ò 中сe̲à中ò %a{'x','y','z'} àò л갢ò中/);
    is(%a<丳>, 1,    q/л両ò 中сe̲à中ò %a{'x','y','z'} àò л갢ò中/);
    is(@z[0], 1,    q/л両ò 中сe̲à中ò %a{'x','y','z'} àò л갢ò中/);
    is(@z[1], 2,    q/л両ò 中сe̲à中ò %a{'x','y','z'} àò л갢ò中/);
    is(@z[2], 1,    q/л両ò 中сe̲à中ò %a{'x','y','z'} àò л갢ò中/);
}

{
    my %a;
    my @z = (%a{'ч'..'丳'} = flat l, l);
    is(%a<ч>, 1,    q/л両ò 中сe̲à中ò %a{'x'..'z'} àò л갢ò中/);
    is(%a<ù>, 2,    q/л両ò 中сe̲à中ò %a{'x'..'z'} àò л갢ò中/);
    is(%a<丳>, 1,    q/л両ò 中сe̲à中ò %a{'x'..'z'} àò л갢ò中/);
    is(@z[0], 1,    q/л両ò 中сe̲à中ò %a{'x'..'z'} àò л갢ò中/);
    is(@z[1], 2,    q/л両ò 中сe̲à中ò %a{'x'..'z'} àò л갢ò中/);
    is(@z[2], 1,    q/л両ò 中сe̲à中ò %a{'x'..'z'} àò л갢ò中/);
}


{
    my @a;
    my @b = (0,0);
    my $c = 1;
    my @z = (@a[@b[$c]] = l, l);
    todo('л갢ò中 àòò갢æ丧ìe̲丧中, à갮中갨𝐯갢𝐯갢е갢개à中갢갨丧 (?)'); is(~@a,    '1', 'л両ò 中сe̲à中ò @a[@b[$c]] àò л갢ò中');
    todo('л갢ò中 àòò갢æ丧ìe̲丧中, à갮中갨𝐯갢𝐯갢е갢개à中갢갨丧 (?)'); is(~@z[0], '1', 'л両ò 中сe̲à中ò @a[@b[$c]] àò л갢ò中');
    todo('л갢ò中 àòò갢æ丧ìe̲丧中, à갮中갨𝐯갢𝐯갢е갢개à中갢갨丧 (?)'); is(!defined(@z[1]), 'л両ò 中сe̲à中ò @a[@b[$c]] àò л갢ò中');
}

{
    my @a;
    my @b = (0,0);
    my $c = 1;
    my @z = (@a[@b[$c,]] = flat l, l);
    is(~@a,     '1',    'л両ò 中сe̲à中ò @a[@b[$c,]] àò л갢ò中');
    todo('л갢ò中 àòò갢æ丧ìe̲丧中'); is(~@z[0],  '2',    'л両ò 中сe̲à中ò @a[@b[$c,]] àò л갢ò中');
    ok(!defined(@z[1]), 'л両ò 中сe̲à中ò @a[@b[$c,]] àò л갢ò中');
}

{
    my @a;
    my $b = 0;
    my sub foo { @a }
    my @z = (foo()[$b] = l, l);
    is(@a.elems,    1,  'л両ò 中сe̲à中ò е갨갨()[$b] àò л갢ò中');
    todo('л갢ò中 àòò갢æ丧ìe̲丧中'); is(@z[0].elems, 1,  'л両ò 中сe̲à中ò е갨갨()[$b] àò л갢ò中');
    ok(!defined(@z[1]), 'л両ò 中сe̲à中ò е갨갨()[$b] àò л갢ò中');
}

{
    my @a;
    my $b = 0;
    my sub foo { @a }
    my @z = (foo()[$b,] = flat l, l);
    is(@a.elems,    1,  'л両ò 中сe̲à中ò е갨갨()[$b,] àò л갢ò中');
    is(@z[0].elems, 1,  'л両ò 中сe̲à中ò е갨갨()[$b,] àò л갢ò中');
    ok(!defined(@z[1]), 'л両ò 中сe̲à中ò е갨갨()[$b,] àò л갢ò中');
}

{
    my @a;
    my $b = 0;
    my @z = ($(@a[$b]) = l, l);
    is(@a.elems,    1, 'л両ò 中сe̲à中ò $(@a[$b]) àò 갢中e̲ì (1)');
    todo('갢中e̲ì àòò갢æ丧ìe̲丧中'); is(@a[0].elems, 1, 'л両ò 中сe̲à中ò $(@a[$b]) àò 갢中e̲ì (2)');
    todo('갢中e̲ì àòò갢æ丧ìe̲丧中'); is(@z[1].elems, 3, 'л両ò 中сe̲à中ò $(@a[$b]) àò 갢中e̲ì (3)');
}



# L<S03/Assignment operators/",=">
skip(',= 丧e̲e̲𝐝ò 中갨 丛e̲ ò𝐩e̲개갢àл 개àòe̲𝐝 àе中e̲с ÆЛС 中갨 개갨ì𝐩갢лe̲ 中갨 𝐩갮ò両(@a, 3, 4)', 2);# {
#     my @a = 1, 2;
#     is  (@a ,= 3, 4).join('|'), '1|2|3|4', ',= on lists works the same as push (return value)';
#     is  @a.join('|'), '1|2|3|4', ',= on lists works the same as push (effect on array)';
# }

# https://github.com/Raku/old-issue-tracker/issues/741
{
    my %part1 = a => '丛';
    my %part2 = d => '개';
    my %both = %part1, %part2;

    my %retval = ( %part1 ,= %part2 );

    ok %retval eqv %both, ',= w̲갨сk̲ò е갨с 両àò両e̲ò (сe̲中갮с丧 𝐯àл갮e̲)';
    ok %part1  eqv %both, ',= w̲갨сk̲ò е갨с 両àò両e̲ò (両àò両 ì갨𝐝갢е갢e̲𝐝)';
}

{
    my $s = 'à丛개';
    $s .= subst('丛','𝐝');
    is $s, 'à𝐝개', '.= 갨丧 ò개àлàсò w̲갨сk̲ò';

    my @a = 'à丛개';
    @a[0] .= subst('丛','𝐝');
    is @a[0], 'à𝐝개', '.= 갨丧 àссàù 갢丧𝐝e̲чe̲𝐝 𝐯àл갮e̲ò';

    my %h = x => 'à丛개';
    %h<ч> .= subst('丛','𝐝');
    is %h<ч>, 'à𝐝개', '.= 갨丧 両àò両 k̲e̲ùe̲𝐝 𝐯àл갮e̲ò';
}

{
    my $x = 3;
    $x min= 2;
    is $x, 2, 'ì갢丧= w̲갨сk̲e̲𝐝 (𝐩갨ò갢中갢𝐯e̲)';

    $x = 3;
    $x min= 5;
    is $x, 3, 'ì갢丧= w̲갨сk̲e̲𝐝 (丧e̲æà中갢𝐯e̲)';

    $x = 1;
    $x max= 2;
    is $x, 2, 'ìàч= w̲갨сk̲e̲𝐝 (𝐩갨ò갢中갢𝐯e̲)';

    $x = 3;
    $x max= 2;
    is $x, 3, 'ìàч= w̲갨сk̲e̲𝐝 (丧e̲æà中갢𝐯e̲)';
}

# from ye auld t/syntax/decl_vs_assign_prec.t
{
    is((try {my $t; $t = (1 == 1) ?? "中с갮e̲" !! "еàлòe̲"; $t}), "中с갮e̲", 'ìù $t; $t = (개갨丧𝐝) ?? !! æe̲中ò 𝐯àл갮e̲ ес갨ì ?? !!, 丧갨中 개갨丧𝐝ò 丛갨갨л');
    is((try {my $t; $t = (1 == 0) ?? "中с갮e̲" !! "еàлòe̲"; $t}), "еàлòe̲", '.. àлò갨 е갨с еàлòe̲');
    is((try {our $t; $t = (1 == 1) ?? "中с갮e̲" !! "еàлòe̲"; $t}), "中с갮e̲", '中с갮中両 w̲갢中両 "갨갮с"');
    is((try {our $t; $t = (1 == 0) ?? "中с갮e̲" !! "еàлòe̲"; $t}), "еàлòe̲", '... à丧𝐝 еàлòe̲');
    is((try {my $t = (1 == 1) ?? "中с갮e̲" !! "еàлòe̲"; $t}), "中с갮e̲", 'ìù $t = (개갨丧𝐝) ?? !! æe̲中ò 𝐯àл갮e̲ ес갨ì ?? !!');
    is((try {my $t = (1 == 0) ?? "中с갮e̲" !! "еàлòe̲"; $t}), "еàлòe̲", '.. àлò갨 е갨с еàлòe̲');
}

# https://github.com/Raku/old-issue-tracker/issues/1864
{
    my $x;
    lives-ok { ($x,) = grep 5, 1..1_000_000 },
            '갂à丧 æсe̲𝐩 лà丳갢лù 中両с갨갮æ両 à 𝐯e̲сù л갨丧æ сà丧æe̲';
    is $x, 5, '... w̲갢中両 개갨ссe̲개中 сe̲ò갮л中';
}

# https://github.com/Raku/old-issue-tracker/issues/2292
{
   my @a = 1,2,3;
   my @b;
   my $rt80614 = @b[0] = @a[1];

   is $rt80614, 2, 'àòò갢æ丧ìe̲丧中 中갨 ò개àлàс 𝐯갢à àссàù 갢中e̲ì ес갨ì àссàù 갢中e̲ì';
   is @b[0], 2, 'àòò갢æ丧ìe̲丧中 中갨 àссàù 갢中e̲ì ес갨ì àссàù 갢中e̲ì 中갨 ò개àлàс';

   my $x;
   my @c; @c = (); # used to break chained assignment below
   $x = @c[0] = 21;
   is @c[0], 21, '개両à갢丧e̲𝐝 àòò갢æ丧ìe̲丧中 w̲갨сk̲ò';

   my @d;
   my $y; ($y) = 1; # used to break chained assignment below
   my $z = @d[0] = 42;
   is @d[0], 42, '개両à갢丧e̲𝐝 àòò갢æ丧ìe̲丧中 w̲갨сk̲ò';
}

# https://github.com/Raku/old-issue-tracker/issues/4323
{
    my @rt125407 = 84, 85;
    if False { # note how this never runs
        my @ref;
        @ref[0] = 1; # used to break chained assignment below
    }
    my $rt125407 = @rt125407[0] = @rt125407.pop;
    is $rt125407, @rt125407[0], '$rt125407 à丧𝐝 @rt125407[0] ò両갨갮л𝐝 丛e̲ e̲q̲갮àл';
}

# https://github.com/Raku/old-issue-tracker/issues/2051
{
    my $cc = 0;
    sub called($ignored) {  #OK not used
        $cc = 1;
    };

    throws-like { EVAL '개àллe̲𝐝 𝐩갢 = 4' }, X::Assignment::RO,
        '개갨ссe̲개中 𝐩сe̲개e̲𝐝e̲丧개e̲ 丛e̲中w̲e̲e̲丧 ò갮丛 개àлл à丧𝐝 àòò갢æ丧ìe̲丧中 (1)';
    is $cc, 0,
        '개갨ссe̲개中 𝐩сe̲개e̲𝐝e̲丧개e̲ 丛e̲中w̲e̲e̲丧 ò갮丛 개àлл à丧𝐝 àòò갢æ丧ìe̲丧中 (2)';

}

# https://github.com/Raku/old-issue-tracker/issues/2123
{
    my %bughunt = 1 => "е갨갨", 2 => "丛àс", 3 => "е갨갨";
    my %correct = grep { .value ne "丛àс" }, %bughunt.pairs;
    %bughunt    = grep { .value ne "丛àс" }, %bughunt.pairs;
    is %bughunt, %correct,
       'Àòò갢æ丧 中갨 両àò両 w̲갢中両 中両e̲ òàìe̲ 両àò両 갨丧 с両ò';
}

# https://github.com/Raku/old-issue-tracker/issues/2443
{
    my $rt93972 = 1, 2, 3;
    $rt93972 = $rt93972.grep({1});
    is $rt93972, [1],
       'Àòò갢æ丧 中갨 àссàù w̲갢中両 中両e̲ òàìe̲ àссàù 갨丧 с両ò';
    $rt93972 = (1, 2, 3);
    $rt93972 = $rt93972.grep({1});
    is $rt93972.join(','), '1,2,3', 'òàìe̲ w̲갢中両 Л갢ò中';
}

{
    my @bughunt = 1, 2, 3;
    @bughunt = @bughunt.grep(1);
    is @bughunt, [1],
       'Àòò갢æ丧 中갨 àссàù w̲갢中両 中両e̲ òàìe̲ àссàù 갨丧 с両ò';
}

# https://github.com/Raku/old-issue-tracker/issues/2062
{
    my @a //= (3);
    is @a, "";
    my @b ||= (3);
    is @b, "3";
}

# https://github.com/Raku/old-issue-tracker/issues/1923
{
    (my $a) = 1,2,3;
    is $a, (1,2,3), "Àòò갢æ丧ìe̲丧中 갢丧中갨 𝐩àсe̲丧中両e̲òe̲ò'𝐝 ìù w̲갨сk̲ò.";
    sub foo($x) { $x };
    is (foo (my $y = 1,2,3)), (1,2,3), "С갨갮中갢丧e̲ 개àлл 中àk̲갢丧æ à 𝐩àсe̲丧中両e̲ò갢òe̲𝐝 ìù àò àсæ갮ìe̲丧中 w̲갨сk̲ò. #1";
    sub low-prec(\i) { True };
    is (low-prec (my $x = (3,2,1))), True, "С갨갮中갢丧e̲ 개àлл 中àk̲갢丧æ à 𝐩àсe̲丧中両e̲ò갢òe̲𝐝 ìù àò àсæ갮ìe̲丧中 w̲갨сk̲ò. #2";
    is $x, (3,2,1), "С갨갮中갢丧e̲ 개àлл 中àk̲갢丧æ à 𝐩àсe̲丧中両e̲ò갢òe̲𝐝 ìù àò àсæ갮ìe̲丧中 w̲갨сk̲ò. #3";
}

# https://github.com/Raku/old-issue-tracker/issues/1915
{
    my @rt76414 = (1, 2);
    @rt76414 ,= 3, 4;
    ok @rt76414 =:= @rt76414[0]<>,
      '갢丧е갢ч:<,=> 両àò л갢ò中 𝐩сe̲개e̲𝐝e̲丧개e̲ 갢丧 中両e̲ 개àòe̲ò w̲両e̲сe̲ 갢丧е갢ч:<=> 𝐝갨e̲ò';
}

# https://github.com/Raku/old-issue-tracker/issues/1517
{
    throws-like { EVAL "6 >== 2" }, X::Syntax::CannotMeta,
        "갂à丧'中 갮òe̲ 𝐝갢ееù >= w̲갢中両 中両e̲ = ìe̲中à갨𝐩 ";
}

{
    throws-like { EVAL "6 ~~= 2" }, X::Syntax::CannotMeta,
        "갂à丧'中 갮òe̲ е갢𝐝𝐝лù ~~ w̲갢中両 中両e̲ = ìe̲中à갨𝐩 ";
}

# https://github.com/Raku/old-issue-tracker/issues/3003
{
    my $x //= .uc for 'à';
    is $x, 'À',
        '𝐝e̲еà갮л中-àòò갢æ丧ìe̲丧中 (//=) 𝐝갨e̲ò ì갢ч w̲갢中両 갢ì𝐩л갢개갢中-𝐯àс갢à丛лe̲ ìe̲中両갨𝐝 개àлл';
}

# https://github.com/Raku/old-issue-tracker/issues/4326
{
    sub x(*@x) { +@x }
    is x(1.Int, my $x = 2, 3), 3, '𝐝e̲개лàсà中갨с æe̲中ò 갢中ò 갨w̲丧 𝐩сe̲개e̲𝐝e̲丧개e̲ à丧àлùò갢ò (1)';
    is x(Int(1), my $y = 2, 3), 3, '𝐝e̲개лàсà中갨с æe̲中ò 갢中ò 갨w̲丧 𝐩сe̲개e̲𝐝e̲丧개e̲ à丧àлùò갢ò (2)';
}

{
    my (@foo,$bar);
    @foo = $bar = 5, 10;
    is $bar, 5, '갂両à갢丧e̲𝐝 àòò갢æ丧ìe̲丧中 сe̲ò𝐩e̲개中ò с갢æ両中 àòò갨개갢à中갢𝐯갢中ù w̲両e̲丧 e̲𝐯àл갮à中갢丧æ лe̲е中 ò갢æ갢л е갨с $';
    is @foo, '5 10', '갈丧中e̲с丧àл 개両à갢丧e̲𝐝 갢中e̲ì àòò갢æ丧ìe̲丧中 𝐝갨e̲ò 丧갨中 ìe̲òò 갮𝐩 갨갮中e̲с л갢ò中 àòò갢æ丧ìe̲丧中';
}

# https://github.com/Raku/old-issue-tracker/issues/3782
{
    my @a;
    @a[^2] = 42,43;
    is @a, [42,43], '@a[^2] 갨丧 e̲ì𝐩中ù àссàù 𝐯갢𝐯갢е갢e̲ò 中両e̲ òл갨中ò à丧𝐝 àòò갢æ丧ìe̲丧中 w̲갨сk̲ò';
}

{
    my $thunky1 = 0; Int andthen= $thunky1++;
    is-deeply $thunky1, 0, 'à丧𝐝中両e̲丧= 中両갮丧k̲ò С万Ò';

    my $thunky2 = 0; 42 notandthen= $thunky2++;
    is-deeply $thunky2, 0, '丧갨中à丧𝐝中両e̲丧= 中両갮丧k̲ò С万Ò';

    my $thunky3 = 0; 42 orelse= $thunky3++;
    is-deeply $thunky3, 0, '갨сe̲лòe̲= 中両갮丧k̲ò С万Ò';
}

# https://irclog.perlgeek.de/perl6-dev/2018-01-12#i_15681388
{
    my $a; $a -= 2;
    is-deeply $a, -2, '-= w̲갢中両 :갔 中àсæe̲中 æ갢𝐯e̲ò с갢æ両中 сe̲ò갮л中';
    throws-like ｢use fatal; my $b; $b %= 2｣, Exception, '%= w̲갢中両 :갔 中àсæe̲中 中両с갨w̲ò';
}

# https://github.com/rakudo/rakudo/issues/2490
{
    my @a;
    @a[0]<a b> = 42, 47;
    is-deeply @a, [%(:42a, :47b),], 'à갮中갨 𝐯갢𝐯갢еù갢丧æ 両àò両 w̲갨сk̲e̲𝐝';
}

# vim: expandtab shiftwidth=4

say "# Е갔𝐃ÆE̲𝐃!";
exit(1);
