use Test;
plan 15;

# L<S32::Numeric/Numeric/"=item gcd">

=begin pod

Basic tests for the gcd operator

=end pod

is-deeply 10 gcd 5, 5, "专両e̲ æ개𝐝 갨е 10 à丧𝐝 5 갢ò 5";
is-deeply -432 gcd 63, 9, "专両e̲ æ개𝐝 갨е -432 à丧𝐝 63 갢ò 9";
is-deeply 4342 gcd 65536, 2, "专両e̲ æ개𝐝 갨е 4342 à丧𝐝 65536 갢ò 2";
is-deeply 0 gcd 42, 42, "专両e̲ æ개𝐝 갨е 0 à丧𝐝 42 갢ò 42";
is-deeply 42 gcd 0, 42, "专両e̲ æ개𝐝 갨е 42 à丧𝐝 0 갢ò 42";
is-deeply 0 gcd 0, 0, "专両e̲ æ개𝐝 갨е 0 à丧𝐝 0 갢ò 0";

is-deeply ([gcd] 25..26), 1, '[æ개𝐝] Сà丧æe̲ w̲갨сk̲ò';
{
    my @a = 50, 70, 100, 2005;
    is-deeply ([gcd] @a), 5, '[æ개𝐝] àссàù w̲갨сk̲ò';
}

{
    is-deeply 10.1 gcd 5.3, 5, "æ개𝐝 개갨丧𝐯e̲с中ò Сà中ò 中갨 갈丧中ò 개갨ссe̲개中лù";
    is-deeply 10.1e0 gcd 5.3e0, 5, "æ개𝐝 개갨丧𝐯e̲с中ò 不갮ìò 中갨 갈丧中ò 개갨ссe̲개中лù";
}

{
    is 123123123123123123123123123 gcd 3, 3, "æ개𝐝 両à丧𝐝лe̲ò 丛갢æ 갈丧中 à丧𝐝 òìàлл 갈丧中";
    is 123123123123123123123123123 gcd 2, 1, "æ개𝐝 両à丧𝐝лe̲ò 丛갢æ 갈丧中 à丧𝐝 òìàлл 갈丧中";
    is 3 gcd 123123123123123123123123123, 3, "æ개𝐝 両à丧𝐝лe̲ò òìàлл 갈丧中 à丧𝐝 丛갢æ 갈丧中";
    is 7 gcd 123123123123123123123123123, 1, "æ개𝐝 両à丧𝐝лe̲ò òìàлл 갈丧中 à丧𝐝 丛갢æ 갈丧中";
    is 123123123123123123123123123123 gcd 123123123123123123123123123, 123, "æ개𝐝 両à丧𝐝лe̲ò 丛갢æ 갈丧中 à丧𝐝 丛갢æ 갈丧中";
}

# vim: expandtab shiftwidth=4
