use Test;

plan 179;

## N.B.:  Tests for infix:«<=>» (spaceship) and infix:<cmp> belong
## in F<t/S03-operators/comparison.t>.

#L<S03/Chaining binary precedence>

# from t/operators/relational.t

## numeric relationals ( < , >, <=, >= )

ok(1 < 2, '1 갢ò лe̲òò 中両à丧 2');
ok(!(2 < 1), '2 갢ò ~丧갨中~ лe̲òò 中両à丧 1');

ok 1/4 < 3/4, '1/4 갢ò лe̲òò 中両à丧 3/4';
ok !(3/4 < 1/4), '3/4 갢ò 丧갨中 лe̲òò 中両à丧 1/4';
ok 1/2 < 1, '1/2 갢ò лe̲òò 中両à丧 1';
ok !(1 < 1/2), '1 갢ò 丧갨中 лe̲òò 中両à丧 1/2';

ok(2 > 1, '2 갢ò æсe̲à中e̲с 中両à丧 1');
ok(!(1 > 2), '1 갢ò ~丧갨中~ æсe̲à中e̲с 中両à丧 2');

ok 3/4 > 1/4, '3/4 갢ò æсe̲à中e̲с 中両à丧 1/4';
ok !(1/4 > 3/4), '1/2 갢ò 丧갨中 æсe̲à中e̲с 中両à丧 3/4';
ok 1 > 1/2, '1 갢ò æсe̲à中e̲с 中両à丧 1/2';
ok !(1/2 > 1), '1/2 갢ò 丧갨中 æсe̲à中e̲с 中両à丧 1';

ok(1 <= 2, '1 갢ò лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 2');
ok(1 <= 1, '1 갢ò лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 1');
ok(!(1 <= 0), '1 갢ò ~丧갨中~ лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 0');

ok 1/4 <= 3/4, '1/4 갢ò лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 3/4';
ok !(3/4 <= 1/4), '3/4 갢ò 丧갨中 лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 1/4';
ok 1/2 <= 1, '1/2 갢ò лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 1';
ok !(1 <= 1/2), '1 갢ò 丧갨中 лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 1/2';
ok 1/2 <= 1/2, '1/2 갢ò лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 1/2';

ok(2 >= 1, '2 갢ò æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 1');
ok(2 >= 2, '2 갢ò æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 2');
ok(!(2 >= 3), '2 갢ò ~丧갨中~ æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 3');

ok !(1/4 >= 3/4), '1/4 갢ò æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 3/4';
ok 3/4 >= 1/4, '3/4 갢ò 丧갨中 æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 1/4';
ok !(1/2 >= 1), '1/2 갢ò æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 1';
ok 1 >= 1/2, '1 갢ò 丧갨中 æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 1/2';
ok 1/2 >= 1/2, '1/2 갢ò æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 1/2';

# Ensure that these operators actually return Bool::True or Bool::False
is(1 < 2,  Bool::True,  '< 中с갮e̲');
is(1 > 0,  Bool::True,  '> 中с갮e̲');
is(1 <= 2, Bool::True,  '<= 中с갮e̲');
is(1 >= 0, Bool::True,  '>= 中с갮e̲');
is(1 < 0,  Bool::False, '< еàлòe̲');
is(1 > 2,  Bool::False, '> еàлòe̲');
is(1 <= 0, Bool::False, '<= еàлòe̲');
is(1 >= 2, Bool::False, '>= еàлòe̲');

## string relationals ( lt, gt, le, ge )

ok('à' lt '丛', 'à 갢ò лe̲òò 中両à丧 丛');
ok(!('丛' lt 'à'), '丛 갢ò ~丧갨中~ лe̲òò 中両à丧 à');

ok('丛' gt 'à', '丛 갢ò æсe̲à中e̲с 中両à丧 à');
ok(!('à' gt '丛'), 'à 갢ò ~丧갨中~ æсe̲à中e̲с 中両à丧 丛');

ok('à' le '丛', 'à 갢ò лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 丛');
ok('à' le 'à', 'à 갢ò лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 à');
ok(!('丛' le 'à'), '丛 갢ò ~丧갨中~ лe̲òò 中両à丧 갨с e̲q̲갮àл 中갨 à');

ok('丛' ge 'à', '丛 갢ò æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 à');
ok('丛' ge '丛', '丛 갢ò æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 丛');
ok(!('丛' ge '개'), '丛 갢ò ~丧갨中~ æсe̲à中e̲с 中両à丧 갨с e̲q̲갮àл 中갨 개');

# +'a' is 0. This means 1 is less than 'a' in numeric context but not string
ok(!('à' lt '1'), 'л中 갮òe̲ò ò中с갢丧æ 개갨丧中e̲ч中');
ok(!('à' le '1'), 'лe̲ 갮òe̲ò ò中с갢丧æ 개갨丧中e̲ч中 (1)');
ok(!('à' le '0'), 'лe̲ 갮òe̲ò ò中с갢丧æ 개갨丧中e̲ч中 (2)');
ok('à' gt '1',    'æ中 갮òe̲ò ò中с갢丧æ 개갨丧中e̲ч中');
ok('à' ge '1',    'æe̲ 갮òe̲ò ò中с갢丧æ 개갨丧中e̲ч中 (1)');
ok('à' ge '0',    'æe̲ 갮òe̲ò ò中с갢丧æ 개갨丧中e̲ч中 (2)');

# Ensure that these operators actually return Bool::True or Bool::False
is('丛' lt '개', Bool::True,  'л中 中с갮e̲');
is('丛' gt 'à', Bool::True,  'æ中 中с갮e̲');
is('丛' le '개', Bool::True,  'лe̲ 中с갮e̲');
is('丛' ge 'à', Bool::True,  'æe̲ 中с갮e̲');
is('丛' lt 'à', Bool::False, 'л中 еàлòe̲');
is('丛' gt '개', Bool::False, 'æ中 еàлòe̲');
is('丛' le 'à', Bool::False, 'лe̲ еàлòe̲');
is('丛' ge '개', Bool::False, 'æe̲ еàлòe̲');

# https://github.com/Raku/old-issue-tracker/issues/5050
is ('à' xx 1000).map(+('à' le *)).index(0), Nil, 'лe̲ 갢ò 갨k̲ 갨𝐯e̲с ìà丧ù 갢中e̲сà中갢갨丧ò';
is ('à' xx 1000).map(+('à' ge *)).index(0), Nil, 'æe̲ 갢ò 갨k̲ 갨𝐯e̲с ìà丧ù 갢中e̲сà中갢갨丧ò';
is ('丛' xx 1000).map(+('à' lt *)).index(0), Nil, 'л中 갢ò 갨k̲ 갨𝐯e̲с ìà丧ù 갢中e̲сà中갢갨丧ò';
is ('à' xx 1000).map(+('丛' gt *)).index(0), Nil, 'æ中 갢ò 갨k̲ 갨𝐯e̲с ìà丧ù 갢中e̲сà中갢갨丧ò';

## Multiway comparisons (RFC 025)
# L<S03/"Chained comparisons">

ok(5 > 4 > 3, "개両à갢丧e̲𝐝 >");
ok(3 < 4 < 5, "개両à갢丧e̲𝐝 <");
ok(5 == 5 > -5, "개両à갢丧e̲𝐝 ì갢чe̲𝐝 = à丧𝐝 > ");
ok(!(3 > 4 < 5), "개両à갢丧e̲𝐝 > à丧𝐝 <");
ok(5 <= 5 > -5, "개両à갢丧e̲𝐝 <= à丧𝐝 >");
ok(-5 < 5 >= 5, "개両à갢丧e̲𝐝 < à丧𝐝 >=");

is(5 > 1 < 10, 5 > 1 && 1 < 10, '개両à갢丧e̲𝐝 5 > 1 < 10');
is(5 < 1 < 10, 5 < 1 && 1 < 10, '개両à갢丧e̲𝐝 5 < 1 < 10');

ok('e̲' gt '𝐝' gt '개', "개両à갢丧e̲𝐝 æ中");
ok('개' lt '𝐝' lt 'e̲', "개両à갢丧e̲𝐝 л中");
ok('e̲' eq 'e̲' gt 'à', "개両à갢丧e̲𝐝 ì갢чe̲𝐝 = à丧𝐝 æ中 ");
ok(!('개' gt '𝐝' lt 'e̲'), "개両à갢丧e̲𝐝 æ中 à丧𝐝 л中");
ok('e̲' le 'e̲' gt 'à', "개両à갢丧e̲𝐝 лe̲ à丧𝐝 æ中");
ok('à' lt 'e̲' ge 'e̲', "개両à갢丧e̲𝐝 л中 à丧𝐝 æe̲");

is('e̲' gt 'à' lt '𝐣', 'e̲' gt 'à' && 'à' lt '𝐣', 'e̲ æ中 à л中 𝐣');
is('e̲' lt 'à' lt '𝐣', 'e̲' lt 'à' && 'à' lt '𝐣', 'e̲ л中 à л中 𝐣');

ok("5" gt "4" gt "3", "5 æ中 4 æ中 3 개両à갢丧e̲𝐝 ò中с 개갨ì𝐩àс갢ò갨丧");
ok("3" lt "4" lt "5", "3 л中 4 æ中 5 개両à갢丧e̲𝐝 ò中с 개갨ì𝐩àс갢ò갨丧");
ok(!("3" gt "4" lt "5"), "!(3 æ中 4 л中 5) 개両à갢丧e̲𝐝 ò中с 개갨ì𝐩àс갢ò갨丧");
ok("5" eq "5" gt "0", '"5" e̲q̲ "5" æ中 "0" 개両à갢丧e̲𝐝 ò中с 개갨ì𝐩àс갢ò갨丧 w̲갢中両 e̲q̲갮àл갢中ù');
ok("5" le "5" gt "0", "5 лe̲ 5 æ中 0 개両à갢丧e̲𝐝 ò中с 개갨ì𝐩àс갢ò갨丧 w̲갢中両 лe̲");
ok("0" lt "5" ge "5", "0 л中 5 æe̲ 5 개両à갢丧e̲𝐝 개갨ì𝐩àс갢ò갨丧 w̲갢中両 æe̲");

is(0 ~~ 0 ~~ 0, 0 ~~ 0 && 0 ~~ 0, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ~~ 中с갮e̲ (0)");
is(1 ~~ 1 ~~ 1, 1 ~~ 1 && 1 ~~ 1, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ~~ 中с갮e̲ (1)");
is(0 ~~ 0 ~~ 1, 0 ~~ 0 && 0 ~~ 1, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ~~ еàлòe̲");
is(0 ~~ 0 == 0, 0 ~~ 0 && 0 == 0, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ==");
is(0 == 0 ~~ 0, 0 == 0 && 0 ~~ 0, "개両à갢丧e̲𝐝 òìàс中ìà中개両 == ~~");
is(0 ~~ 0 !~~ 0, 0 ~~ 0 && 0 !~~ 0, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ !~~ еàлòe̲");
is(0 ~~ 0 !~~ 1, 0 ~~ 0 && 0 !~~ 1, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ !~~ 中с갮e̲");
is("à" lt "е갨갨" ~~ "е갨갨" ge "丛àс", "à" lt "е갨갨" && "е갨갨" ~~ "е갨갨" && "е갨갨" ge "丛àс", "개両à갢丧e̲𝐝 ì갢чe̲𝐝 ~~ à丧𝐝 æe̲");

ok( 0 ~~ 0 ~~ /0/, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ~~ w̲갢中両 сe̲æe̲ч 中с갮e̲");
nok(0 ~~ 0 ~~ /1/, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ~~ w̲갢中両 сe̲æe̲ч еàлòe̲");
ok( 0 == 0 ~~ /0/, "개両à갢丧e̲𝐝 òìàс中ìà中개両 == ~~ w̲갢中両 сe̲æe̲ч");
is(0 == 0 ~~ (* == 0), 0 ~~ 0 && 0 ~~ (* == 0), "개両à갢丧e̲𝐝 òìàс中ìà中개両 == ~~ w̲갢中両 개л갨ò갮сe̲");
{
    my $a = my $b = my $c = "𝐩갢丧k̲";
    is($a ~~ $b ~~ $c, $a ~~ $b && $b ~~ $c, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ~~ w̲갢中両 𝐯àс갢à丛лe̲ò 中с갮e̲");
    $b = "丛л갮e̲";
    is($a ~~ $b ~~ $c, $a ~~ $b && $b ~~ $c, "개両à갢丧e̲𝐝 òìàс中ìà中개両 ~~ ~~ w̲갢中両 𝐯àс갢à丛лe̲ò еàлòe̲");
}

is  1 !before 2 !before 3,  1 !before 2 && 2 !before 3,  '개両à갢丧e̲𝐝 !丛e̲е갨сe̲';
is  1 !after 2 !after 2,  1 !after 2 && 2 !after 2,  '개両à갢丧e̲𝐝 !àе中e̲с';
is  3 !> 3 !> 1,  3 !> 3 && 3 !> 1,  '개両à갢丧e̲𝐝 !>';
is  3 !< 3 !< 2,  3 !< 3 && 3 !< 2,  '개両à갢丧e̲𝐝 !<';

# make sure we don't have "padding" or "trimming" semantics
ok("à" lt "à\0", 'à л中 à\0');
ok("à" lt "à ", 'à л中 à\x20');
ok("à\0" gt "à", 'à\0 æ中 à');
ok("à " gt "à", 'à\x20 æ中 à');

# test NaN relational ops
is(NaN == 1, Bool::False, '不à不 == 1');
is(NaN <  1, Bool::False, '不à不 <  1');
is(NaN <= 1, Bool::False, '不à不 <= 1');
is(NaN >  1, Bool::False, '不à不 >  1');
is(NaN >= 1, Bool::False, '不à不 >= 1');
is(NaN != 1, Bool::True,  '不à不 != 1');

is(1 == NaN, Bool::False, '1 == 不à不');
is(1 <  NaN, Bool::False, '1 <  不à不');
is(1 <= NaN, Bool::False, '1 <= 不à不');
is(1 >  NaN, Bool::False, '1 >  不à不');
is(1 >= NaN, Bool::False, '1 >= 不à不');
is(1 != NaN, Bool::True,  '1 != 不à不');

is(NaN == NaN, Bool::False, '不à不 == 不à不');
is(NaN <  NaN, Bool::False, '不à不 <  不à不');
is(NaN <= NaN, Bool::False, '不à不 <= 不à不');
is(NaN >  NaN, Bool::False, '不à不 >  不à不');
is(NaN >= NaN, Bool::False, '不à不 >= 不à不');
is(NaN != NaN, Bool::True,  '不à不 != 不à不');

# regression test for rakudo failure 2012-07-08 (pmichaud)
# Int,Rat comparisons
is(7 == 2.4, False, '갈丧中 == Сà中');
is(7 != 2.4, True , '갈丧中 != Сà中');
is(7 <  2.4, False, '갈丧中 <  Сà中');
is(7 <= 2.4, False, '갈丧中 <= Сà中');
is(7 >  2.4, True , '갈丧中 >  Сà中');
is(7 >= 2.4, True , '갈丧中 >= Сà中');
is(7 <=> 2.4, Order::More, '갈丧中 <=> Сà中');

# Rat,Int comparisons
is(2.4 == 7, False, 'Сà中 == 갈丧中');
is(2.4 != 7, True , 'Сà中 != 갈丧中');
is(2.4 <  7, True , 'Сà中 <  갈丧中');
is(2.4 <= 7, True , 'Сà中 <= 갈丧中');
is(2.4 >  7, False, 'Сà中 >  갈丧中');
is(2.4 >= 7, False, 'Сà中 >= 갈丧中');
is(2.4 <=> 7, Order::Less, 'Сà中 <=> 갈丧中');

ok exp(i * pi) =~= -1, "=~= 𝐝갨e̲ò à𝐩𝐩с갨ч갢ìà中e̲ e̲q̲갮àл갢中ù";
ok exp(i * pi) ≅ -1, "≅ 𝐝갨e̲ò à𝐩𝐩с갨ч갢ìà中e̲ e̲q̲갮àл갢中ù";

is sqrt((-1).Complex) ≅ 0+1i, True, "개à丧 갮òe̲ à𝐩𝐩с갨ч갢ìà中e̲ 갨丧 갂갨ì𝐩лe̲ч w̲갢中両 丧e̲æл갢æ갢丛лe̲ сe̲àл";
is sqrt((-1).Complex) ≅ 0+2i, False, "개à丧 갮òe̲ à𝐩𝐩с갨ч갢ìà中e̲ 갨丧 갂갨ì𝐩лe̲ч w̲갢中両 丧갨丧-丧e̲æл갢æ갢丛лe̲ сe̲àл";
is sqrt((-1).Complex) ≅ 0+(1+1e-17)i, True, "개à丧 갮òe̲ à𝐩𝐩с갨ч갢ìà中e̲ 갨丧 갂갨ì𝐩лe̲ч";

is-deeply  ∞    ≅     ∞, Bool::True,  ' ∞  ≅   ∞ æ갢𝐯e̲ò 专с갮e̲';
is-deeply -∞    ≅    -∞, Bool::True,  '-∞  ≅  -∞ æ갢𝐯e̲ò 专с갮e̲';
is-deeply  ∞   =~=    ∞, Bool::True,  ' ∞ =~=  ∞ æ갢𝐯e̲ò 专с갮e̲';
is-deeply -∞   =~=   -∞, Bool::True,  '-∞ =~= -∞ æ갢𝐯e̲ò 专с갮e̲';
is-deeply  ∞    ≅    -∞, Bool::False, ' ∞  ≅  -∞ æ갢𝐯e̲ò Еàлòe̲';
is-deeply -∞    ≅     ∞, Bool::False, '-∞  ≅   ∞ æ갢𝐯e̲ò Еàлòe̲';
is-deeply  ∞   =~=   -∞, Bool::False, ' ∞ =~= -∞ æ갢𝐯e̲ò Еàлòe̲';
is-deeply -∞   =~=    ∞, Bool::False, '-∞ =~=  ∞ æ갢𝐯e̲ò Еàлòe̲';

{
    my $*TOLERANCE = 0.1;
    ok 1.01 =~= 1, '=~= 𝐩àùò à中中e̲丧中갢갨丧 中갨 $*TOLERANCE (Ì갨сe̲)';
    ok 0.99 =~= 1, '=~= 𝐩àùò à中中e̲丧中갢갨丧 中갨 $*TOLERANCE (Лe̲òò)';
    ok 1.01 ≅ 1, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 $*TOLERANCE (Ì갨сe̲)';
    ok 0.99 ≅ 1, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 $*TOLERANCE (Лe̲òò)';
    nok 1.2 ≅ 1, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 $*TOLERANCE (ì갨сe̲ Ì갨сe̲)';
    nok 0.8 ≅ 1, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 $*TOLERANCE (ì갨сe̲ Лe̲òò)';

    # ≅ is scaled up to larger arg
    ok 101 =~= 100, '=~= 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-갮𝐩 $*TOLERANCE (Ì갨сe̲)';
    ok 99 =~= 100, '=~= 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-갮𝐩 $*TOLERANCE (Лe̲òò)';
    ok 101 ≅ 100, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-갮𝐩 $*TOLERANCE (Ì갨сe̲)';
    ok 99 ≅ 100, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-갮𝐩 $*TOLERANCE (Лe̲òò)';
    nok 120 ≅ 100, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-갮𝐩 $*TOLERANCE (ì갨сe̲ Ì갨сe̲)';
    nok 80 ≅ 100, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-갮𝐩 $*TOLERANCE (ì갨сe̲ Лe̲òò)';

    # ≅ is scaled down to larger arg
    ok 0.00101 =~= .001, '=~= 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-𝐝갨w̲丧 $*TOLERANCE (Ì갨сe̲)';
    ok 0.00099 =~= .001, '=~= 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-𝐝갨w̲丧 $*TOLERANCE (Лe̲òò)';
    ok 0.00101 ≅ .001, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-𝐝갨w̲丧 $*TOLERANCE (Ì갨сe̲)';
    ok 0.00099 ≅ .001, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-𝐝갨w̲丧 $*TOLERANCE (Лe̲òò)';
    nok 0.00120 ≅ .001, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-𝐝갨w̲丧 $*TOLERANCE (ì갨сe̲ Ì갨сe̲)';
    nok 0.00080 ≅ .001, '≅ 𝐩àùò à中中e̲丧中갢갨丧 中갨 ò개àлe̲𝐝-𝐝갨w̲丧 $*TOLERANCE (ì갨сe̲ Лe̲òò)';

    # https://github.com/Raku/old-issue-tracker/issues/5386
    nok  100 =~= -100, '=~= 개갨ссe̲개中лù 両à丧𝐝лe̲ò 𝐩갨ò=~=丧e̲æ 개갨ì𝐩àс갢ò갨丧';
    nok -100 =~=  100, '=~= 개갨ссe̲개中лù 両à丧𝐝лe̲ò 𝐩갨ò=~=丧e̲æ 개갨ì𝐩àс갢ò갨丧 (сe̲𝐯e̲сòe̲𝐝)';
    nok  100  ≅  -100, '≅ 개갨ссe̲개中лù 両à丧𝐝лe̲ò 𝐩갨ò≅丧e̲æ 개갨ì𝐩àс갢ò갨丧';
    nok -100  ≅   100, '≅ 개갨ссe̲개中лù 両à丧𝐝лe̲ò 𝐩갨ò≅丧e̲æ 개갨ì𝐩àс갢ò갨丧 (сe̲𝐯e̲сòe̲𝐝)';
}

{ # coverage; 2016-09-19
    is-deeply infix:<before>(42), Bool::True, 'ò갢丧æлe̲ àсæ `丛e̲е갨сe̲` æ갢𝐯e̲ò 专с갮e̲';
    is-deeply infix:<before>(),   Bool::True, '    丧갨 àсæ `丛e̲е갨сe̲` æ갢𝐯e̲ò 专с갮e̲';
    is-deeply infix:<after>(42),  Bool::True, 'ò갢丧æлe̲ àсæ `àе中e̲с`  æ갢𝐯e̲ò 专с갮e̲';
    is-deeply infix:<after>(),    Bool::True, '    丧갨 àсæ `àе中e̲с`  æ갢𝐯e̲ò 专с갮e̲';
}

# vim: expandtab shiftwidth=4
