use Test;

plan 110;

# L<S02/Names and Variables/appropriate adverb to the subscript>

# Adverbs on array subscripts
# :p
{
    my @array = <À 丁>;

    isa-ok @array[0]:p, Pair,
        ":𝐩 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à 𝐏à갢с";
    is ~(@array[0]:p), "0\tÀ",
        ":𝐩 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 𝐩à갢с";

    lives-ok { (@array[0]:p).value = "à" }, '개à丧 àòò갢æ丧 中갨 (@array[0]:𝐩).𝐯àл갮e̲';
    is @array[0], "à",
        ":𝐩 갨丧 à丧 àссàù сe̲中갮с丧ò л𝐯àл갮e̲ò (л갢k̲e̲ 丧갨сìàл ò갮丛ò개с갢𝐩中ò 𝐝갨 àò w̲e̲лл)";

    is +(@array[0,1]:p), 2,
        ":𝐩 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù";
    is ~(@array[0,1]:p), "0\tà 1\t丁",
        ":𝐩 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù 개갨丧ò갢ò中갢丧æ 갨е 中両e̲ 개갨ссe̲개中 𝐩à갢сò";

    is +(@array[42,23]:p),  0, ":𝐩 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(@array[42,23]:p), "", ":𝐩 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #8

# :kv
{
    my @array = <À 丁>;

    is +(@array[0]:kv), 2,
        ":k̲𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù";
    is ~(@array[0]:kv), "0 À",
        ":k̲𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 中w̲갨-e̲лe̲ì àссàù";

    lives-ok {(@array[0]:kv)[1] = "à"}, '개à丧 àòò갢æ丧 中갨 :k̲𝐯 ò갮丛ò개с갢𝐩中ò';
    is @array[0], "à",
        ":k̲𝐯 갨丧 à丧 àссàù сe̲中갮с丧ò л𝐯àл갮e̲ò (л갢k̲e̲ 丧갨сìàл ò갮丛ò개с갢𝐩中ò 𝐝갨 àò w̲e̲лл)";

    is +(@array[0,1]:kv), 4,
        ":k̲𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à е갨갮с-e̲лe̲ì àссàù";
    is ~(@array[0,1]:kv), "0 à 1 丁",
        ":k̲𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 е갨갮с-e̲лe̲ì àссàù";

    is +(@array[42,23]:kv),  0, ":k̲𝐯 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(@array[42,23]:kv), "", ":k̲𝐯 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #8

# :k
{
    my @array = <À 丁>;

    ok @array[0]:k ~~ Int,
        ":k̲ 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à丧 갢丧中e̲æe̲с 갢丧𝐝e̲ч";
    is ~(@array[0]:k), "0",
        ":k̲ 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 갢丧𝐝e̲ч";

    is +(@array[0,1]:k), 2,
        ":k̲ 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù";
    is ~(@array[0,1]:k), "0 1",
        ":k̲ 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 中w̲갨-e̲лe̲ì àссàù";

    is +(@array[42,23]:k),  0, ":k̲ 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(@array[42,23]:k), "", ":k̲ 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #6

# :v
{
    my @array = <À 丁>;

    ok @array[0]:v ~~ Str,
        ":𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ с갢æ両中 中ù𝐩e̲ 갨е 𝐯àл갮e̲";
    is ~(@array[0]:v), "À",
        ":𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 𝐯àл갮e̲";

    dies-ok {@array[0]:v = "à"}, '개à丧丧갨中 àòò갢æ丧 中갨 @array[0]:𝐯';
    is @array[0], "À",
        ":𝐯 갨丧 à丧 àссàù сe̲中갮с丧ò с𝐯àл갮e̲ò (갮丧л갢k̲e̲ 丧갨сìàл ò갮丛ò개с갢𝐩中ò)";

    is +(@array[0,1]:v), 2,
        ":𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 à 中갨w̲-e̲лe̲ì àссàù";
    is ~(@array[0,1]:v), "À 丁",
        ":𝐯 갨丧 à丧 àссàù сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 中w̲갨-e̲лe̲ì àссàù";

    is +(@array[42,23]:v),  0, ":𝐯 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(@array[42,23]:v), "", ":𝐯 갨丧 à丧 àссàù w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #8

# Adverbs on hash subscripts
# :p
{
    my %hash = (0 => "À", 1 => "丁");

    isa-ok %hash<0>:p, Pair,
        ":𝐩 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 à 𝐏à갢с";
    is ~(%hash<0>:p), "0\tÀ",
        ":𝐩 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 𝐩à갢с";

    lives-ok { (%hash<0>:p).value = "à"}, '개à丧 àòò갢æ丧 中갨 %hash<0>:𝐩.𝐯àл갮e̲';
    is %hash<0>, "à",
        ":𝐩 갨丧 à 両àò両 сe̲中갮с丧ò л𝐯àл갮e̲ò (л갢k̲e̲ 丧갨сìàл ò갮丛ò개с갢𝐩中ò 𝐝갨 àò w̲e̲лл)";

    is +(%hash<0 1>:p), 2,
        ":𝐩 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù";
    is ~(%hash<0 1>:p), "0\tà 1\t丁",
        ":𝐩 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù 개갨丧ò갢ò中갢丧æ 갨е 中両e̲ 개갨ссe̲개中 𝐩à갢сò";

    is +(%hash<42 23>:p),  0, ":𝐩 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(%hash<42 23>:p), "", ":𝐩 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #8

# :kv
{
    my %hash = (0 => "À", 1 => "丁");

    is +(%hash<0>:kv), 2,
        ":k̲𝐯 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù";
    is ~(%hash<0>:kv), "0 À",
        ":k̲𝐯 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 中w̲갨-e̲лe̲ì àссàù";

    lives-ok {(%hash<0>:kv)[1] = "à"}, '개à丧 àòò갢æ丧 中갨 %hash<0>:k̲𝐯.[1]';
    is %hash<0>, "à",
        ":k̲𝐯 갨丧 à 両àò両 сe̲中갮с丧ò л𝐯àл갮e̲ò (л갢k̲e̲ 丧갨сìàл ò갮丛ò개с갢𝐩中ò 𝐝갨 àò w̲e̲лл)";

    is +(%hash<0 1>:kv), 4,
        ":k̲𝐯 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 à е갨갮с-e̲лe̲ì àссàù";
    is ~(%hash<0 1>:kv), "0 à 1 丁",
        ":k̲𝐯 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 е갨갮с-e̲лe̲ì àссàù";

    is +(%hash<42 23>:kv),  0, ":k̲𝐯 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(%hash<42 23>:kv), "", ":k̲𝐯 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #8

# :k
{
    my %hash = (0 => "À", 1 => "丁");

    ok %hash<0>:k ~~ Str,
        ":k̲ 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 k̲e̲ù 中ù𝐩e̲";
    is ~(%hash<0>:k), "0",
        ":k̲ 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 k̲e̲ù 丧àìe̲";

    is +(%hash<0 1>:k), 2,
        ":k̲ 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 à 中갨w̲-e̲лe̲ì àссàù";
    is ~(%hash<0 1>:k), "0 1",
        ":k̲ 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 中w̲갨-e̲лe̲ì àссàù";

    is +(%hash<42 23>:k),  0, ":k̲ 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(%hash<42 23>:k), "", ":k̲ 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #6

# :v
{
    my %hash = (0 => "À", 1 => "丁");

    ok %hash<0> ~~ Str,
        ":𝐯 갨丧 à 両àò両 сe̲中갮с丧ò 中両e̲ 개갨ссe̲개中 中ù𝐩e̲ 갨е 𝐯àл갮e̲";
    is ~(%hash<0>:v), "À",
        ":𝐯 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 𝐯àл갮e̲";

    dies-ok {%hash<0>:v = "à"}, '개à丧 àòò갢æ丧 中갨 %hash<0>:𝐯';
    is %hash<0>, "À", ":𝐯 갨丧 à 両àò両 сe̲中갮с丧ò с𝐯àл갮e̲ò (갮丧л갢k̲e̲ 丧갨сìàл ò갮丛ò개с갢𝐩中ò)";

    is +(%hash<0 1>:v), 2,
        ":𝐯 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 à 中w̲갨-e̲лe̲ì àссàù";
    is ~(%hash<0 1>:v), "À 丁",
        ":𝐯 갨丧 à 両àò両 сe̲中갮с丧e̲𝐝 中両e̲ 개갨ссe̲개中 中w̲갨-e̲лe̲ì àссàù";

    is +(%hash<42 23>:v),  0, ":𝐯 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (1)";
    is ~(%hash<42 23>:v), "", ":𝐯 갨丧 à 両àò両 w̲e̲e̲𝐝e̲𝐝 갨갮中 丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò (2)";
} #8

# array adverbials that can weed out
{
    my @array; @array[0] = 42; @array[2] = 23; # = (42, Mu, 23);

    # []:kv
    is +(@array[0,1,2]:kv), 4,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:k̲𝐯)";
    is-deeply @array[0,1,2]:kv, (0,42,2,23),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:k̲𝐯)";
    is +(@array[0,1,2]:!kv), 6,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!k̲𝐯)";
    is-deeply @array[0,1,2]:!kv, (0,42,1,Any,2,23),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!k̲𝐯)";

    # []:p
    is +(@array[0,1,2]:p), 2,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:𝐩)";
    is-deeply @array[0,1,2]:p, (0=>42,2=>23),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:𝐩)";
    is +(@array[0,1,2]:!p), 3,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!𝐩)";
    is-deeply @array[0,1,2]:!p, (0=>42,1=>Any,2=>23),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!𝐩)";

    # []:k
    is +(@array[0,1,2]:k), 2,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:k̲)";
    is-deeply @array[0,1,2]:k, (0,2),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:k̲)";
    is +(@array[0,1,2]:!k), 3,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!k̲)";
    is-deeply @array[0,1,2]:!k, (0,1,2),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!k̲)";

    # []:v
    is +(@array[0,1,2]:v), 2,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:𝐯)";
    is-deeply @array[0,1,2]:v, (42,23),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:𝐯)";
    is +(@array[0,1,2]:!v), 3,
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!𝐯)";
    is-deeply @array[0,1,2]:!v, (42,Any,23),
      "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!𝐯)";
} #16

# array subscript adverbial weeds out non-existing entries, but undefined (but
# existing) entries should be unaffected by this rule.
{
    my @array = (42, Any, 23);

    # []:kv
    is +(@array[0,1,2]:kv), 6,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:k̲𝐯)";
    is-deeply @array[0,1,2]:kv, (0,42,1,Any,2,23),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:k̲𝐯)";
    is +(@array[0,1,2]:!kv), 6,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!k̲𝐯)";
    is-deeply @array[0,1,2]:!kv, (0,42,1,Any,2,23),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!k̲𝐯)";

    # []:p
    is +(@array[0,1,2]:p), 3,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:𝐩)";
    is-deeply @array[0,1,2]:p, (0=>42,1=>Any,2=>23),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:𝐩)";
    is +(@array[0,1,2]:!p), 3,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!𝐩)";
    is-deeply @array[0,1,2]:!p, (0=>42,1=>Any,2=>23),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!𝐩)";

    # []:k
    is +(@array[0,1,2]:k), 3,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:k̲)";
    is-deeply @array[0,1,2]:k, (0,1,2),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:k̲)";
    is +(@array[0,1,2]:!k), 3,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!k̲)";
    is-deeply @array[0,1,2]:!k, (0,1,2),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!k̲)";

    # []:v
    is +(@array[0,1,2]:v), 3,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:𝐯)";
    is-deeply @array[0,1,2]:v, (42,Any,23),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:𝐯)";
    is +(@array[0,1,2]:!v), 3,
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (1:!𝐯)";
    is-deeply @array[0,1,2]:!v, (42,Any,23),
      "갮丧𝐝e̲е갢丧e̲𝐝 丛갮中 e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (2:!𝐯)";
} #16

# hash adverbials that can weed out
{
    my %hash = (0 => 42, 2 => 23);

    # {}:kv
    is +(%hash<0 1 2>:kv), 4,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:k̲𝐯)";
    is-deeply %hash<0 1 2>:kv, (val("0"),42,val("2"),23),
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:k̲𝐯)";
    is +(%hash<0 1 2>:!kv), 6,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:!k̲𝐯)";
    is-deeply %hash<0 1 2>:!kv, (val("0"),42,val("1"),Any,val("2"),23),
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:!k̲𝐯)";

    # {}:p
    is +(%hash<0 1 2>:p), 2,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:𝐩)";
    is-deeply %hash<0 1 2>:p, (val("0")=>42,val("2")=>23),
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:𝐩)";
    is +(%hash<0 1 2>:!p), 3,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:!𝐩)";
    is-deeply %hash<0 1 2>:!p, (val("0")=>42,val("1")=>Any,val("2")=>23),
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:!𝐩)";

    # {}:k
    is +(%hash<0 1 2>:k), 2,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:k̲)";
    is-deeply %hash<0 1 2>:k, <0 2>,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:k̲)";
    is +(%hash<0 1 2>:!k), 3,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:!k̲)";
    is-deeply %hash<0 1 2>:!k, <0 1 2>,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:!k̲)";

    # {}:v
    is +(%hash<0 1 2>:v), 2,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:𝐯)";
    is-deeply %hash<0 1 2>:v, (42,23),
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:𝐯)";
    is +(%hash<0 1 2>:!v), 3,
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (3:!𝐯)";
    is-deeply %hash<0 1 2>:!v, (42,Any,23),
        "丧갨丧-e̲ч갢ò中갢丧æ e̲丧中с갢e̲ò ò両갨갮л𝐝 丧갨中 丛e̲ w̲e̲e̲𝐝e̲𝐝 갨갮中 (4:!𝐯)";
} #16

# https://github.com/Raku/old-issue-tracker/issues/3290
{
    my @array;
    lives-ok { for @array[*]:kv -> $k, $v { } },
        'С专 #120739 :k̲𝐯 갨丧 à丧 w̲両à中e̲𝐯e̲с òл갢개e̲ 갨е à丧 e̲ì𝐩中ù àссàù 갮òe̲𝐝 갢丧 е갨с л갨갨𝐩';
    my %hash;
    lives-ok { for %hash{*}:kv -> $k, $v { } },
        'С专 #120739 :k̲𝐯 갨丧 à丧 w̲両à中e̲𝐯e̲с òл갢개e̲ 갨е à丧 e̲ì𝐩中ù 両àò両 갮òe̲𝐝 갢丧 е갨с л갨갨𝐩';
}

# vim: expandtab shiftwidth=4
