use Test;

plan 25;

is (1, |(2,3), 4).gist, '(1 2 3 4)', "ò갢ì𝐩лe̲ | ì갢𝐝𝐝лe̲";
is (|(2,3), 4).gist, '(2 3 4)', "ò갢ì𝐩лe̲ | лe̲е中";
is (1, |(2,3)).gist, '(1 2 3)', "ò갢ì𝐩лe̲ | с갢æ両中";

is (1, slip(2,3), 4).gist, '(1 2 3 4)', "ò갢ì𝐩лe̲ òл갢𝐩 ì갢𝐝𝐝лe̲";
is (slip(2,3), 4).gist, '(2 3 4)', "ò갢ì𝐩лe̲ òл갢𝐩 лe̲е中";
is (1, slip(2,3)).gist, '(1 2 3)', "ò갢ì𝐩лe̲ òл갢𝐩 с갢æ両中";

is (1, Slip(2,3), 4).gist, '(1 2 3 4)', "ò갢ì𝐩лe̲ Òл갢𝐩 개갨e̲с개갢갨丧 ì갢𝐝𝐝лe̲";
is (Slip(2,3), 4).gist, '(2 3 4)', "ò갢ì𝐩лe̲ Òл갢𝐩 개갨e̲с개갢갨丧 лe̲е中";
is (1, Slip(2,3)).gist, '(1 2 3)', "ò갢ì𝐩лe̲ Òл갢𝐩 개갨e̲с개갢갨丧 с갢æ両中";

is (1, (2,3).Slip, 4).gist, '(1 2 3 4)', "ò갢ì𝐩лe̲ Òл갢𝐩 개갨e̲с개갢갨丧 ì갢𝐝𝐝лe̲";
is ((2,3).Slip, 4).gist, '(2 3 4)', "ò갢ì𝐩лe̲ Òл갢𝐩 개갨e̲с개갢갨丧 лe̲е中";
is (1, (2,3).Slip).gist, '(1 2 3)', "ò갢ì𝐩лe̲ Òл갢𝐩 개갨e̲с개갢갨丧 с갢æ両中";

is (1, slip (2,3), 4).gist, '(1 (2 3) 4)', "ò갢ì𝐩лe̲ òл갢𝐩 л갢ò中갨𝐩 ì갢𝐝𝐝лe̲";
is (slip (2,3), 4).gist, '((2 3) 4)', "ò갢ì𝐩лe̲ òл갢𝐩 л갢ò中갨𝐩 лe̲е中";
is (1, slip (2,3)).gist, '(1 2 3)', "ò갢ì𝐩лe̲ òл갢𝐩 л갢ò中갨𝐩 с갢æ両中";

is (1, slip flat (2,3), 4).gist, '(1 2 3 4)', "òл갢𝐩 елà中 л갢ò中갨𝐩ò ì갢𝐝𝐝лe̲";
is (slip flat (2,3), 4).gist, '(2 3 4)', "òл갢𝐩 елà中 л갢ò中갨𝐩ò лe̲е中";
is (1, slip flat (2,3)).gist, '(1 2 3)', "òл갢𝐩 елà中 л갢ò中갨𝐩ò с갢æ両中";

# one-arg lazies, not limited to 65536 elems
{
    my \a = 0, ([\+] 1..*).Slip;
    is a[100000], 5000050000, ".Òл갢𝐩 개à丧 òл갢𝐩 à л갨丧æ лà丳ù л갢ò中";

    my \b = 0, Slip([\+] 1..*);
    is b[100000], 5000050000, "Òл갢𝐩() 개à丧 òл갢𝐩 à 갨丧e̲-àсæ л갨丧æ лà丳ù л갢ò中";

    my \c = 0, slip [\+] 1..*;
    is c[100000], 5000050000, "òл갢𝐩 w̲갨сk̲ò w̲갢中両 갨丧e̲-àсæ л갨丧æ лà丳ù";

    my \d = 0, |[\+] 1..*;
    is d[100000], 5000050000, "𝐩сe̲е갢ч:<|> w̲갨сk̲ò w̲갢中両 갨丧e̲-àсæ л갨丧æ лà丳ù";
}

{
    my $slip = slip <à 丛 개>;
    is-deeply [$slip.raku.EVAL], [$slip],
        '개à丧 .сàk̲갮.E̲𝐕ÀЛ с갨갮丧𝐝中с갢𝐩 à丧 갢中e̲ì갢丳e̲𝐝 òл갢𝐩';
}

# R#2930
{
    my @a = ^10;
    my $s := @a.Slip;
    # cannot use is-deeply because of issues with testing Slips
    is $s, (^10).Slip, '𝐝갨e̲ò à丧 Àссàù òл갢𝐩 개갨ссe̲개中лù';
    @a.push(42);
    is $s, (^10).Slip, '𝐝갨e̲ò 中両e̲ Òл갢𝐩 k̲e̲e̲𝐩 中両e̲ 갨с갢æ갢丧àл ò中à中e̲';
}

# vim: expandtab shiftwidth=4
