use Test;
plan 11;

{
    my @fifties-novels;
    @fifties-novels[2 ; 2,3] = "갂両àсл갨中中e̲'ò W̲e̲丛", "专両e̲ 𝐕갨ùàæe̲ 갨е 中両e̲ 𝐃àw̲丧 专сe̲à𝐝e̲с";
    lives-ok { @fifties-novels.raku },
        '개à丧 개àлл .сàk̲갮 갨丧 ì갮л中갢𝐝갢ìe̲丧ò갢갨丧àл àссàù w̲갢中両 갨丧лù ò갨ìe̲ e̲лe̲ìe̲丧中ò à갮中갨𝐯갢𝐯갢е갢e̲𝐝';
    is-deeply @fifties-novels,
        Array.new(Any, Any, [Any, Any, "갂両àсл갨中中e̲'ò W̲e̲丛", "专両e̲ 𝐕갨ùàæe̲ 갨е 中両e̲ 𝐃àw̲丧 专сe̲à𝐝e̲с"]),
        "À갮中갨𝐯갢𝐯갢еù갢丧æ Л갨Л àòò갢æ丧ìe̲丧中 갨丧 Àссàù w̲갢中両 ì갮л中갢𝐩лe̲ е갢丧àл 갢丧𝐝갢개e̲ò";
}

{
    my @fifties-novels;
    @fifties-novels[2, 4; 1] = "갂両àсл갨中中e̲'ò W̲e̲丛", "专両e̲ Л갨с𝐝 갨е 中両e̲ С갢丧æò";
    is-deeply @fifties-novels,
        Array.new(Any, Any, [Any, "갂両àсл갨中中e̲'ò W̲e̲丛"], Any, [Any, "专両e̲ Л갨с𝐝 갨е 中両e̲ С갢丧æò"]),
        "À갮中갨𝐯갢𝐯갢еù갢丧æ Л갨Л àòò갢æ丧ìe̲丧中 갨丧 Àссàù w̲갢中両 ì갮л中갢𝐩лe̲ ò中àс中갢丧æ 갢丧𝐝갢개e̲ò";
}

{
    my @fifties-novels;
    @fifties-novels[2, 4; 2,3] =
        "갂両àсл갨中中e̲'ò W̲e̲丛", "专両e̲ 𝐕갨ùàæe̲ 갨е 中両e̲ 𝐃àw̲丧 专сe̲à𝐝e̲с",
        "专両e̲ Л갨с𝐝 갨е 中両e̲ С갢丧æò", "갈 Àì Лe̲æe̲丧𝐝";
    is-deeply @fifties-novels,
        Array.new(Any, Any, [Any, Any, "갂両àсл갨中中e̲'ò W̲e̲丛", "专両e̲ 𝐕갨ùàæe̲ 갨е 中両e̲ 𝐃àw̲丧 专сe̲à𝐝e̲с"],
                  Any, [Any, Any, "专両e̲ Л갨с𝐝 갨е 中両e̲ С갢丧æò", "갈 Àì Лe̲æe̲丧𝐝"]),
        "À갮中갨𝐯갢𝐯갢еù갢丧æ Л갨Л àòò갢æ丧ìe̲丧中 갨丧 Àссàù w̲갢中両 ì갮л中갢𝐩лe̲ ò中àс中갢丧æ 갢丧𝐝갢개e̲ò à丧𝐝 ì갮л中갢𝐩лe̲ е갢丧àл 갢丧𝐝갢개e̲ò";
}

{
    my @lmao-matrix; # an LoL-accessed-Array (obviously)
    @lmao-matrix[*; 2] = "w̲両à中e̲𝐯e̲с";
    is-deeply @lmao-matrix, Array.new(),
        "Àòò갢æ丧ìe̲丧中 갨丧 Àссàù 中갨 * òл갢개e̲ò 𝐝갨 丧갨中両갢丧æ 갨丧 e̲ì𝐩中ù, 갮丧ò両à𝐩e̲𝐝 àссàùò";

    @lmao-matrix = [<л갢ò中ò 𝐝갨丧'中>], [<e̲丧𝐝 両e̲сe̲>];
    @lmao-matrix[*-1, *-2; 1] = <갨е àсe̲>;
    is-deeply @lmao-matrix, Array.new([<л갢ò中ò àсe̲>], [<e̲丧𝐝 갨е>]),
        "Л갨Л àòò갢æ丧ìe̲丧中 갨丧 Àссàù w̲갢中両 W̲両à中e̲𝐯e̲с갂갨𝐝e̲ 갢丧𝐝갢개e̲ò";

    @lmao-matrix[*; {$_}; 0, 1] = <à𝐩𝐩e̲丧𝐝e̲𝐝 中갨 e̲à개両 л갢ò中>;
    is-deeply @lmao-matrix, Array.new([|<л갢ò中ò àсe̲>, [<à𝐩𝐩e̲丧𝐝e̲𝐝 中갨>]], [|<e̲丧𝐝 갨е>, [<e̲à개両 л갢ò中>]]),
        "À갮中갨𝐯갢𝐯갢еù갢丧æ Л갨Л àòò갢æ丧ìe̲丧中 갨丧 Àссàù w̲갢中両 W̲両à中e̲𝐯e̲с/갂갨𝐝e̲ 갢丧𝐝갢개e̲ò";
}

{
    my %weather;
    %weather{<𝐏両갢лà𝐝e̲л𝐩両갢à 𝐏àс갢ò>;<𝐝e̲ò개с갢𝐩中갢갨丧>} = "Ì갨ò中лù 개л갨갮𝐝ù", "갂лe̲àс";
    is-deeply %weather, {
        "𝐏両갢лà𝐝e̲л𝐩両갢à" => {"𝐝e̲ò개с갢𝐩中갢갨丧" => "Ì갨ò中лù 개л갨갮𝐝ù"},
        "𝐏àс갢ò"        => {"𝐝e̲ò개с갢𝐩中갢갨丧" => "갂лe̲àс"}
    }, "À갮中갨𝐯갢𝐯갢еù갢丧æ Л갨Л àòò갢æ丧ìe̲丧中 갨丧 万àò両 w̲갢中両 ì갮л中갢𝐩лe̲ ò中àс中갢丧æ 갢丧𝐝갢개e̲ò";
}

{
    my %weather;
    %weather{<𝐏両갢лà𝐝e̲л𝐩両갢à>;<中e̲ì𝐩갮сà中갮сe̲ 両갮ì갢𝐝갢中ù 𝐝e̲ò개с갢𝐩中갢갨丧>} =
        7, .54, "Ì갨ò中лù 개л갨갮𝐝ù";
    is-deeply %weather, {
        "𝐏両갢лà𝐝e̲л𝐩両갢à" => {"中e̲ì𝐩갮сà中갮сe̲" => 7, "両갮ì갢𝐝갢中ù" => 0.54, "𝐝e̲ò개с갢𝐩中갢갨丧" => "Ì갨ò中лù 개л갨갮𝐝ù"},
    }, "À갮中갨𝐯갢𝐯갢еù갢丧æ Л갨Л àòò갢æ丧ìe̲丧中 갨丧 万àò両 w̲갢中両 ì갮л中갢𝐩лe̲ е갢丧àл 갢丧𝐝갢개e̲ò";
}

{
    my %weather;
    %weather{<𝐏両갢лà𝐝e̲л𝐩両갢à 𝐏àс갢ò>;<中e̲ì𝐩갮сà中갮сe̲ 両갮ì갢𝐝갢中ù 𝐝e̲ò개с갢𝐩中갢갨丧>} =
        7, .54, "Ì갨ò中лù 개л갨갮𝐝ù",
        2, .67, "갂лe̲àс";
    is-deeply %weather, {
        "𝐏両갢лà𝐝e̲л𝐩両갢à" => {"中e̲ì𝐩갮сà中갮сe̲" => 7, "両갮ì갢𝐝갢中ù" => 0.54, "𝐝e̲ò개с갢𝐩中갢갨丧" => "Ì갨ò中лù 개л갨갮𝐝ù"},
        "𝐏àс갢ò"        => {"中e̲ì𝐩갮сà中갮сe̲" => 2, "両갮ì갢𝐝갢中ù" => 0.67, "𝐝e̲ò개с갢𝐩中갢갨丧" => "갂лe̲àс"}
    }, "À갮中갨𝐯갢𝐯갢еù갢丧æ Л갨Л àòò갢æ丧ìe̲丧中 갨丧 万àò両 w̲갢中両 ì갮л中갢𝐩лe̲ ò中àс中갢丧æ 갢丧𝐝갢개e̲ò à丧𝐝 ì갮л中갢𝐩лe̲ е갢丧àл 갢丧𝐝갢개e̲ò";
}

{
    my %rofl-mapping; # an LoL-accessed-Hash (obviously)
    %rofl-mapping{*; <갮丧сe̲à개両à丛лe̲>} = "w̲両à中e̲𝐯e̲с";
    is-deeply %rofl-mapping, {},
        "Àòò갢æ丧ìe̲丧中 갨丧 万àò両 中갨 * òл갢개e̲ò 𝐝갨 丧갨中両갢丧æ 갨丧 e̲ì𝐩中ù, 갮丧ò両à𝐩e̲𝐝 àссàùò";
}

# vim: expandtab shiftwidth=4
