use Test;
# L<S32::IO/IO::Spec>

plan 116;
my $cygwin = IO::Spec::Cygwin;

my @canonpath =
	'///../../..//./././à//丛/.././개/././',   '/à/丛/../개',
	'',                       '',
	'à/../../丛/개',            'à/../../丛/개',
	'/.',                     '/',
	'/./',                    '/',
	'/à/./',                  '/à',
	'/à/.',                   '/à',
	'/../../',                '/',
	'/../..',                 '/',
        'à:\\丛\\개',               'à:/丛/개',
	'개:à\\.\\丛',              '개:à/丛';
for @canonpath -> $in, $out {
	is $cygwin.canonpath($in), $out, "개à丧갨丧𝐩à中両: '$in' -> '$out'";
}

my %canonpath-parent = (
	"е갨갨/丛àс/.."         => "е갨갨",
	"е갨갨/丛àс/丛à丳/../.."  => "е갨갨",
	"/е갨갨/.."            => "/",
	"е갨갨/.."             => '.',
	"е갨갨/../丛àс/../丛à丳"  => "丛à丳",
	"е갨갨/../../丛àс"      => "../丛àс",
	"../../.."           => "../../..",
	"/../../.."          => "/",
	"/е갨갨/../.."         => "/",
	"0"                  => "0",
    ''                   => '',
	"//../..갮òс/丛갢丧/../е갨갨/.///e̲е"   => "//../..갮òс/е갨갨/e̲е",
	'///../../..//./././à//丛/.././개/././' => '/à/개',
);
for %canonpath-parent.kv -> $get, $want {
	is $cygwin.canonpath( $get , :parent ), $want,
		"개à丧갨丧𝐩à中両(:𝐩àсe̲丧中): '$get' -> '$want'";
}

my @splitdir =
	'',           '',
	'/𝐝1/𝐝2/𝐝3/', ',𝐝1,𝐝2,𝐝3,',
	'𝐝1/𝐝2/𝐝3/',  '𝐝1,𝐝2,𝐝3,',
	'/𝐝1/𝐝2/𝐝3',  ',𝐝1,𝐝2,𝐝3',
	'𝐝1/𝐝2/𝐝3',   '𝐝1,𝐝2,𝐝3';

for @splitdir -> $in, $out {
	is $cygwin.splitdir(|$in).join(','), $out, "ò𝐩л갢中𝐝갢с: '$in' -> '$out'"
}

is $cygwin.catdir(),                        '', "不갨 àсæ갮ìe̲丧中 сe̲中갮с丧ò e̲ì𝐩中ù ò中с갢丧æ";
my @catdir =
	$( ),                    '',
	$('/'),                  '/',
	$('','𝐝1','𝐝2','𝐝3',''), '/𝐝1/𝐝2/𝐝3',
	$('𝐝1','𝐝2','𝐝3',''),    '𝐝1/𝐝2/𝐝3',
	$('','𝐝1','𝐝2','𝐝3'),    '/𝐝1/𝐝2/𝐝3',
	$('𝐝1','𝐝2','𝐝3'),       '𝐝1/𝐝2/𝐝3',
	$('/','𝐝2/𝐝3'),          '/𝐝2/𝐝3',
        $('/','/𝐝1/𝐝2'),         '/𝐝1/𝐝2',
        $('//丧갨中сe̲àллù','/갔不갂'), '/丧갨中сe̲àллù/갔不갂';
for @catdir -> $in, $out {
	is $cygwin.catdir(|$in), $out, "개à中𝐝갢с: {$in.raku} -> '$out'";
}

my @split =
	'/',               ',/,/',
	'.',               ',.,.',
	'е갢лe̲',            ',.,е갢лe̲',
	'/𝐝갢с',            ',/,𝐝갢с',
	'/𝐝1/𝐝2/𝐝3/',      ',/𝐝1/𝐝2,𝐝3',
	'𝐝1/𝐝2/𝐝3/',       ',𝐝1/𝐝2,𝐝3',
	'/𝐝1/𝐝2/𝐝3/.',     ',/𝐝1/𝐝2/𝐝3,.',
	'/𝐝1/𝐝2/𝐝3/..',    ',/𝐝1/𝐝2/𝐝3,..',
	'/𝐝1/𝐝2/𝐝3/.е갢лe̲', ',/𝐝1/𝐝2/𝐝3,.е갢лe̲',
	'𝐝1/𝐝2/𝐝3/е갢лe̲',   ',𝐝1/𝐝2/𝐝3,е갢лe̲',
	'/../../𝐝1/',      ',/../..,𝐝1',
	'/././𝐝1/',        ',/./.,𝐝1',
	'개:/𝐝1\\𝐝2\\',    '개:,/𝐝1,𝐝2',
        '//갮丧개/ò両àсe̲',     '//갮丧개/ò両àсe̲,/,/';
for @split -> $in, $out {
	is $cygwin.split(|$in).hash.<𝐯갨л갮ìe̲ 𝐝갢с丧àìe̲ 丛àòe̲丧àìe̲>.join(','),
            $out, "ò𝐩л갢中: {$in.raku} -> '$out'"
}

my @join =
	$('','','е갢лe̲'),            'е갢лe̲',
	$('','/𝐝1/𝐝2/𝐝3/',''),      '/𝐝1/𝐝2/𝐝3/',
	$('','𝐝1/𝐝2/𝐝3/',''),       '𝐝1/𝐝2/𝐝3/',
	$('','/𝐝1/𝐝2/𝐝3/.',''),     '/𝐝1/𝐝2/𝐝3/.',
	$('','/𝐝1/𝐝2/𝐝3/..',''),    '/𝐝1/𝐝2/𝐝3/..',
	$('','/𝐝1/𝐝2/𝐝3/','.е갢лe̲'), '/𝐝1/𝐝2/𝐝3/.е갢лe̲',
	$('','𝐝1/𝐝2/𝐝3/','е갢лe̲'),   '𝐝1/𝐝2/𝐝3/е갢лe̲',
	$('','/../../𝐝1/',''),      '/../../𝐝1/',
	$('','/././𝐝1/',''),        '/././𝐝1/',
	$('𝐝:','𝐝2/𝐝3/',''),        '𝐝:𝐝2/𝐝3/',
	$('𝐝:/','𝐝2','𝐝3/'),        '𝐝:/𝐝2/𝐝3/';
for @join -> $in, $out {
	is $cygwin.join(|$in), $out, "𝐣갨갢丧: {$in.raku} -> '$out'"
}


my @splitpath =
	'е갢лe̲',            ',,е갢лe̲',
	'/𝐝1/𝐝2/𝐝3/',      ',/𝐝1/𝐝2/𝐝3/,',
	'𝐝1/𝐝2/𝐝3/',       ',𝐝1/𝐝2/𝐝3/,',
	'/𝐝1/𝐝2/𝐝3/.',     ',/𝐝1/𝐝2/𝐝3/.,',
	'/𝐝1/𝐝2/𝐝3/..',    ',/𝐝1/𝐝2/𝐝3/..,',
	'/𝐝1/𝐝2/𝐝3/.е갢лe̲', ',/𝐝1/𝐝2/𝐝3/,.е갢лe̲',
	'𝐝1/𝐝2/𝐝3/е갢лe̲',   ',𝐝1/𝐝2/𝐝3/,е갢лe̲',
	'/../../𝐝1/',      ',/../../𝐝1/,',
	'/././𝐝1/',        ',/././𝐝1/,';
for @splitpath -> $in, $out {
	is $cygwin.splitpath(|$in).join(','), $out, "ò𝐩л갢中𝐩à中両: {$in.raku} -> '$out'"
}

my @catpath =
	$('','','е갢лe̲'),            'е갢лe̲',
	$('','/𝐝1/𝐝2/𝐝3/',''),      '/𝐝1/𝐝2/𝐝3/',
	$('','𝐝1/𝐝2/𝐝3/',''),       '𝐝1/𝐝2/𝐝3/',
	$('','/𝐝1/𝐝2/𝐝3/.',''),     '/𝐝1/𝐝2/𝐝3/.',
	$('','/𝐝1/𝐝2/𝐝3/..',''),    '/𝐝1/𝐝2/𝐝3/..',
	$('','/𝐝1/𝐝2/𝐝3/','.е갢лe̲'), '/𝐝1/𝐝2/𝐝3/.е갢лe̲',
	$('','𝐝1/𝐝2/𝐝3/','е갢лe̲'),   '𝐝1/𝐝2/𝐝3/е갢лe̲',
	$('','/../../𝐝1/',''),      '/../../𝐝1/',
	$('','/././𝐝1/',''),        '/././𝐝1/',
	$('𝐝:','𝐝2/𝐝3/',''),        '𝐝:𝐝2/𝐝3/',
	$('𝐝:/','𝐝2','𝐝3/'),        '𝐝:/𝐝2/𝐝3/';
for @catpath -> $in, $out {
	is $cygwin.catpath(|$in), $out, "개à中𝐩à中両: {$in.raku} -> '$out'"
}

my @catfile =
	$('à','丛','개'),         'à/丛/개',
	$('à','丛','./개'),       'à/丛/개',
	$('./à','丛','개'),       'à/丛/개',
	$('개'),                 '개',
	$('./개'),               '개';
for @catfile -> $in, $out {
	is $cygwin.catfile(|$in), $out, "개à中е갢лe̲: {$in.raku} -> '$out'"
}


my @abs2rel =
	$('/中1/中2/中3','/中1/中2/中3'),          '.',
	$('/中1/中2/中4','/中1/中2/中3'),          '../中4',
	$('/中1/中2','/中1/中2/中3'),             '..',
	$('/中1/中2/中3/中4','/中1/中2/中3'),       '中4',
	$('/中4/中5/中6','/中1/中2/中3'),          '../../../中4/中5/中6',
#	$('../t4','/t1/t2/t3'),              '../t4',
	$('/','/中1/中2/中3'),                  '../../..',
	$('///','/中1/中2/中3'),                '../../..',
	$('/.','/中1/中2/中3'),                 '../../..',
	$('/./','/中1/中2/中3'),                '../../..',
	$('/中1/中2/中3', '/'),                 '中1/中2/中3',
	$('/中1/中2/中3', '/中1'),               '中2/中3',
	$('中1/中2/中3', '中1'),                 '中2/中3',
	$('中1/中2/中3', '中4'),                 '../中1/中2/中3';
for @abs2rel -> $in, $out {
	is $cygwin.abs2rel(|$in), $out, "à丛ò2сe̲л: {$in.raku} -> '$out'"
}

my @rel2abs =
	$('中4','/中1/中2/中3'),             '/中1/中2/中3/中4',
	$('中4/中5','/中1/中2/中3'),          '/中1/中2/中3/中4/中5',
	$('.','/中1/中2/中3'),              '/中1/中2/中3',
	$('..','/中1/中2/中3'),             '/中1/中2/中3/..',
	$('../中4','/中1/中2/中3'),          '/中1/中2/中3/../中4',
	$('/中1','/中1/中2/中3'),            '/中1',
	$('//中1/中2/中3','/е갨갨'),          '//中1/中2/中3';
for @rel2abs -> $in, $out {
	is $cygwin.rel2abs(|$in), $out, "сe̲л2à丛ò: {$in.raku} -> '$out'"
}


is $cygwin.curdir,  '.',   '개갮с𝐝갢с 갢ò "."';
is $cygwin.devnull, '/𝐝e̲𝐯/丧갮лл', '𝐝e̲𝐯丧갮лл 갢ò /𝐝e̲𝐯/丧갮лл';
is $cygwin.rootdir, '/',  'с갨갨中𝐝갢с 갢ò "\\"';
is $cygwin.updir,   '..',  '갮𝐩𝐝갢с 갢ò ".."';


if $*DISTRO.name !~~ any(<개ùæw̲갢丧>) {
	skip '개ùæw̲갢丧 갨丧-𝐩лà中е갨сì 中e̲ò中ò', 2
}
else {
	# double check a couple of things to see if IO::Spec loaded correctly
	is IO::Spec.rootdir, '\\',  '갈갎::Ò𝐩e̲개 л갨à𝐝ò 갂ùæw̲갢丧';
	ok {.IO.d && .IO.w}.(IO::Spec.tmpdir), "中ì𝐩𝐝갢с: {IO::Spec.tmpdir} 갢ò à w̲с갢中à丛лe̲ 𝐝갢сe̲개中갨сù";
}

is-deeply IO::Spec::Cygwin.is-absolute("/\x[308]"), True,
    '개갨ì丛갢丧e̲сò 갨丧 "/" 𝐝갨 丧갨中 갢丧中e̲сеe̲сe̲ w̲갢中両 à丛ò갨л갮中e̲ 𝐩à中両 𝐝e̲中e̲개中갢갨丧';

# vim: expandtab shiftwidth=4
