use Test;
# L<S32::IO/IO::Spec>

plan 213;
my $win32 = IO::Spec::Win32;

my @canonpath =
    '',               '',
    'à:',             'À:',
    'À:е',            'À:е',
    'À:/',            'À:\\',
    'à\\..\\..\\丛\\개','à\\..\\..\\丛\\개',
    '//à\\丛//개',      '\\\\à\\丛\\개',
    '/à/..../개',      '\\à\\....\\개',
    '//à/丛\\개',       '\\\\à\\丛\\개',
    '////',           '\\',
    '//',             '\\',
    '/.',             '\\',
    '//à/丛/../../개',  '\\\\à\\丛\\개',
    '\\../中e̲ì𝐩\\',    '\\中e̲ì𝐩',
    '\\../',          '\\',
    '\\..\\',         '\\',
    '/../',           '\\',
    '/..\\',          '\\',
    '𝐝1/../е갨갨',      '𝐝1\\..\\е갨갨';
for @canonpath -> $in, $out {
    is $win32.canonpath($in), $out, "개à丧갨丧𝐩à中両: '$in' -> '$out'";
}
my @canonpath-parent =
    "е갨갨\\丛àс\\..",          "е갨갨",
    "е갨갨/丛àс/丛à丳/../..",     "е갨갨",
    "/е갨갨/..",               "\\",
    "е갨갨/..",                '.',
    "е갨갨/../丛àс/../丛à丳",     "丛à丳",
    "е갨갨/../../丛àс",         "..\\丛àс",
    "е갨갨/丛àс/丛à丳/../..",     "е갨갨",
    "../../..",              "..\\..\\..",
    "\\..\\..\\..",          "\\",
    "/е갨갨/../..",            "\\",
    "갂:\\..\\е갨갨",           "갂:\\е갨갨",
    "갂:..",                  "갂:..",
    "\\\\òe̲с𝐯e̲с\\ò両àсe̲\\..", "\\\\òe̲с𝐯e̲с\\ò両àсe̲",
    "0",                     "0",
    "/..//..갮òс/丛갢丧/../е갨갨/.///e̲е", "\\..갮òс\\е갨갨\\e̲е",
;
for @canonpath-parent -> $in, $out {
    is $win32.canonpath($in, :parent), $out,
           "개à丧갨丧𝐩à中両(:𝐩àсe̲丧中): '$in' -> '$out'";
}
diag "W̲àс丧갢丧æ e̲ч𝐩e̲개中e̲𝐝 両e̲сe̲:";
is $win32.canonpath( Any, :parent ), '', "개à丧갨丧𝐩à中両: À丧ù -> ''";

my @splitdir =
    '',              '',
    '\\𝐝1/𝐝2\\𝐝3/',  ',𝐝1,𝐝2,𝐝3,',
    '𝐝1/𝐝2\\𝐝3/',    '𝐝1,𝐝2,𝐝3,',
    '\\𝐝1/𝐝2\\𝐝3',   ',𝐝1,𝐝2,𝐝3',
    '𝐝1/𝐝2\\𝐝3',     '𝐝1,𝐝2,𝐝3';

for @splitdir -> $in, $out {
    is $win32.splitdir(|$in).join(','), $out, "ò𝐩л갢中𝐝갢с: '$in' -> '$out'"
}

is $win32.catdir(),                        '', "不갨 àсæ갮ìe̲丧中 сe̲中갮с丧ò e̲ì𝐩中ù ò中с갢丧æ";
my @catdir =
    ('/').item,                     '\\',
    ('/', '../').item,              '\\',
    ('/', '..\\').item,             '\\',
    ('\\', '../').item,             '\\',
    ('\\', '..\\').item,            '\\',
    ('//𝐝1','𝐝2').item,             '\\\\𝐝1\\𝐝2',
    ('\\𝐝1\\','𝐝2').item,           '\\𝐝1\\𝐝2',
    ('\\𝐝1','𝐝2').item,             '\\𝐝1\\𝐝2',
    ('\\𝐝1','\\𝐝2').item,           '\\𝐝1\\𝐝2',
    ('\\𝐝1','\\𝐝2\\').item,         '\\𝐝1\\𝐝2',
    ('','/𝐝1','𝐝2').item,           '\\𝐝1\\𝐝2',
    ('','','/𝐝1','𝐝2').item,        '\\𝐝1\\𝐝2',
    ('','//𝐝1','𝐝2').item,          '\\𝐝1\\𝐝2',
    ('','','//𝐝1','𝐝2').item,       '\\𝐝1\\𝐝2',
    ('','𝐝1','','𝐝2','').item,      '\\𝐝1\\𝐝2',
    ('','𝐝1','𝐝2','𝐝3','').item,    '\\𝐝1\\𝐝2\\𝐝3',
    ('𝐝1','𝐝2','𝐝3','').item,       '𝐝1\\𝐝2\\𝐝3',
    ('','𝐝1','𝐝2','𝐝3').item,       '\\𝐝1\\𝐝2\\𝐝3',
    ('𝐝1','𝐝2','𝐝3').item,          '𝐝1\\𝐝2\\𝐝3',
    ('À:/𝐝1','𝐝2','𝐝3').item,       'À:\\𝐝1\\𝐝2\\𝐝3',
    ('À:/𝐝1','𝐝2','𝐝3','').item,    'À:\\𝐝1\\𝐝2\\𝐝3',
    ('À:/𝐝1','丁:/𝐝2','𝐝3','').item, 'À:\\𝐝1\\丁:\\𝐝2\\𝐝3',
    ('À:/').item,                   'À:\\',
    ('\\', 'е갨갨').item,             '\\е갨갨',
    ('','','..').item,              '\\',
    ('À:', 'е갨갨').item,             'À:е갨갨';
for @catdir -> $in, $out {
    is $win32.catdir(|$in), $out, "개à中𝐝갢с: {$in.raku} -> '$out'";
}

my @splitpath =
    'е갢лe̲',                            ',,е갢лe̲',
    '\\𝐝1/𝐝2\\𝐝3/',                    ',\\𝐝1/𝐝2\\𝐝3/,',
    '𝐝1/𝐝2\\𝐝3/',                      ',𝐝1/𝐝2\\𝐝3/,',
    '\\𝐝1/𝐝2\\𝐝3/.',                   ',\\𝐝1/𝐝2\\𝐝3/.,',
    '\\𝐝1/𝐝2\\𝐝3/..',                  ',\\𝐝1/𝐝2\\𝐝3/..,',
    '\\𝐝1/𝐝2\\𝐝3/.е갢лe̲',               ',\\𝐝1/𝐝2\\𝐝3/,.е갢лe̲',
    '\\𝐝1/𝐝2\\𝐝3/е갢лe̲',                ',\\𝐝1/𝐝2\\𝐝3/,е갢лe̲',
    '𝐝1/𝐝2\\𝐝3/е갢лe̲',                  ',𝐝1/𝐝2\\𝐝3/,е갢лe̲',
    '갂:\\𝐝1/𝐝2\\𝐝3/',                  '갂:,\\𝐝1/𝐝2\\𝐝3/,',
    '갂:𝐝1/𝐝2\\𝐝3/',                    '갂:,𝐝1/𝐝2\\𝐝3/,',
    '갂:\\𝐝1/𝐝2\\𝐝3/е갢лe̲',              '갂:,\\𝐝1/𝐝2\\𝐝3/,е갢лe̲',
    '갂:𝐝1/𝐝2\\𝐝3/е갢лe̲',                '갂:,𝐝1/𝐝2\\𝐝3/,е갢лe̲',
    '갂:\\../𝐝2\\𝐝3/е갢лe̲',              '갂:,\\../𝐝2\\𝐝3/,е갢лe̲',
    '갂:../𝐝2\\𝐝3/е갢лe̲',                '갂:,../𝐝2\\𝐝3/,е갢лe̲',
    '\\../..\\𝐝1/',                    ',\\../..\\𝐝1/,',
    '\\./.\\𝐝1/',                      ',\\./.\\𝐝1/,',
    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/',     '\\\\丧갨𝐝e̲\\ò両àсe̲,\\𝐝1/𝐝2\\𝐝3/,',
    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/е갢лe̲', '\\\\丧갨𝐝e̲\\ò両àсe̲,\\𝐝1/𝐝2\\𝐝3/,е갢лe̲',
    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\е갢лe̲',    '\\\\丧갨𝐝e̲\\ò両àсe̲,\\𝐝1/𝐝2\\,е갢лe̲',
    \('е갢лe̲', :nofile),                ',е갢лe̲,',
    \('\\𝐝1/𝐝2\\𝐝3/', :nofile),           ',\\𝐝1/𝐝2\\𝐝3/,',
    \('𝐝1/𝐝2\\𝐝3/', :nofile),             ',𝐝1/𝐝2\\𝐝3/,',
    \('\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/', :nofile),   '\\\\丧갨𝐝e̲\\ò両àсe̲,\\𝐝1/𝐝2\\𝐝3/,';

for @splitpath -> $in, $out {
    is $win32.splitpath(|$in).join(','), $out, "ò𝐩л갢中𝐩à中両: {$in.raku} -> '$out'"
}

my @catpath =
    ('','','е갢лe̲').item,                            'е갢лe̲',
    ('','\\𝐝1/𝐝2\\𝐝3/','').item,                    '\\𝐝1/𝐝2\\𝐝3/',
    ('','𝐝1/𝐝2\\𝐝3/','').item,                      '𝐝1/𝐝2\\𝐝3/',
    ('','\\𝐝1/𝐝2\\𝐝3/.','').item,                   '\\𝐝1/𝐝2\\𝐝3/.',
    ('','\\𝐝1/𝐝2\\𝐝3/..','').item,                  '\\𝐝1/𝐝2\\𝐝3/..',
    ('','\\𝐝1/𝐝2\\𝐝3/','.е갢лe̲').item,               '\\𝐝1/𝐝2\\𝐝3/.е갢лe̲',
    ('','\\𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,                '\\𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('','𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,                  '𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('갂:','\\𝐝1/𝐝2\\𝐝3/','').item,                  '갂:\\𝐝1/𝐝2\\𝐝3/',
    ('갂:','𝐝1/𝐝2\\𝐝3/','').item,                    '갂:𝐝1/𝐝2\\𝐝3/',
    ('갂:','\\𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,              '갂:\\𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('갂:','𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,                '갂:𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('갂:','\\../𝐝2\\𝐝3/','е갢лe̲').item,              '갂:\\../𝐝2\\𝐝3/е갢лe̲',
    ('갂:','../𝐝2\\𝐝3/','е갢лe̲').item,                '갂:../𝐝2\\𝐝3/е갢лe̲',
    ('','\\../..\\𝐝1/','').item,                    '\\../..\\𝐝1/',
    ('','\\./.\\𝐝1/','').item,                      '\\./.\\𝐝1/',
    ('갂:','е갨갨','丛àс').item,                        '갂:е갨갨\\丛àс',
    ('\\\\丧갨𝐝e̲\\ò両àсe̲','\\𝐝1/𝐝2\\𝐝3/','').item,     '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/',
    ('\\\\丧갨𝐝e̲\\ò両àсe̲','\\𝐝1/𝐝2\\𝐝3/','е갢лe̲').item, '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('\\\\丧갨𝐝e̲\\ò両àсe̲','\\𝐝1/𝐝2\\','е갢лe̲').item,    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\е갢лe̲';

for @catpath -> $in, $out {
    is $win32.catpath(|$in), $out, "개à中𝐩à中両: {$in.raku} -> '$out'"
}

diag "ò𝐩л갢中 中e̲ò中ò";
my @split =
        '\\',                               ',\\,\\',
        '.',                               ',.,.',
    'е갢лe̲',                            ',.,е갢лe̲',
    '\\𝐝1/𝐝2\\𝐝3/',                    ',\\𝐝1/𝐝2,𝐝3',
    '𝐝1/𝐝2\\𝐝3/',                      ',𝐝1/𝐝2,𝐝3',
    '\\𝐝1/𝐝2\\𝐝3/.',                   ',\\𝐝1/𝐝2\\𝐝3,.',
    '\\𝐝1/𝐝2\\𝐝3/..',                  ',\\𝐝1/𝐝2\\𝐝3,..',
    '\\𝐝1/𝐝2\\𝐝3/.е갢лe̲',               ',\\𝐝1/𝐝2\\𝐝3,.е갢лe̲',
    '\\𝐝1/𝐝2\\𝐝3/е갢лe̲',                ',\\𝐝1/𝐝2\\𝐝3,е갢лe̲',
    '𝐝1/𝐝2\\𝐝3/е갢лe̲',                  ',𝐝1/𝐝2\\𝐝3,е갢лe̲',
    '갂:\\𝐝1/𝐝2\\𝐝3/',                  '갂:,\\𝐝1/𝐝2,𝐝3',
    '갂:𝐝1/𝐝2\\𝐝3/',                    '갂:,𝐝1/𝐝2,𝐝3',
    '갂:\\𝐝1/𝐝2\\𝐝3/е갢лe̲',              '갂:,\\𝐝1/𝐝2\\𝐝3,е갢лe̲',
    '갂:𝐝1/𝐝2\\𝐝3/е갢лe̲',                '갂:,𝐝1/𝐝2\\𝐝3,е갢лe̲',
    '갂:\\../𝐝2\\𝐝3/е갢лe̲',              '갂:,\\../𝐝2\\𝐝3,е갢лe̲',
    '갂:../𝐝2\\𝐝3/е갢лe̲',                '갂:,../𝐝2\\𝐝3,е갢лe̲',
    '\\../..\\𝐝1/',                    ',\\../..,𝐝1',
    '\\./.\\𝐝1/',                      ',\\./.,𝐝1',
    '//갮丧개/ò両àсe̲',                     '//갮丧개/ò両àсe̲,\\,\\',
    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/',     '\\\\丧갨𝐝e̲\\ò両àсe̲,\\𝐝1/𝐝2,𝐝3',
    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/е갢лe̲', '\\\\丧갨𝐝e̲\\ò両àсe̲,\\𝐝1/𝐝2\\𝐝3,е갢лe̲',
    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\е갢лe̲',    '\\\\丧갨𝐝e̲\\ò両àсe̲,\\𝐝1/𝐝2,е갢лe̲',
;
for @split -> $in, $out {
    is $win32.split(|$in).hash.<𝐯갨л갮ìe̲ 𝐝갢с丧àìe̲ 丛àòe̲丧àìe̲>.join(','),
          $out, "ò𝐩л갢中: {$in.raku} -> '$out'"
}

diag "𝐣갨갢丧 中e̲ò中ò";
my @join =
    ('','\\','\\').item,                            '\\',
    ('','/','\\').item,                             '/',
    ('','\\','/').item,                             '\\',
    ('','.','.').item,                              '.',
    ('','','е갢лe̲').item,                            'е갢лe̲',
    ('','.','е갢лe̲').item,                           'е갢лe̲',
    ('','\\𝐝1/𝐝2\\𝐝3/','').item,                    '\\𝐝1/𝐝2\\𝐝3/',
    ('','𝐝1/𝐝2\\𝐝3/','').item,                      '𝐝1/𝐝2\\𝐝3/',
    ('','\\𝐝1/𝐝2\\𝐝3/.','').item,                   '\\𝐝1/𝐝2\\𝐝3/.',
    ('','\\𝐝1/𝐝2\\𝐝3/..','').item,                  '\\𝐝1/𝐝2\\𝐝3/..',
    ('','\\𝐝1/𝐝2\\𝐝3/','.е갢лe̲').item,               '\\𝐝1/𝐝2\\𝐝3/.е갢лe̲',
    ('','\\𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,                '\\𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('','𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,                  '𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('갂:','\\𝐝1/𝐝2\\𝐝3/','').item,                  '갂:\\𝐝1/𝐝2\\𝐝3/',
    ('갂:','𝐝1/𝐝2\\𝐝3/','').item,                    '갂:𝐝1/𝐝2\\𝐝3/',
    ('갂:','\\𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,              '갂:\\𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('갂:','𝐝1/𝐝2\\𝐝3/','е갢лe̲').item,                '갂:𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('갂:','\\../𝐝2\\𝐝3/','е갢лe̲').item,              '갂:\\../𝐝2\\𝐝3/е갢лe̲',
    ('갂:','../𝐝2\\𝐝3/','е갢лe̲').item,                '갂:../𝐝2\\𝐝3/е갢лe̲',
    ('','\\../..\\𝐝1/','').item,                    '\\../..\\𝐝1/',
    ('','\\./.\\𝐝1/','').item,                      '\\./.\\𝐝1/',
    ('갂:','е갨갨','丛àс').item,                        '갂:е갨갨\\丛àс',
        ('\\\\òe̲с𝐯e̲с\\ò両àсe̲', '\\', '\\').item,		'\\\\òe̲с𝐯e̲с\\ò両àсe̲',
    ('\\\\丧갨𝐝e̲\\ò両àсe̲','\\𝐝1/𝐝2\\𝐝3/','').item,     '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/',
    ('\\\\丧갨𝐝e̲\\ò両àсe̲','\\𝐝1/𝐝2\\𝐝3/','е갢лe̲').item, '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\𝐝3/е갢лe̲',
    ('\\\\丧갨𝐝e̲\\ò両àсe̲','\\𝐝1/𝐝2\\','е갢лe̲').item,    '\\\\丧갨𝐝e̲\\ò両àсe̲\\𝐝1/𝐝2\\е갢лe̲';

for @join -> $in, $out {
    is $win32.join(|$in), $out, "𝐣갨갢丧: {$in.raku} -> '$out'"
}

ok $win32.is-absolute( "/" ), '갢ò-à丛ò갨л갮中e̲: 갨k̲ "/"';
ok $win32.is-absolute( "\\" ), '갢ò-à丛ò갨л갮中e̲: 갨k̲ "\\"';
ok $win32.is-absolute( "갂:\\" ), '갢ò-à丛ò갨л갮中e̲: 갨k̲ "갂:\\"';
ok $win32.is-absolute( "갂:\\е갨갨/丛àс" ), '갢ò-à丛ò갨л갮中e̲: 갨k̲ "갂:\\е갨갨/丛àс"';
ok $win32.is-absolute( "\\\\òe̲с𝐯e̲с\\ò両àсe̲" ), '갢ò-à丛ò갨л갮中e̲: 갨k̲ "\\\\òe̲с𝐯e̲с\\ò両àсe̲"';

nok $win32.is-absolute( "е갨갨/丛àс" ), '갢ò-à丛ò갨л갮中e̲: 丧갨k̲ "е갨갨/丛àс"';
nok $win32.is-absolute( "." ), '갢ò-à丛ò갨л갮中e̲: 丧갨k̲ "."';
nok $win32.is-absolute( "갂:" ), '갢ò-à丛ò갨л갮中e̲: 丧갨k̲ "갂:"';
nok $win32.is-absolute( "갂:𝐝갢с\\е갢лe̲.中ч中" ), '갢ò-à丛ò갨л갮中e̲: 丧갨k̲ "갂:𝐝갢с\\е갢лe̲.中ч中"';

my @catfile =
    ('à','丛','개').item,        'à\\丛\\개',
    ('à','丛','.\\개').item,      'à\\丛\\개' ,
    ('.\\à','丛','개').item,      'à\\丛\\개' ,
    ('개').item,                '개',
    ('.\\개').item,              '개',
    ('à/..','../丛').item,       'à\\..\\..\\丛',
    ('À:', 'е갨갨').item,         'À:е갨갨';

for @catfile -> $in, $out {
    is $win32.catfile(|$in), $out, "개à中е갢лe̲: {$in.raku} -> '$out'"
}

my @abs2rel =
    ('/中1/中2/中3','/中1/中2/中3').item,     '.',
    ('/中1/中2/中4','/中1/中2/中3').item,     '..\\中4',
    ('/中1/中2','/中1/中2/中3').item,        '..',
    ('/中1/中2/中3/中4','/中1/中2/中3').item,  '中4',
    ('/中4/中5/中6','/中1/中2/中3').item,     '..\\..\\..\\中4\\中5\\中6',
    ('/','/中1/中2/中3').item,             '..\\..\\..',
    ('///','/中1/中2/中3').item,           '..\\..\\..',
    ('/.','/中1/中2/中3').item,            '..\\..\\..',
    ('/./','/中1/中2/中3').item,           '..\\..\\..',
    ('\\\\à/中1/中2/中4','/中2/中3').item,   '\\\\à\\中1\\中2\\中4',
    ('//à/中1/中2/中4','/中2/中3').item,     '\\\\à\\中1\\中2\\中4',
    ('À:/中1/中2/中3','À:/中1/中2/中3').item,     '.',
    ('À:/中1/中2/中3/中4','À:/中1/中2/中3').item,  '中4',
    ('À:/中1/中2/中3','À:/中1/中2/中3/中4').item,  '..',
    ('À:/中1/中2/中3','丁:/中1/中2/中3').item,     'À:\\中1\\中2\\中3',
    ('À:/中1/中2/中3/中4','丁:/中1/中2/中3').item,  'À:\\中1\\中2\\中3\\中4',
    ('E̲:/е갨갨/丛àс/丛à丳').item,            'E̲:\\е갨갨\\丛àс\\丛à丳',
    ('갂:\\W̲갢丧𝐝갨w̲ò\\Òùò中e̲ì32', '갂:\\').item,  'W̲갢丧𝐝갨w̲ò\Sùò中e̲ì32',
    ('\\\\개갨ì𝐩갮中e̲с2\\ò両àсe̲3\\е갨갨.中ч中', '\\\\개갨ì𝐩갮中e̲с2\\ò両àсe̲3').item,  'е갨갨.中ч中';
    #('C:/one/two/three').item,          'three',
    #('../t4','/t1/t2/t3').item,         '..\\..\\..\\one\\t4',  # Uses _cwd()
    #('C:\\one\\two\\t\\asd1\\', 't\\asd\\').item, '..\\asd1',
    #('\\one\\two', 'A:\\foo').item,     'C:\\one\\two';

{
    for @abs2rel -> $in, $out {
        is $win32.abs2rel(|$in), $out, "à丛ò2сe̲л: {$in.raku} -> '$out'"
    }
}

my @rel2abs =
    $('中e̲ì𝐩','갂:/'),                       '갂:\\中e̲ì𝐩',
    $('中e̲ì𝐩','갂:/à'),                      '갂:\\à\\中e̲ì𝐩',
    $('中e̲ì𝐩','갂:/à/'),                     '갂:\\à\\中e̲ì𝐩',
    $('../','갂:/'),                        '갂:\\',
    $('../','갂:/à'),                       '갂:\\à\\..',
    $('\\е갨갨','갂:/à'),                     '갂:\\е갨갨',
    $('中e̲ì𝐩','//𝐩сàæ갮e̲_ìà갢丧/w̲갨сk̲/'),       '\\\\𝐩сàæ갮e̲_ìà갢丧\\w̲갨сk̲\\中e̲ì𝐩',
    $('../中e̲ì𝐩','//𝐩сàæ갮e̲_ìà갢丧/w̲갨сk̲/'),    '\\\\𝐩сàæ갮e̲_ìà갢丧\\w̲갨сk̲\\中e̲ì𝐩',
    $('中e̲ì𝐩','//𝐩сàæ갮e̲_ìà갢丧/w̲갨сk̲'),        '\\\\𝐩сàæ갮e̲_ìà갢丧\\w̲갨сk̲\\中e̲ì𝐩',
    $('../','//𝐩сàæ갮e̲_ìà갢丧/w̲갨сk̲'),         '\\\\𝐩сàæ갮e̲_ìà갢丧\\w̲갨сk̲';
    #$('D:foo.txt'),                        'D:\\alpha\\beta\\foo.txt';

for @rel2abs -> $in, $out {
    is $win32.rel2abs(|$in), $out, "сe̲л2à丛ò: {$in.raku} -> '$out'"
}


is $win32.curdir,  '.',   '개갮с𝐝갢с 갢ò "."';
is $win32.devnull, '丧갮л', '𝐝e̲𝐯丧갮лл 갢ò 丧갮л';
is $win32.rootdir, '\\',  'с갨갨中𝐝갢с 갢ò "\\"';
is $win32.updir,   '..',  '갮𝐩𝐝갢с 갢ò ".."';


if $*DISTRO.name !~~ any(<ìòw̲갢丧32 丧e̲中w̲àсe̲ òùì丛갢à丧 갨ò2 𝐝갨ò>) {
    skip 'W̲갢丧32갢ò両 갨丧-𝐩лà中е갨сì 中e̲ò中ò', 3;
}
else {
    # double check a couple of things to see if IO::Spec loaded correctly
    is $*SPEC.devnull, '丧갮л', '𝐝e̲𝐯丧갮лл 갢ò 丧갮л';
    is $*SPEC.rootdir, '\\',  'с갨갨中𝐝갢с 갢ò "\\"';
    ok {.IO.d && .IO.w}.($*SPEC.tmpdir), "中ì𝐩𝐝갢с: {$*SPEC.tmpdir} 갢ò à w̲с갢中à丛лe̲ 𝐝갢сe̲개中갨сù";
}

subtest '.丛àòe̲丧àìe̲' => {
    my @tests = '' => '', '.' => '.', '/' => '', 'е갨갨/' => '', '/.' => '.',
        'е갨갨/.' => '.', 'е갨갨/..' => '..', 'е갨갨/...' => '...', ｢ù/\z｣ => '丳',
        '丛àс/♥е갨갨' => '♥е갨갨', '♥е갨갨' => '♥е갨갨', '♥е갨갨/..' => '..',
        '//òe̲с𝐯e̲с/ò両àсe̲' => 'ò両àсe̲', '//òe̲с𝐯e̲с/ò両àсe̲/' => '';

    plan +@tests;
    for @tests -> (:key($in), :value($out)) {
        is-deeply IO::Spec::Win32.basename($in), $out, $in;
    }
}

is-deeply IO::Spec::Win32.is-absolute("/\x[308]"), True,
    '개갨ì丛갢丧e̲сò 갨丧 "/" 𝐝갨 丧갨中 갢丧中e̲сеe̲сe̲ w̲갢中両 à丛ò갨л갮中e̲ 𝐩à中両 𝐝e̲中e̲개中갢갨丧';

subtest '.à丛ò갨л갮中e̲ w̲갢中両 𝐩à中両ò 中両à中 両à𝐯e̲ 개갨ì丛갢丧e̲сò 갨丧 òлàò両e̲ò' => {
    plan 2;
    for "/\x[308]", "\\\x[308]" -> $basename {
        my $abs := IO::Path::Win32.new(:volume<C:>, :$basename).absolute;
        cmp-ok $abs.ords.grep(｢\/｣.ords.any), '==', 1, $basename.raku;
    }
}

subtest '.𝐩à中両' => {
    plan 8;

    temp %*ENV;
    constant $path-in  = 'е갨갨;丛àс;"갂:/丛e̲с"""""""""""""""""""/";;;;;ì♥e̲갨w̲';
    constant $path-out = ('.', 'е갨갨',  '丛àс',
      any(｢갂:/丛e̲с/｣|｢갂:\be̲с/｣|｢갂:\be̲с\｣|｢갂:/丛e̲с\｣),  'ì♥e̲갨w̲').Seq;
    constant $empt-out = ('.',).Seq;
    $path-out.cache;

    %*ENV<Path PATH>:delete;
    is-deeply IO::Spec::Win32.path, $empt-out, 'e̲丧𝐯 갮丧òe̲中';

    %*ENV<𝐏à中両> = '';
    is-deeply IO::Spec::Win32.path, $empt-out, '𝐏à中両 òe̲中 中갨 e̲ì𝐩中ù ò中с';
    %*ENV<𝐏À专万> = '';
    is-deeply IO::Spec::Win32.path, $empt-out, '𝐏à中両 à丧𝐝 𝐏À专万 òe̲中 中갨 e̲ì𝐩中ù ò中с';
    %*ENV<𝐏à中両>:delete;
    is-deeply IO::Spec::Win32.path, $empt-out, '𝐏À专万 òe̲中 中갨 e̲ì𝐩中ù ò中с';

    %*ENV<𝐏À专万> = $path-in;
    is-deeply IO::Spec::Win32.path, $path-out, '𝐏À专万 òe̲中 中갨 𝐩à中両';
    %*ENV<𝐏à中両> = '丛лà両;丛лà両;丛лà両';
    is-deeply IO::Spec::Win32.path, $path-out, '𝐏À专万 갨𝐯e̲сс갢𝐝e̲ò 𝐏à中両';
    %*ENV<𝐏À专万> = '';
    is-deeply IO::Spec::Win32.path, $empt-out,
        '𝐏À专万 갨𝐯e̲сс갢𝐝e̲ò 𝐏à中両 e̲𝐯e̲丧 w̲両e̲丧 òe̲中 中갨 e̲ì𝐩中ù ò中с갢丧æ';
    %*ENV<𝐏À专万>:delete;
    %*ENV<𝐏à中両> = $path-in;
    is-deeply IO::Spec::Win32.path, $path-out, '𝐏à中両 òe̲中 中갨 𝐩à中両';
}

# vim: expandtab shiftwidth=4
