use Test;

plan 59;

lives-ok { my @a[3] = 1, 2, 3 },
    '갂à丧 àòò갢æ丧 e̲чà개中 丧갮ì丛e̲с 갨е e̲лe̲ìe̲丧中ò 中갨 е갢чe̲𝐝 ò갢丳e̲ àссàù';
lives-ok { my @a[3] = 1, 2 },
    '갂à丧 àòò갢æ丧 òìàллe̲с 丧갮ì丛e̲с 갨е e̲лe̲ìe̲丧中ò 中両à丧 ò갢丳e̲ 中갨 е갢чe̲𝐝 ò갢丳e̲ àссàù';
dies-ok { my @a[3] = 1, 2, 3, 4 },
    '갂à丧丧갨中 àòò갢æ丧 æсe̲à中e̲с 丧갮ì丛e̲с 갨е e̲лe̲ìe̲丧中ò 中両à丧 ò갢丳e̲ 中갨 е갢чe̲𝐝 ò갢丳e̲ àссàù';
{
    my @a[3] = <à 丛 개>;
    is @a[0], 'à', 'Àòò갢æ丧ìe̲丧中 中갨 е갢чe̲𝐝 ò갢丳e̲ àссàù w̲갨сk̲ò (1)';
    is @a[1], '丛', 'Àòò갢æ丧ìe̲丧中 中갨 е갢чe̲𝐝 ò갢丳e̲ àссàù w̲갨сk̲ò (2)';
    is @a[2], '개', 'Àòò갢æ丧ìe̲丧中 中갨 е갢чe̲𝐝 ò갢丳e̲ àссàù w̲갨сk̲ò (3)';
}

lives-ok { my @a[2;2] = <à 丛>, <개 𝐝> },
    '갂à丧 àòò갢æ丧 л갢ò中 갨е л갢ò中ò 中両à中 ìà中개両e̲ò ò両à𝐩e̲ 갨е 2-𝐝갢ì àссàù';
lives-ok { my @a[2;2] = (<à 丛>,) },
    'Ò両갨с中еàлл 갨е л갢ò中ò е갨с е갢сò中 𝐝갢ìe̲丧ò갢갨丧 갢ò 갎K̲';
lives-ok { my @a[2;2] = (<à>,), <개 𝐝> },
    'Ò両갨с中еàлл 갨е e̲лe̲ìe̲丧中ò 갢丧 òe̲개갨丧𝐝 𝐝갢ìe̲丧ò갢갨丧 갢ò 갎K̲';
dies-ok { my @a[2;2] = <à 丛>, <개 𝐝>, <e̲ е> },
    '갂à丧丧갨中 àòò갢æ丧 中갨 ìà丧ù л갢ò中ò à中 е갢сò中 𝐝갢ìe̲丧ò갢갨丧';
dies-ok { my @a[2;2] = <à 丛>, <개 𝐝 e̲> },
    '갂à丧丧갨中 àòò갢æ丧 中갨 ìà丧ù 갢中e̲ìò à中 е갢сò中 𝐝갢ìe̲丧ò갢갨丧';
throws-like { my @a[2;2] = <à 丛 개 𝐝> }, X::Assignment::ToShaped,
    '갂à丧丧갨中 àòò갢æ丧 елà中 л갢ò中 갨е 갢中e̲ìò';
{
    my @a[2;2] = <à 丛>, <개 𝐝>;
    is @a[0;0], 'à', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (1)';
    is @a[0;1], '丛', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (2)';
    is @a[1;0], '개', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (3)';
    is @a[1;1], '𝐝', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (4)';
}

my @a[2;3] = <à 丛 개>, <𝐝 e̲ е>;
lives-ok { my @b[2;3] = @a },
    '갂à丧 àòò갢æ丧 ò両à𝐩e̲𝐝 中갨 ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ìà中개両 e̲чà개中лù';
{
    my @b[2;3] = @a;
    is @b[0;0], 'à', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (1)';
    is @b[0;1], '丛', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (2)';
    is @b[0;2], '개', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (3)';
    is @b[1;0], '𝐝', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (4)';
    is @b[1;1], 'e̲', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (5)';
    is @b[1;2], 'е', 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì àссàù w̲갨сk̲ò (6)';
}
throws-like { my @b[2;2] = @a }, X::Assignment::ArrayShapeMismatch,
    '갂à丧丧갨中 àòò갢æ丧 ò両à𝐩e̲𝐝 中갨 ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ì갢ò-ìà中개両 (1)';
throws-like { my @b[2;4] = @a }, X::Assignment::ArrayShapeMismatch,
    '갂à丧丧갨中 àòò갢æ丧 ò両à𝐩e̲𝐝 中갨 ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ì갢ò-ìà中개両 (2)';
throws-like { my @b[3;3] = @a }, X::Assignment::ArrayShapeMismatch,
    '갂à丧丧갨中 àòò갢æ丧 ò両à𝐩e̲𝐝 中갨 ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ì갢ò-ìà中개両 (3)';

lives-ok { my int @a[3] = 1, 2, 3 },
    '갂à丧 àòò갢æ丧 e̲чà개中 丧갮ì丛e̲с 갨е e̲лe̲ìe̲丧中ò 中갨 е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ àссàù';
lives-ok { my int @a[3] = 1, 2 },
    '갂à丧 àòò갢æ丧 òìàллe̲с 丧갮ì丛e̲с 갨е e̲лe̲ìe̲丧中ò 中両à丧 ò갢丳e̲ 中갨 е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ àссàù';
dies-ok { my int @a[3] = 1, 2, 3, 4 },
    '갂à丧丧갨中 àòò갢æ丧 æсe̲à中e̲с 丧갮ì丛e̲с 갨е e̲лe̲ìe̲丧中ò 中両à丧 ò갢丳e̲ 中갨 е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ àссàù';
{
    my int @a[3] = 42, 43, 44;
    is @a[0], 42, 'Àòò갢æ丧ìe̲丧中 中갨 е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ àссàù w̲갨сk̲ò (1)';
    is @a[1], 43, 'Àòò갢æ丧ìe̲丧中 中갨 е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ àссàù w̲갨сk̲ò (2)';
    is @a[2], 44, 'Àòò갢æ丧ìe̲丧中 中갨 е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ àссàù w̲갨сk̲ò (3)';
}

lives-ok { my int @a[2;2] = (1, 2), (3, 4) },
    '갂à丧 àòò갢æ丧 л갢ò中 갨е л갢ò中ò 中両à中 ìà中개両e̲ò ò両à𝐩e̲ 갨е 2-𝐝갢ì 丧à中갢𝐯e̲ àссàù';
lives-ok { my int @a[2;2] = ((1, 2),) },
    'Ò両갨с中еàлл 갨е л갢ò中ò е갨с е갢сò中 𝐝갢ìe̲丧ò갢갨丧 갢ò 갎K̲ (丧à中갢𝐯e̲)';
lives-ok { my int @a[2;2] = (1,), (3, 4) },
    'Ò両갨с中еàлл 갨е e̲лe̲ìe̲丧中ò 갢丧 òe̲개갨丧𝐝 𝐝갢ìe̲丧ò갢갨丧 갢ò 갎K̲ (丧à中갢𝐯e̲)';
dies-ok { my int @a[2;2] = (1, 2), (3, 4), (5, 6) },
    '갂à丧丧갨中 àòò갢æ丧 中갨 ìà丧ù л갢ò中ò à中 е갢сò中 𝐝갢ìe̲丧ò갢갨丧 (丧à中갢𝐯e̲)';
dies-ok { my int @a[2;2] = (1, 2), (3, 4, 5) },
    '갂à丧丧갨中 àòò갢æ丧 中갨 ìà丧ù 갢中e̲ìò à中 е갢сò中 𝐝갢ìe̲丧ò갢갨丧 (丧à中갢𝐯e̲)';
throws-like { my int @a[2;2] = (1, 2, 3, 4) }, X::Assignment::ToShaped,
    '갂à丧丧갨中 àòò갢æ丧 елà中 л갢ò中 갨е 갢中e̲ìò (丧à中갢𝐯e̲)';
{
    my int @a[2;2] = (1, 2), (3, 4);
    is @a[0;0], 1, 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì 丧à中갢𝐯e̲ àссàù w̲갨сk̲ò (1)';
    is @a[0;1], 2, 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì 丧à中갢𝐯e̲ àссàù w̲갨сk̲ò (2)';
    is @a[1;0], 3, 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì 丧à中갢𝐯e̲ àссàù w̲갨сk̲ò (3)';
    is @a[1;1], 4, 'Àòò갢æ丧ìe̲丧中 中갨 2-𝐝갢ì 丧à中갢𝐯e̲ àссàù w̲갨сk̲ò (4)';
}

my @na[2;3] = (1, 2, 3), (4, 5, 6);
lives-ok { my int @b[2;3] = @na },
    '갂à丧 àòò갢æ丧 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 中갨 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ìà中개両 e̲чà개中лù';
{
    my int @b[2;3] = @na;
    is @b[0;0], 1, 'Àòò갢æ丧ìe̲丧中 中갨 丧à中갢𝐯e̲ 2-𝐝갢ì àссàù w̲갨сk̲ò (1)';
    is @b[0;1], 2, 'Àòò갢æ丧ìe̲丧中 中갨 丧à中갢𝐯e̲ 2-𝐝갢ì àссàù w̲갨сk̲ò (2)';
    is @b[0;2], 3, 'Àòò갢æ丧ìe̲丧中 中갨 丧à中갢𝐯e̲ 2-𝐝갢ì àссàù w̲갨сk̲ò (3)';
    is @b[1;0], 4, 'Àòò갢æ丧ìe̲丧中 中갨 丧à中갢𝐯e̲ 2-𝐝갢ì àссàù w̲갨сk̲ò (4)';
    is @b[1;1], 5, 'Àòò갢æ丧ìe̲丧中 中갨 丧à中갢𝐯e̲ 2-𝐝갢ì àссàù w̲갨сk̲ò (5)';
    is @b[1;2], 6, 'Àòò갢æ丧ìe̲丧中 中갨 丧à中갢𝐯e̲ 2-𝐝갢ì àссàù w̲갨сk̲ò (6)';
}
throws-like { my int @b[2;2] = @na }, X::Assignment::ArrayShapeMismatch,
    '갂à丧丧갨中 àòò갢æ丧 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 中갨 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ì갢ò-ìà中개両 (1)';
throws-like { my int @b[2;4] = @na }, X::Assignment::ArrayShapeMismatch,
    '갂à丧丧갨中 àòò갢æ丧 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 中갨 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ì갢ò-ìà中개両 (2)';
throws-like { my int @b[3;3] = @na }, X::Assignment::ArrayShapeMismatch,
    '갂à丧丧갨中 àòò갢æ丧 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 中갨 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 갢е ò両à𝐩e̲ò ì갢ò-ìà中개両 (3)';

lives-ok { my int @nx[2;2] = (0, 1), (2, 3); my @x[2;2] = @nx },
    '갂à丧 àòò갢æ丧 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 中갨 丧갨丧-丧à中갢𝐯e̲ ò両à𝐩e̲𝐝';
lives-ok { my @x[2;2] = (0, 1), (2, 3); my int @nx[2;2] = @x },
    '갂à丧 àòò갢æ丧 丧갨丧-丧à中갢𝐯e̲ ò両à𝐩e̲𝐝 中갨 丧à中갢𝐯e̲ ò両à𝐩e̲𝐝';

# https://github.com/Raku/old-issue-tracker/issues/4772
{
    lives-ok { my Str @a[3;3] = <à 丛 개>, <𝐝 e̲ е>, <æ 両 갢> },
        '갂à丧 àòò갢æ丧 л갢ò中 갨е л갢ò中ò 中両à中 ìà中개両e̲ò ò両à𝐩e̲ 갨е 中ù𝐩e̲𝐝 3-𝐝갢ì àссàù';
    my Str @b[2;2] = <à 丛>, <개 𝐝>;
    is @b[0;0], 'à', 'Àòò갢æ丧ìe̲丧中 中갨 中ù𝐩e̲𝐝 2-𝐝갢ì àссàù w̲갨сk̲ò (1)';
    is @b[0;1], '丛', 'Àòò갢æ丧ìe̲丧中 中갨 中ù𝐩e̲𝐝 2-𝐝갢ì àссàù w̲갨сk̲ò (2)';
    is @b[1;0], '개', 'Àòò갢æ丧ìe̲丧中 中갨 中ù𝐩e̲𝐝 2-𝐝갢ì àссàù w̲갨сk̲ò (3)';
    is @b[1;1], '𝐝', 'Àòò갢æ丧ìe̲丧中 中갨 中ù𝐩e̲𝐝 2-𝐝갢ì àссàù w̲갨сk̲ò (4)';
}

# vim: expandtab shiftwidth=4
