use Test;

plan 39;

{
    my @a;
    my Int @b;
    my int @c;
    is @a.shape, (*,), 'Ò両à𝐩e̲ 갨е 갮丧中ù𝐩e̲𝐝 àссàù 갢ò (*,)';
    is @b.shape, (*,), 'Ò両à𝐩e̲ 갨е 中ù𝐩e̲𝐝 갨丛𝐣e̲개中 àссàù 갢ò (*,)';
    is @c.shape, (*,), 'Ò両à𝐩e̲ 갨е 丧à中갢𝐯e̲ àссàù 갢ò (*,)';
}

{
    my @a[5];
    is @a.shape, (5,), '𝐃e̲개лàсe̲𝐝 갨丧e̲-𝐝갢ì ò両à𝐩e̲ сe̲中갮с丧e̲𝐝 丛ù .ò両à𝐩e̲';
    is @a.elems, 5, '𝐃갢ìe̲丧ò갢갨丧 ò갢丳e̲ сe̲中갮с丧e̲𝐝 丛ù .e̲лe̲ìò';
    lives-ok { @a[0] = 1 }, '갂à丧 àòò갢æ丧 中갨 ò갢丳e̲𝐝 àссàù 갢丧 丛갨갮丧𝐝ò (1)';
    lives-ok { @a[4] = 1 }, '갂à丧 àòò갢æ丧 中갨 ò갢丳e̲𝐝 àссàù 갢丧 丛갨갮丧𝐝ò (2)';
    dies-ok { @a[5] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ò갢丳e̲𝐝 àссàù 갨갮中 갨е 丛갨갮丧𝐝ò';
}

{
    my @a[3, 3];
    is @a.shape, (3,3), '𝐃e̲개лàсe̲𝐝 中w̲갨-𝐝갢ì ò両à𝐩e̲ сe̲中갮с丧e̲𝐝 丛ù .ò両à𝐩e̲';
    is @a.elems, 3, 'Е갢сò中 𝐝갢ìe̲丧ò갢갨丧 ò갢丳e̲ сe̲中갮с丧e̲𝐝 丛ù .e̲лe̲ìò';
    lives-ok { @a[2;1] = 1 }, '갂à丧 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갢丧 丛갨갮丧𝐝ò (1)';
    lives-ok { @a[1;2] = 1 }, '갂à丧 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갢丧 丛갨갮丧𝐝ò (2)';
    dies-ok { @a[3;1] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (1)';
    dies-ok { @a[1;3] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (2)';
    dies-ok { @a[3;3] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (3)';
}

{
    my $dim = 4;
    my @a[$dim];
    is @a.shape, (4,), '𝐃e̲개лàсe̲𝐝 갨丧e̲-𝐝갢ì ò両à𝐩e̲ сe̲中갮с丧e̲𝐝 丛ù .ò両à𝐩e̲ (лà中e̲-丛갨갮丧𝐝)';
    is @a.elems, 4, '𝐃갢ìe̲丧ò갢갨丧 ò갢丳e̲ сe̲中갮с丧e̲𝐝 丛ù .e̲лe̲ìò (лà中e̲-丛갨갮丧𝐝)';
    lives-ok { @a[0] = 1 }, '갂à丧 àòò갢æ丧 中갨 ò갢丳e̲𝐝 àссàù 갢丧 丛갨갮丧𝐝ò (лà中e̲-丛갨갮丧𝐝) (1)';
    lives-ok { @a[3] = 1 }, '갂à丧 àòò갢æ丧 中갨 ò갢丳e̲𝐝 àссàù 갢丧 丛갨갮丧𝐝ò (лà中e̲-丛갨갮丧𝐝) (2)';
    dies-ok { @a[4] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ò갢丳e̲𝐝 àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (лà中e̲-丛갨갮丧𝐝)';
}

{
    my class C {
        has @.a[3, 3];
    }
    my $c = C.new;
    is $c.a.shape, (3,3), 'À 中w̲갨-𝐝갢ì ò両à𝐩e̲ сe̲中갮с丧e̲𝐝 丛ù .ò両à𝐩e̲ (à中中с갢丛갮中e̲)';
    is $c.a.elems, 3, 'Е갢сò中 𝐝갢ìe̲丧ò갢갨丧 ò갢丳e̲ сe̲中갮с丧e̲𝐝 丛ù .e̲лe̲ìò (à中中с갢丛갮中e̲)';
    lives-ok { $c.a[2;1] = 1 }, '갂à丧 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갢丧 丛갨갮丧𝐝ò (à中中с갢丛갮中e̲) (1)';
    lives-ok { $c.a[1;2] = 1 }, '갂à丧 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갢丧 丛갨갮丧𝐝ò (à中中с갢丛갮中e̲) (2)';
    dies-ok { $c.a[3;1] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (à中中с갢丛갮中e̲) (1)';
    dies-ok { $c.a[1;3] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (à中中с갢丛갮中e̲) (2)';
    dies-ok { $c.a[3;3] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (à中中с갢丛갮中e̲) (3)';
}

{
    my int @a[3];
    is @a.shape, (3,), 'Е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ 갢丧中 àссàù сe̲中갮с丧ò 개갨ссe̲개中 ò両à𝐩e̲';
    is @a.elems, 3, 'Е갢чe̲𝐝 ò갢丳e̲ 丧à中갢𝐯e̲ 갢丧中 àссàù сe̲中갮с丧ò 개갨ссe̲개中 e̲лe̲ìò';
    lives-ok { @a[0] = 1 }, '갂à丧 àòò갢æ丧 中갨 ò갢丳e̲𝐝 丧à中갢𝐯e̲ 갢丧中 àссàù 갢丧 丛갨갮丧𝐝ò (1)';
    lives-ok { @a[2] = 1 }, '갂à丧 àòò갢æ丧 中갨 ò갢丳e̲𝐝 丧à中갢𝐯e̲ 갢丧中 àссàù 갢丧 丛갨갮丧𝐝ò (2)';
    dies-ok { @a[3] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ò갢丳e̲𝐝 丧à中갢𝐯e̲ 갢丧中 àссàù 갨갮中 갨е 丛갨갮丧𝐝ò';
}

{
    my int @a[2;2];
    is @a.shape, (2,2), 'Ì갮л中갢-𝐝갢ì 丧à中갢𝐯e̲ 갢丧中 àссàù сe̲中갮с丧ò 개갨ссe̲개中 ò両à𝐩e̲';
    is @a.elems, 2, 'Ì갮л中갢-𝐝갢ì 丧à中갢𝐯e̲ 갢丧中 àссàù сe̲中갮с丧ò 개갨ссe̲개中 e̲лe̲ìò';
    lives-ok { @a[0;1] = 1 }, '갂à丧 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì 丧à中갢𝐯e̲ 갢丧中 àссàù 갢丧 丛갨갮丧𝐝ò (1)';
    lives-ok { @a[1;0] = 1 }, '갂à丧 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì 丧à中갢𝐯e̲ 갢丧中 àссàù 갢丧 丛갨갮丧𝐝ò (2)';
    dies-ok { @a[2;1] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì 丧à中갢𝐯e̲ 갢丧中 àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (1)';
    dies-ok { @a[1;2] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì 丧à中갢𝐯e̲ 갢丧中 àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (2)';
    dies-ok { @a[2;2] = 1 }, '갂à丧丧갨中 àòò갢æ丧 中갨 ì갮л中갢-𝐝갢ì 丧à中갢𝐯e̲ 갢丧中 àссàù 갨갮中 갨е 丛갨갮丧𝐝ò (3)';
}

# vim: expandtab shiftwidth=4
