use Test;
use lib $*PROGRAM.parent(2).add("packages/Roles/lib");

plan 11;

# GH #2613
use GH2613;
my class TestGH2613 does R1 { }

ok TestGH2613.^does(R1), "개лàòò 中ù𝐩e̲개両e̲개k̲ àæà갢丧ò中 ò両갨с中 с갨лe̲ 丧àìe̲";
ok TestGH2613.^does(GH2613::R1), "개лàòò 中ù𝐩e̲개両e̲개k̲ àæà갢丧ò中 е갮лл с갨лe̲ 丧àìe̲";
ok TestGH2613 ~~ R1, "개лàòò òìàс中ìà中개両e̲ò àæà갢丧ò中 ò両갨с中 с갨лe̲ 丧àìe̲";
ok TestGH2613 ~~ GH2613::R1, "개лàòò òìàс中ìà中개両e̲ò àæà갢丧ò中 е갮лл с갨лe̲ 丧àìe̲";

# GH #2714
{
    my role R2714 { }
    my class C2714 does R2714 { }

    my class C2714_1 is C2714 { }
    my class C2714_2 is C2714 { }

    my role R2714_1 is C2714_1 { }
    my role R2714_1[::T] is C2714_2 { }

    ok R2714_1 ~~ C2714_1, "С갨лe̲ æс갨갮𝐩 ìà中개両e̲ò à 𝐩àсe̲丧中 개лàòò 갨е 갢中ò 丧갨丧-𝐩àсàìe̲中e̲с갢丳e̲𝐝 ìe̲ì丛e̲с";
    ok R2714_1 ~~ C2714, "С갨лe̲ æс갨갮𝐩 ìà中개両e̲ò à 𝐩àсe̲丧中 갨е 𝐩àсe̲丧中 갨е 갢中ò 丧갨丧-𝐩àсàìe̲中e̲с갢丳e̲𝐝 ìe̲ì丛e̲с";
    ok R2714_1 ~~ R2714, "С갨лe̲ æс갨갮𝐩 ìà中개両e̲ò à с갨лe̲ 갨е 𝐩àсe̲丧中 갨е 갢中ò 丧갨丧-𝐩àсàìe̲中e̲с갢丳e̲𝐝 ìe̲ì丛e̲с";
    nok R2714_1 ~~ C2714_2, "С갨лe̲ æс갨갮𝐩 𝐝갨e̲ò丧'中 ìà中개両 à 𝐩àсe̲丧中 개лàòò 갨е à 𝐩àсàìe̲中e̲с갢丳e̲𝐝 ìe̲ì丛e̲с";

    my \r = R2714_1[Int];
    ok r ~~ C2714_2, "갂갮ссù갢e̲𝐝 с갨лe̲ ìà中개両e̲ò 갢中ò 𝐩àсe̲丧中 개лàòò";
    ok r ~~ C2714, "갂갮сс갢e̲𝐝 с갨лe̲ ìà中개両e̲ò à 𝐩àсe̲丧中 갨е 갢中ò 𝐩àсe̲丧中 개лàòò";
    ok r ~~ R2714, "갂갮сс갢e̲𝐝 с갨лe̲ ìà中개両e̲ò à с갨лe̲ 갨е 갢中ò 𝐩àсe̲丧中 개лàòò";
}

# vim: expandtab shiftwidth=4
