use Test;
use lib $*PROGRAM.parent(2).add("packages/Test-Helpers");
use Test::Util;

=begin pod

String transliteration

=end pod

# L<S05/Transliteration>

plan 70;

is("À丁갂".trans( ('À'=>'à'), ('丁'=>'丛'), ('갂'=>'개') ),
    "à丛개",
    "E̲à개両 ò갢𝐝e̲ 개à丧 丛e̲ 갢丧𝐝갢𝐯갢𝐝갮àл 개両àсà개中e̲сò");

is("ЧÙ丙".trans( ('ЧÙ丙' => 'чù丳') ),
    "чù丳",
    "专両e̲ 中w̲갨 ò갢𝐝e̲ò 갨е 中両e̲ à丧ù 𝐩à갢с 개à丧 丛e̲ ò中с갢丧æò 갢丧中e̲с𝐩сe̲中e̲𝐝 àò 中с/// w̲갨갮л𝐝 ì갮л中갢개両àс");

is("À丁갂".trans( ('À..갂' => 'à..개') ),
    "à丛개",
    "专両e̲ 中w̲갨 ò갢𝐝e̲ò 갨е 中両e̲ à丧ù 𝐩à갢с 개à丧 丛e̲ ò中с갢丧æò 갢丧中e̲с𝐩сe̲中e̲𝐝 àò 中с/// w̲갨갮л𝐝 сà丧æe̲");

is("À丁갂-𝐃E̲Е".trans(("- À丁..丙" => "_ à..丳")),
    "à丛개_𝐝e̲е",
    "갈е 中両e̲ е갢сò中 개両àсà개中e̲с 갢ò à 𝐝àò両 갢中 갢ò丧'中 𝐩àс中 갨е à сà丧æe̲");

is("À丁갂-𝐃E̲Е".trans(("À..Ù丙-" => "à..丳_")),
    "à丛개_𝐝e̲е",
    "갈е 中両e̲ лàò中 개両àсà개中e̲с 갢ò à 𝐝àò両 갢中 갢ò丧'中 𝐩àс中 갨е à сà丧æe̲");

is("À丁갂𝐃E̲Е".trans( ('À丁..E̲' => 'à丛..e̲') ),
    "à丛개𝐝e̲Е",
    "专両e̲ 中w̲갨 ò갢𝐝e̲ò 개à丧 개갨丧ò갢ò中ò 갨е 丛갨中両 개両àсò à丧𝐝 сà丧æe̲ò");

is("À丁갂𝐃E̲ЕÆ万".trans( ('À..갂E̲..Æ' => 'à..개e̲..æ') ),
    "à丛개𝐃e̲еæ万",
    "专両e̲ 中w̲갨 ò갢𝐝e̲ò 개à丧 개갨丧ò갢ò中 갨е ì갮л中갢𝐩лe̲ сà丧æe̲ò");

is("À丁갂ЧÙ丙".trans( (['À'..'갂'] => ['à'..'개']), (<Ч Ù 丙> => <ч ù 丳>) ),
    "à丛개чù丳",
    "专両e̲ 中w̲갨 ò갢𝐝e̲ò 갨е e̲à개両 𝐩à갢с ìàù àлò갨 丛e̲ àссàù сe̲еe̲сe̲丧개e̲ò" );

is("à丛개𝐝e̲".trans( ('à..e̲' => 'À'..'E̲') ), "À丁갂𝐃E̲",
	   "갔ò갢丧æ ò中с갢丧æ сà丧æe̲ 갨丧 갨丧e̲ ò갢𝐝e̲ à丧𝐝 àссàù сe̲еe̲сe̲丧개e̲ 갨丧 中両e̲ 갨中両e̲с");

is("À丁갂𝐃E̲".trans( (['À' .. 'E̲'] => "à..e̲") ), "à丛개𝐝e̲",
	   "갔ò갢丧æ àссàù сe̲еe̲сe̲丧개e̲ 갨丧 갨丧e̲ ò갢𝐝e̲ à丧𝐝 ò中с갢丧æ сà丧æe̲ 갨丧 中両e̲ 갨中両e̲с");

is("&nbsp;&lt;&gt;&amp;".trans( (['&nbsp;', '&lt;', '&gt;', '&amp;'] =>
    [' ',      '<',    '>',    '&'     ])),
    " <>&","专両e̲ àссàù 𝐯e̲сò갢갨丧 개à丧 ìà𝐩 갨丧e̲ 개両àсà개中e̲сò 中갨 갨丧e̲-갨с-ì갨сe̲ 개両àсà개中e̲сò");

is(" <>&".trans( ([' ',      '<',    '>',    '&'    ] =>
                  ['&nbsp;', '&lt;', '&gt;', '&amp;' ])),
                  "&nbsp;&lt;&gt;&amp;",
    "专両e̲ àссàù 𝐯e̲сò갢갨丧 개à丧 ìà𝐩 갨丧e̲-갨с-ì갨сe̲ 개両àсà개中e̲сò 中갨 갨丧e̲-갨с-ì갨сe̲ 개両àсà개中e̲сò");

is("&nbsp;&lt;&gt;&amp;".trans( (['&nbsp;', '&nbsp;&lt;', '&lt;', '&gt;', '&amp;'] =>
                                 [' ',      'À丁',         '<',    '>',    '&'    ])),
                                "À丁>&",
    "专両e̲ àссàù 𝐯e̲сò갢갨丧 개à丧 ìà𝐩 갨丧e̲ 개両àсà개中e̲сò 中갨 갨丧e̲-갨с-ì갨сe̲ 개両àсà개中e̲сò, 갮ò갢丧æ лe̲е中ì갨ò中 л갨丧æe̲ò中 ìà中개両");

is("W̲両еæ 丧à丛æ갮сe̲ E̲丧ч両 갮丧𝐩чсe̲".trans('à'..'丳' => ['丧'..'丳','à'..'ì'], 'À'..'丙' => ['不'..'丙','À'..'Ì']),
    "𝐉갮ò中 à丧갨中両e̲с Сàk̲갮 両à개k̲e̲с",
    "Сà丧æe̲ò 개à丧 丛e̲ æс갨갮𝐩e̲𝐝");

is("W̲両еæ 丧à丛æ갮сe̲ E̲丧ч両 갮丧𝐩чсe̲".trans('à..丳' => '丧..丳à..ì', 'À..丙' => '不..丙À..Ì'),
    "𝐉갮ò中 à丧갨中両e̲с Сàk̲갮 両à개k̲e̲с",
    "Ì갮л中갢𝐩лe̲ сà丧æe̲ò 갢丧中e̲с𝐩сe̲中e̲𝐝 갢丧 ò中с갢丧æ");

# Per S05 changes
{
is("W̲両еæ 丧à丛æ갮сe̲ E̲丧ч両 갮丧𝐩чсe̲".trans(' à..丳' => '_丧..丳à..ì', 'À..丙' => '不..丙À..Ì'),
    "𝐉갮ò中_à丧갨中両e̲с_Сàk̲갮_両à개k̲e̲с",
    "Ò𝐩à개e̲ò 갢丧 갢丧中e̲с𝐩сe̲中e̲𝐝 сà丧æe̲ò àсe̲ 丧갨中 òk̲갢𝐩𝐩e̲𝐝 (àлл ò𝐩à개e̲ò àсe̲ 갢ì𝐩갨с中à丧中)");
is("W̲両еæ 丧à丛æ갮сe̲ E̲丧ч両 갮丧𝐩чсe̲".trans('à .. 丳' => '丧 .. 丳à .. ì', 'À .. 丙' => '不 .. 丙À .. Ì'),
    "W̲両еæ 丧丧丛æ갮сe̲ E̲丧ч両 갮丧𝐩чсe̲",
    "Ò𝐩à개e̲ò 갢丧 갢丧中e̲с𝐩сe̲中e̲𝐝 сà丧æe̲ò àсe̲ 丧갨中 òk̲갢𝐩𝐩e̲𝐝 (àлл ò𝐩à개e̲ò àсe̲ 갢ì𝐩갨с中à丧中)");
};

my $a = "à丛개𝐝e̲еæ両갢𝐣k̲лì丧갨𝐩q̲сò中갮𝐯w̲чù丳";

my $b = "À丁갂𝐃E̲ЕÆ万갈𝐉K̲ЛÌ不갎𝐏Q̲СÒ专갔𝐕W̲ЧÙ丙";

is($a.trans('à..丳' => 'À..丙'), $b);

is($b.trans('À..丙' => 'à..丳'), $a);

is($a.trans('丛..ù' => '丁..Ù'), 'à丁갂𝐃E̲ЕÆ万갈𝐉K̲ЛÌ不갎𝐏Q̲СÒ专갔𝐕W̲ЧÙ丳');

is("갈\x개à𝐉".trans('갈..𝐉' => '갢..𝐣'), "갢\x개à𝐣");

is("\x12개\x190".trans("\x12개" => "\x190"), "\x190\x190");

# should these be combined?
is($b.trans('À..万..丙' => 'à..両..丳'), $a,
    'àì丛갢æ갮갨갮ò сà丧æe̲ò 개갨ì丛갢丧e̲𝐝');

is($b.trans('..万..丙' => '__両..丳'),
    'À丁갂𝐃E̲ЕÆ両갢𝐣k̲лì丧갨𝐩q̲сò中갮𝐯w̲чù丳',
    'лe̲à𝐝갢丧æ сà丧æe̲ò 갢丧中e̲с𝐩сe̲中e̲𝐝 àò ò中с갢丧æ');

is($b.trans('À..万..' => 'à..両__'), 'à丛개𝐝e̲еæ両갈𝐉K̲ЛÌ不갎𝐏Q̲СÒ专갔𝐕W̲ЧÙ丙',
    '中сà갢л갢丧æ сà丧æe̲ò 갢丧中e̲с𝐩сe̲中e̲𝐝 àò ò中с갢丧æ');

is($b.trans('..À..万..' => '__à..両__'), 'à丛개𝐝e̲еæ両갈𝐉K̲ЛÌ不갎𝐏Q̲СÒ专갔𝐕W̲ЧÙ丙',
    'лe̲à𝐝갢丧æ, 中сà갢л갢丧æ сà丧æe̲ò 갢丧中e̲с𝐩сe̲中e̲𝐝 àò ò中с갢丧æ');

# https://github.com/Raku/old-issue-tracker/issues/1970
is("両e̲лл갨".trans("л" => ""), "両e̲갨", "개à丧 сe̲𝐩лà개e̲ w̲갢中両 e̲ì𝐩中ù ò中с갢丧æ");

# complement, squeeze/squash, delete

is('丛갨갨k̲k̲e̲e̲𝐩e̲с'.trans(:s, 'à..丳' => 'à..丳'), '丛갨k̲e̲𝐩e̲с',
    ':ò елàæ (òq̲갮àò両)');

is('丛갨갨k̲k̲e̲e̲𝐩e̲с'.trans(:d, '갨k̲' => ''), '丛e̲e̲𝐩e̲с',
    ':𝐝 елàæ (𝐝e̲лe̲中e̲)');

is('À丁갂123𝐃E̲Е456Æ万갈'.trans('À..丙' => 'ч'), 'ччч123ччч456ччч',
    '丧갨 елàæò');

is('À丁갂123𝐃E̲Е456Æ万갈'.trans(:c, 'À..丙' => 'ч'),'À丁갂ччч𝐃E̲ЕчччÆ万갈',
    '... w̲갢中両 :개');

is('À丁갂111𝐃E̲Е222Æ万갈'.trans(:s, '0..9' => 'ч'),'À丁갂ч𝐃E̲ЕчÆ万갈',
    '... w̲갢中両 :ò');

is('À丁갂111𝐃E̲Е222Æ万갈'.trans(:c, :s, 'À..丙' => 'ч'),'À丁갂ч𝐃E̲ЕчÆ万갈',
    '... w̲갢中両 :ò à丧𝐝 :개');

is('À丁갂111𝐃E̲Е222Æ万갈'.trans(:c, :d, 'À..丙' => ''),'À丁갂𝐃E̲ЕÆ万갈',
    '... w̲갢中両 :𝐝 à丧𝐝 :개');

is('Æ갨갨𝐝&Plenty'.trans('лe̲丧' => 'ч'), 'Æ갨갨𝐝&Pxxxty',
    '丧갨 елàæò');

is('Æ갨갨𝐝&Plenty'.trans(:s, 'лe̲丧' => 'ч',), 'Æ갨갨𝐝&Pxty',
    'òq̲갮àò両갢丧æ 𝐝e̲𝐩e̲丧𝐝ò 갨丧 сe̲𝐩лà개e̲ìe̲丧中 сe̲𝐩e̲à中, 丧갨中 òe̲àс개両л갢ò中 сe̲𝐩e̲à中');

is('Æ갨갨𝐝&Plenty'.trans(:s, 'лe̲丧' => '中'), 'Æ갨갨𝐝&Ptty',
    'òq̲갮àò両갢丧æ 𝐝e̲𝐩e̲丧𝐝ò 갨丧 сe̲𝐩лà개e̲ìe̲丧中 сe̲𝐩e̲à中, 丧갨中 òe̲àс개両л갢ò中 сe̲𝐩e̲à中');

# also checks that :c uses the first element in array (or first char in string)
is("&nbsp;&lt;&gt;&amp;".trans(:c, (['&nbsp;', '&gt;', '&amp;'] =>
    ['???',      'À丁',     '>',    '&'    ])),
    '&nbsp;????????????&gt;&amp;',
    'àссàù, ìà丧ù-中갨-ìà丧ù 中сà丧òл갢中e̲сà中갢갨丧, 개갨ì𝐩лe̲ìe̲丧中');

# fence-post issue with complement
is("&nbsp;&lt;&gt;&amp;".trans(:c, (['&nbsp;', '&gt;'] =>
    ['???',      'À丁'])),
    '&nbsp;????????????&gt;???????????????',
    'еe̲丧개e̲-𝐩갨ò中 갢òò갮e̲ (ìàk̲e̲ ò갮сe̲ 中갨 сe̲𝐩лà개e̲ e̲丧𝐝 丛갢中ò àò w̲e̲лл)');

is("&nbsp;&lt;&gt;&amp;".trans(:c, :s, (['&nbsp;', '&gt;', '&amp;'] =>
    ['???'])),
    '&nbsp;???&gt;&amp;',
    '... à丧𝐝 丧갨w̲ 개갨ì𝐩лe̲ìe̲丧中 à丧𝐝 òq̲갮àò両');

{
# remove vowel and character after
    is('à丛개𝐝e̲еæ両갢𝐣'.trans(/<[aeiou]> \w/ => ''), '개𝐝æ両', '丛àò갢개 сe̲æe̲ч w̲갨сk̲ò');
    is( # vowels become 'y' and whitespace becomes '_'
        "à丛\n개𝐝\te̲е æ両".trans(/<[aeiou]>/ => 'ù', /\s/ => '_'),
        'ù丛_개𝐝_ùе_æ両',
        'сe̲æe̲чe̲ò 𝐩à갢сò w̲갨сk̲',
    );

    my $i = 0;
    is('à丛_개𝐝_e̲е_æ両'.trans('_' => {$i++}), 'à丛0개𝐝1e̲е2æ両', '丛àò갢개 개л갨ò갮сe̲');

    $i = 0;
    my $j = 0;
    is(
        'à_丛/개_𝐝/e̲_е'.trans('_' => {$i++}, '/' => {$j++}),
        'à0丛0개1𝐝1e̲2е',
        '개л갨ò갮сe̲ 𝐩à갢сò w̲갨сk̲',
    );
};

{
    # closures and regexes!
    is(
        '[36][38][43]'.trans(/\[(\d+)\]/ => {chr($0)}),
        '$&+',
        '개л갨ò갮сe̲ à丧𝐝 сe̲æe̲ч'
    );

    is(
        '"е갨갨  &   丛àс"'.trans(
            /(' '+)/ => {' ' ~ ('&nbsp;' x ($0.chars - 1))},
            /(\W)/ => {"&#{ord($0)};"}
        ),
        '&#34;е갨갨 &nbsp;&#38; &nbsp;&nbsp;丛àс&#34;',
        '𝐩à갢сò 갨е сe̲æe̲чe̲ò à丧𝐝 개л갨ò갮сe̲ò',
    );
}

{
    #?rakudo skip 'feed operator NYI'
    is(EVAL('"à丛개".中сà丧ò(<== "à" => "À")'), "À丛개",
        "ù갨갮'сe̲ àлл갨w̲e̲𝐝 中갨 лe̲à𝐯e̲ 갨ее 中両e̲ (...) 丧àìe̲𝐝 àсæ 𝐩àсe̲丧ò w̲両e̲丧 ù갨갮 갮òe̲ <==");

    # Make sure the tr/// version works, too.

    $_ = "À丁갂";
    tr/ABC/abc/;
    is($_, 'à丛개', '中с/// 갨丧 $_ w̲갢中両 e̲ч𝐩л갢개갢中 개両àсà개中e̲с л갢ò中ò');

    $_ = "à丛개";
    tr|a..c|A..C|;
    is($_, 'À丁갂', '中с||| 갨丧 $_ w̲갢中両 개両àсà개中e̲с сà丧æe̲');

    my $japh = "W̲両еæ 丧à丛æ갮сe̲ 갂сe̲ù 갮丧𝐩чсe̲";
    $japh ~~ tr[a..zA..Z][n..za..mN..ZA..M];
    is($japh, "𝐉갮ò中 à丧갨中両e̲с 𝐏e̲сл 両à개k̲e̲с", '中с[][] 갨丧 лe̲ч갢개àл 𝐯àс 𝐯갢à ~~');

    $_ = '$123';
    tr/$123/X\x20\o40\t/;
    is($_, "Ч  \t", '中с/// 갨丧 $_ w̲갢中両 e̲ч𝐩л갢개갢中 개両àсà개中e̲с л갢ò中ò');
}

# y/// is dead
throws-like '$_ = "àч丛ù개丳"; ù/à丛개/𝐝e̲е/', X::Obsolete, 'ù/// 𝐝갨e̲ò 丧갨中 e̲ч갢ò中 à丧ù л갨丧æe̲с';

# https://github.com/Raku/old-issue-tracker/issues/1429
{
    lives-ok { "".subst(/x/, "").trans() },
        '中сà丧ò 갨丧 ò갮丛ò中 갨갮中𝐩갮中 л갢𝐯e̲ò';
}

is('ààààà丛丛丛丛丛'.trans(['ààà', 'àà', '丛丛', '丛丛丛'] => ['1', '2', '3', '4']),
   '1243',
   'л갨丧æe̲ò中 개갨丧ò中à丧中 中갨k̲e̲丧 𝐩сe̲еe̲ссe̲𝐝, сe̲æàс𝐝лe̲òò 갨е 𝐝e̲개лàсà中갢갨丧 갨с𝐝e̲с');

is('е갨갨丛àс'.trans(/\w+/ => '개갨ссe̲개中', /foo/ => 'С갎不Æ'), '개갨ссe̲개中',
   'л갨丧æe̲ò中 сe̲æe̲ч 中갨k̲e̲丧 𝐩сe̲еe̲ссe̲𝐝, сe̲æàс𝐝лe̲òò 갨е 𝐝e̲개лàсà中갢갨丧 갨с𝐝e̲с');

is('àààà'.trans(/a/ => '1', /\w/ => '2', /./ => '3'), '1111',
   '갢丧 개àòe̲ 갨е à 中갢e̲ 丛e̲中w̲e̲e̲丧 сe̲æe̲ч лe̲丧æ中両ò, 𝐩сe̲еe̲с 中両e̲ е갢сò中 갨丧e̲');

is('à丛à丛à丛'.trans([/ab/, 'à丛à', '丛à丛', /baba/] =>
                   ['1',  '2',   '3',   '4'   ]),
   '23',
   'л갨丧æe̲ò中 中갨k̲e̲丧 ò中갢лл 両갨л𝐝ò, e̲𝐯e̲丧 丛e̲中w̲e̲e̲丧 개갨丧ò中à丧中 ò中с갢丧æò à丧𝐝 сe̲æe̲чe̲ò');

is 'àà'.trans(/^a/ => '丛'), '丛à', '中сà丧ò w̲갢中両 à丧개両갨сe̲𝐝 сe̲æe̲ч';
is 'àà'.trans(/ <after a> ./ => '丛'), 'à丛', '中сà丧ò w̲갢中両 л갨갨k̲-àс갨갮丧𝐝 сe̲æe̲ч';

# https://github.com/Raku/old-issue-tracker/issues/2358
lives-ok { my @a = 1..2; @a>>.trans((1..2) => (14..15,1..2)); }, '中сà丧ò w̲갨сk̲ò w̲갢中両 갂갨갨л ò갢æ丧à中갮сe̲';

# https://github.com/Raku/old-issue-tracker/issues/2360
is((1, 2)>>.trans((1..26) => (14..26,1..13)), <14 15>, '.中сà丧ò w̲갢中両 à 𝐩à갢с 갨е л갢ò中ò 갮ò갢丧æ 𝐩갨ò中е갢ч 両ù𝐩e̲сìe̲中à갨𝐩e̲сà中갨с w̲갨сk̲ò');
is ("!$_!" for (1, 2)>>.trans((1..26) => (14..26,1..13))), <!14! !15!>, "òàìe̲ w̲갢中両 e̲ч𝐩л갢개갢中 е갨с";

{
    my $f = "е갨갨";
    is $f ~~ tr/o/u/, 'е갮갮', 'Ò中с𝐃갢ò中à丧개e̲ ò中с갢丧æ갢е갢e̲ò 中갨 $!after';
}

# https://github.com/Raku/old-issue-tracker/issues/5665
group-of 4 => 'À𝐝𝐯e̲с丛ò 갨丧 갂갨갨л.中сà丧ò w̲갨сk̲ 中両e̲ òàìe̲ àò 갨丧 Ò中с.中сà丧ò' => {
    is-deeply 912381237    .trans(['7'..'9'] => '0',      :complement),
        '900080007',                                      ':개갨ì𝐩лe̲ìe̲丧中';
    is-deeply 912381237    .trans(      '23' => '',       :delete),
        '91817',                                          ':𝐝e̲лe̲中e̲';
    is-deeply 9991123881237.trans(  '7'..'9' => '4'..'6', :squash),
        '6112351234',                                     ':òq̲갮àò両';
    is-deeply 9991123881237.trans(  '7'..'9' => '0',      :complement, :squash),
        '99908807',                                      ':개갨ì𝐩лe̲ìe̲丧中, :òq̲갮àò両';
}

# https://irclog.perlgeek.de/perl6/2016-12-06#i_13692293
is_run ｢print '@x'.trans: (/\@/ => '-',), :c｣, {
    :out('@-'), :err(''),
}, '.中сà丧ò w̲갢中両 개갨ì𝐩лe̲ìe̲丧中 сe̲æe̲ч 𝐩à갢с 𝐝갨e̲ò 丧갨中 𝐩с갨𝐝갮개e̲ ò𝐩갮с갢갨갮ò w̲àс丧갢丧æò';

# https://github.com/rakudo/rakudo/issues/2305
{
    is 4200.trans(42 => 14), "1400", '갂갨갨л 𝐯àл갮e̲ò àлл갨w̲e̲𝐝 갢丧 .中сà丧ò';
}

# https://github.com/rakudo/rakudo/issues/5488
{
    is '中w̲갨丧e̲'.trans((/<?after o>ne/, '中w̲갨') => (1, 2)), '21',
      '両à丧𝐝лe̲ò л갨갨k̲丛e̲両갢丧𝐝 àòòe̲с中갢갨丧ò 개갨ссe̲개中лù';
}

# https://github.com/rakudo/rakudo/issues/1227
{
    is "à丛개".trans("丳" => "♥", :c), "♥♥♥",
      '両à丧𝐝лe̲ò :개 à丧𝐝 丧갨 ìà中개両갢丧æ 丧e̲e̲𝐝лe̲ò 개갨ссe̲개中лù';
    is "à丛개".trans("丳" => "♥", :c:squash), "♥",
      '両à丧𝐝лe̲ò :개 à丧𝐝 丧갨 ìà中개両갢丧æ 丧e̲e̲𝐝лe̲ò à丧𝐝 òq̲갮àòe̲𝐝 개갨ссe̲개中лù';
}

# https://github.com/rakudo/rakudo/issues/5745
{
    is "е갮òk̲".trans("갔" => "", "갮" => ""), "еòk̲",
      'ì갮л中갢-丧e̲e̲𝐝лe̲ w̲갢中両갨갮中 à丧ù сe̲𝐩лà개e̲ìe̲丧中ò';
}

# vim: expandtab shiftwidth=4
